import React, { useState } from 'react';
import {
    View,
    Text,
    TouchableOpacity,
    Dimensions,
    StyleSheet,
    TextInput,
    ScrollView,
    Image
} from 'react-native';
import { useNavigation, NavigationContainer } from '@react-navigation/native';
import { createNativeStackNavigator } from '@react-navigation/native-stack';
import { COLORS, PADDING, MARGIN, RADIUS, FONTS, ICONSSIZE } from '../constants/Constants'
import Ionicons from 'react-native-vector-icons/Ionicons'
import * as Animatable from 'react-native-animatable';
const { width, height } = Dimensions.get('window');
import LottieView from 'lottie-react-native';


export default function AllDessert() {
    const [Food, setFood] = useState(
        [
            {
                categortType: 3,
                Image: require("../img/cccth.jpeg"),
                name: "بسبوسة محشيه",
                Elta7der: '5 min',
                Eltahy: "20 min",
                Elsouba: "40",
                components: "بيضتين\n1/2 كاس سكر\n1/2 كاس زيت\nعلبة قشطة\nفانيللا\nملعقه كبيره بيكنج باودر\nكاس ونصف سميد\nمكونات المهلبيه ع النار:\nكاسين ماء\n6 ملاعق حليب بودره\n4 ملاعق نشا\n4 حبات جبن كيري\nملعقتين سكر\nظرف دريم ويب + علبة قشطة قيمر",
                view: true,
                Step: "نخلط مقادير البسبوسة ونصب ثلث الكمية بصينية الفرن وتدخل حتى الاستواء.\nنخلط جميع مقادير المهلبيه عدا الدريم ويب والقشطة الى ان تثقل ثم نطفئ النار ونضع القشطة والدريم ويب ونخلط حتى يمتزج ثم تصب فوق البسبوسه.\nنضيف حليب سائل الى ماتبقى من خليط البسبوسه حتى يكون شبه سائل ويوزع فوق المهلبيه ويدخل الفرن من الأعلى حتى يشقر وتخرج وتصب شيره او حليب محلى ثم تبرد جيداً وتقدم.",
                time: "25 min",
                video: "https://www.youtube.com/watch?v=xUMtd9exdBM"

            },
            {
                categortType: 1,
                Image: require("../img/54th.jpeg"),
                name: "ام علي",
                Elta7der: '10 min',
                Eltahy: "40 min",
                Elsouba: "60",
                components: "8 شرائح بف باستري اي نوع موجود\nخليــط الحليــب \n4 اكواب حليب سايل اي نوع ندى اوالمراعي\n1 علبة قشطة\n1/3 كوب حليب مكثف محلى\nخلــط المكســرات \n1 ملعقة كبيره زبدة\n2 او اكثر لوز مجروش - بندق مجروش\n3 ملاعق جوز هند \nللوجــه (فستق مجروش)\nللتغطيــة\n1 قشطة (لونا او المراعي او اي نوع)\n1 دريب ويب\n2 ملعقه كبيره حليب سائل (ملاحظة) الحيب للتغطيه يسهل عملية دمج القشطة والدريم ويب اذا تبينها ثقيله حطي ملعقتين حليب واذا خفيفه نوعاً ما زودي شوي من كمية الحليب )",
                view: true,
                Step: "ندخل البف باستري بالفرن على درجة حراره ١٨٠ من تحت حتى تأخذ اللون الذهبي ثم من الاعلى ثم نطلعها ونتركهاا تبرد وبعد ماتبرد نقصصها ااتقطيع صغير (ملاحظة البف يتحمر بسرعه اذا كان الفرن مسبق التشغيل) ثم يتم توزيع البف باستري بصينيه او صواني فخار كميةمتوسطة حتى نضع خليط المكسرات ونضع الباقي من البف باستري\nنأخذ (خليط المكسرات) بقلايه ونذوب الزبدة ونحمر المكسرات عليهاا بعد ماتتحمّر المكسرات مع الزبدة نضيف الجوز الهند بعدهاا اوزع خليط المسكرات على البف اللي وزعته بالصواني ثم نرجع نضع باقي البف باستري\nنخلط الحليب - مع القشطة - وحليب النستله المحلى مع بعض ثم نضعه على النار حتى تغلي ونصبة في على البف باستري الموزع بالتساوي ونسيقه فيه\nنخلط القشطة والدريم ويب والحليب مع بعض الى ان تتجانس ونوزعه على الوجه\nثم نضع الصينية داخل الفرن من الأعلى فقــط للتحمير وتأخذ التغطيه اللون الذهبي ",
                time: "50 min",
                video: "https://www.youtube.com/watch?v=PHPZllvsypo"
            }, 
            {
                categortType: 1,
                Image: require("../img/t2h.jpeg"),
                name: "كوكيز بدون زبدة وسكر",
                Elta7der: '10 min',
                Eltahy: "40 min",
                Elsouba: "40",
                components: "بيضة\nفنجال او 50 مل طحينة سايلة\nملعقتين كبيرة زبدة الفول السوداني\n8 تمرات بدون نوى\nفنجال او 50 مل محلي سائل عسل او دبس، استخدمت شراب الأجاف agave\nرشة ملح وقرفة وهيل\nملعقة صغيرة باكنج بودر\n ملعقة صغيرة باكنج صودا\n كاس شوفان مطحون\n جوز ولوز مكسر حسب الرغبة\nزبيب\nحبيبات الشوكولاتة",
                view: true,
                Step: "تخلط المقادير في محضرة الطعام حتى تتجانس ثم يضاف الشوفان ويخلط\nيضاف لها الزبيب والمكسرات والشوكولاتة وتقلب ويفرغ الخليط في صينية مدهونة بالطحينة وترش برقائق الملح اختياري\nيدخل فرن حار على ١٨٠ درجة مدة عشر دقائق الى ربع ساعة او حتى تستوي. تترك لتبرد ثم تقطع\nهذي حبيبات الشوكولاتة العضوية الخام المستخدمة. افضل خيار للاستمتاع بفوائد الشوكولاتة بدون اي اضافات من دهون او سكر. اخذته من لولو ماركت ويتوفر في ايهرب",
                time: "50 min",
                video: "https://www.youtube.com/watch?v=tarEKpgAynM"
            },
            {
                categortType: 1,
                Image: require("../img/c83cec3ab81e6701b37ed191684ffca1_w750_h500.jpg"),
                name: "صوص الشوكولاتة السريع",
                Elta7der: '5 min',
                Eltahy: "20 min",
                Elsouba: "10",
                components: " الكاكاو : ثلثان الكوب\n الماء : كوب وربع\n سكر : كوب وثلثا الكوب\n الفانيليا : ملعقة صغيرة",
                view: true,
                Step: "سخني قدر متوسط على نار متوسطة، وأضيفي الكاكاو، والماء، والسكر، اخلطيهم معاً.\nاتركي المزيج يغلي لمدة دقيقة.\nارفعي القدر عن النار، وأضيفي الفانيليا، ثم قلبي الصوص مرة أخرى.\nقدميه مع الكيك والبسكويت. ",
                time: "25 min",
                video: "https://www.youtube.com/watch?v=96dxIl0IpsQ"
            },
            {
                categortType: 1,
                Image: require("../img/b59e92dcec3a53710c6ff754f0c705d7_w750_h500.jpg"),
                name: "كريب ريد فلفت",
                Elta7der: '5 min',
                Eltahy: "20 min",
                Elsouba: "10",
                components: "- حليب : كوب\n- سكر : 3 ملاعق كبيرة\n- دقيق : كوب\n- الزبدة : ملعقة كبيرة\n- الآيس كريم : كوب\n- الزيت النباتي : 2 ملعقة كبيرة\n- الشوكولاتة : كوب (سائلة)\n- الفانيليا : ملعقة صغيرة\n- ملون الطعام الاحمر : 2 نقطة",
                view: true,
                Step: "أحضري وعاء، واخلطي البيض، والحليب، والدقيق، والسكر، وملون الطعام، والفانيليا، والزبدة.\nأحضري مقلاة، وضعي مغرفة من الخليط مع القليل من الزيت، واقلي الكريب على الوجهين حتى ينضج.\nكرري العملية حتى انتهاء الكمية.\nاحشي الكريب بالآيس كريم، ولفيه رول، ثم زينيه بالشوكولاتة السائلة وقدميه",
                time: "25 min",
                video: "https://www.youtube.com/watch?v=_nui4biqXuM"
            },
            {
                categortType: 1,
                Image: require("../img/7b463add022ac44559167d7661ecf5f8_w750_h500.jpg"),
                name: "كريب رول بالشوكولاتة",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: "- للحشو :\n شوكولاتة نيوتيلا \n الفواكة : حسب الرغبة\n- البيض : 2 حبة\n- الفانيليا : ملعقة كبيرة (سائلة)\n- الزبدة : 2 ملعقة كبيرة\n- سكر : 2 ملعقة كبيرة\n- الزيت النباتي : ملعقة كبيرة\n- حليب : كوب\n- دقيق : 2 كوب",
                view: true,
                Step: " البيض والفانيلا بالمضرب اليدوي.\nأضيفي الزبدة والسكر مع الخفق بعد كل إضافة.\nإبدأي بإضافة الزيت والحليب واخفقي.\nأضيفي الدقيق للمزيج السابق واخفقي جيداً حتى تتجانس المكونات.\nقومي بتسخين مقلاة واسعة على النار وخذي مقدار من العجينة ووزعيها بالمقلاة بالتساوي واتركي العجينة حتى تنضج من الأسفل ثم اقلبيها على الوجه الآخر.\nقومي بوضع حبات الكريب الجاهز في طبق جانبي.\nكرري الخطوة السابقة حتى الانتهاء من الكمية.\nاحشي حبات الكريب بشوكولاتة النوتيلا ولفيها على شكل رولات وضعيها في طبق التقديم وزيني بالفواكة المشكلة بحسب الرغبة",
                time: "40 min",
                video: "https://www.youtube.com/watch?v=yk0_1lQ8HFs"
            },
            {
                categortType: 1,
                Image: require("../img/0849c2d982feb7746395b9aefc19ae95_w750_h500.png"),
                name: "كريب بالنوتيلا بدون بيض",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: "- حليب : نصف كوب\n- الماء : ثلاث أرباع الكوب\n- الزبدة : 3 ملاعق كبيرة (مذابة)\n- الفانيليا : ملعقة صغيرة\n- طحين : كوب\n- سكر : ملعقة كبيرة\n- ملح : ربع ملعقة صغيرة\n- الزيت النباتي : ملعقة كبيرة\n- شوكولاتة نيوتيلا : نصف كوب\n- بندق : ربع كوب (مفروم خشن)",
                view: true,
                Step: "في وعاء متوسط الحجم، ضعي الحليب، الماء، الزبدة والفانيليا ثم اخلطي المكونات حتى تتجانس.\nاخلطي في وعاء آخر كل من الدقيق، السكر والملح لتتداخل المكونات جيداً.\nأضيفي مزيج الحليب إلى الخليط ثم اخفقي المكونات جيداً بواسطة خفاق يدوي حتى تحصلي على مزيج متجانس.\nغطي وعاء المزيج ثم أدخليه لمدة ساعتين إلى الثلاجة.\nحمي مقلاة غير لاصقة على النار، اسكبي مقدار ملعقتان كبيرتان في الوسط ثم اتركي العجينة حتى تظهر فقاعات على وجهها.\nاقلبي العجينة على الجهة الثانية ثم اتركيها حتى تصبح ذهبية اللون.\nأعيدي الكرة حتى انتهاء الكمية.\nادهني الشوكولاتة النوتيلا على الكريب وزيني بالبندق وقدميه",
                time: "40 min",
                video: "https://www.youtube.com/watch?v=N6mV52NZwjc"
            },
            {
                categortType: 1,
                Image: require("../img/8e4d2ffed7f9be71695ef1bcea4ce84a_w750_h500.jpg"),
                name: "كيكة اسفنجية بالشوكولاتة بدون بيض",
                Elta7der: '10 min',
                Eltahy: "50 min",
                Elsouba: "50",
                components: "- طحين : 3 اكواب\n- سكر : 2 كوب\n- ملح : ملعقة صغيرة\n- بيكنج صودا : 2 ملعقة صغيرة\n- بودرة الكاكاو : نصف كوب\n- الزيت النباتي : ثلاث أرباع الكوب\n- الخل الأبيض : 2 ملعقة كبيرة\n- الفانيليا : 2 ملعقة صغيرة\n- ماء بارد : 2 كوب",
                view: true,
                Step: "انخلي الطحين في وعاء\nأضيفي الملح والكاكاو البودرة والبيكنج صودا والسكر\nأضيفي الزيت والخل والفانيلا والماء البارد واخفقي حتى تتجانس المكونات\nصبي المزيج في صينية كيك مدهونة بالزبدة ورشة طحين\nأدخلي الصينية الفرن على حرارة 175 درجة لمدة 40 دقيقة أو حتى ينضج الكيك\nأخرجي الصينية من الفرن واتركيها لمدة 10 دقائق ثم زينيها حسب الرغبة",
                time: "1 h",
                video: "https://www.youtube.com/watch?v=iuJysb4NzO0"
            },
            {
                categortType: 1,
                Image: require("../img/4b30d44fc3e59d1e825b724c6047d702_w750_h500.jpg"),
                name: "كب كيك كوكيز",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: "- طحين : كوب وثلاثة ارباع الكوب\n- ملح : نصف ملعقة صغيرة\n- بيكنج صودا : ملعقة صغيرة\n- الزبدة : نصف كوب (مذابة)\n- سكر : نصف كوب (أبيض)\n- زبدة الفول السوداني : نصف كوب\n- السكر البني : نصف كوب\n- البيض : 1 حبة (مخفوق)\n- مستخلص الفانيليا : ملعقة صغيرة\n- حليب : 2 ملعقة كبيرة",
                view: true,
                Step: "حمّي الفرن على درجة حرارة 180 مئوية.\nفي وعاء، نخلّي الطحين، والملح، والبيكنج صودا، واتركيه جانباً.\nاخفقي الزبدة مع السكر، وزبدة الفول السوداني، والسكر البني، جيداً حتى تتجانس المكونات.\nأضيفي البيض، والفانيليا، والحليب مع الخفق باستمرار.\nأضيفي خليط الطحين واستمري في الخفق.\nاصنعي من الخليط كرات متساوية في الحجم، وضعي كل واحدة في كوب من أكواب قالب ميني مافن غير مدهون.\nاخبزي القالب في الفرن لمدة 8 دقائق.\nأخرجي القالب من الفرن، واتركيه جانباً حتى يبرد ثم قدميه",
                time: "40 min",
                video: "https://www.youtube.com/watch?v=DojBA7kGbZ0"
            },

            {
                categortType: 1,
                Image: require("../img/cd69ebce4a01358cf8aa3a9b0c035949_w750_h500.jpg"),
                name: "زبدة الفول السوداني",
                Elta7der: '5 min',
                Eltahy: "20 min",
                Elsouba: "30",
                components: "- الفول السوداني : 2 كوب (غير مملح)",
                view: true,
                Step: "حمّي الفرن على درجة حرارة 180 مئوية.\nحضري صينية فرن ووزعي بها الفول السوداني، ثم أدخلي الصينية إلى الفرن لمدة 10 دقائق حتى يصبح الفول ذهبي اللون.\nفي وعاء الخلاط الكهربائي، ضعي الفول السوداني وهو دافئ دون أي إضافات، ثم اطحنيه حتى يصبح ناعم القوام.\nاحفظي زبدة الفول السوداني في وعاء زجاجي لحين الاستخدام",
                time: "25 min",
                video: "https://www.youtube.com/watch?v=0U8J8-dLm34"
            },
            {
                categortType: 1,
                Image: require("../img/bc0ab7efdd9f05b3cb96d4b91c6d8700_w750_h500.jpg"),
                name: "كيك الشوكولاتة بكريمة الفدج",
                Elta7der: '10 min',
                Eltahy: "90 min",
                Elsouba: "50",
                components: "- دقيق : كوبان وثلث الكوب\n- سكر : ثلاث أرباع الكوب\n- الزبدة : ثلاث أرباع الكوب (مذوبة)\n- زيت الذرة : نصف كوب\n- الكريما الحامضة : نصف كوب (ساور كريم)\n- السكر البني : ثلث كوب\n- الكاكاو : ربع كوب (خام)\n- البيض : 3 حبات\n- الفانيليا : ملعقة كبيرة (سائلة)\n- بيكنج بودر : 2 ملعقة صغيرة\n- بيكنج صودا : ملعقة صغيرة\n- ملح : نصف ملعقة صغيرة\n- رقائق الشوكولاته : ثلاث أرباع الكوب\n- سكر البودرة : كوب وثلاثة ارباع الكوب\n- الزبدة : كوب (بدرجة حرارة الغرفة)\n- الفانيليا : ملعقة كبيرة (سائلة)",
                view: true,
                Step: "1. لتحضير الفدج: على بخار مائي، ضعي رقائق الشوكولاتة، وقلبيها حتى تذوب، ثم ارفعيها واتركيها جانباً.\n2. في وعاء كبير، ضعي الزبدة، واخفقيها بالمضرب الكهربائي لمدة 3 دقائق.\n3. أضيفي السكر تدريجياً، مع الاستمرار بالخفق، حتى يصبح القوام كالكريمة.\n4. أضيفي الفانيليا والشوكولاتة، واخفقي حتى تختلط المكونات تماماً، ثم ضعيها في الثلاجة لحين تحضير الكيك.\n5. لتحضير الكيك: سخني الفرن عند درجة حرارة 180.\n6. في وعاء كبير، ضعي الدقيق والسكر بنوعيه والكاكاو والبيكنج باودر وبيكربونات الصودا والملح، وقلبي جيداً.\n7. في وعاء آخر، ضعي البيض والساور كريم والفانيليا، واخفقي بالمضرب الكهربائي، حتى تختلط المكونات.\n8. في وعاء آخر، ضعي الزيت والزبدة المذابة، واخفقي بالمضرب الكهربائي، حتى يختلطا تماماً.\n9. أضيفي خليط الدقيق إلى الزيت، واخفقي جيداً، ثم أضيفي خليط البيض واخفقي جيداً.\n10. صبي العجين في صينية مدهونة بالزبدة ومرشوشة بالقليل من الكاكاو.\n11. ضعي الصينية في الفرن لمدة 45 – 50 دقيقة، ثم أخرجيها واتركيها تبرد تماماً.\n12. اقطعي الكيك بالعرض من المنتصف، ثم ضعي ربع كمية الفدج في المنتصف، ثم زينيها من الأعلى والجوانب بباقي الفدج.",
                time: "1 h 40 min",
                video: "https://www.youtube.com/watch?v=eWOT3n6eSOc"
            },
            {
                categortType: 2,
                Image: require("../img/ebe83d0b7f6f467eb20355ff0f9a220d_w750_h500.jpg"),
                name: "مهلبية البرتقال السريعة",
                Elta7der: '5 min',
                Eltahy: "40 min",
                Elsouba: "50",
                components: "- حليب : كيلو\n- عصير البرتقال : كوب\n- برش البرتقال : 1 حبة\n- الزبدة : 2 مكعب\n- النشاء : 5 ملاعق كبيرة\n- الفانيليا : حسب الرغبة\n- سكر : حسب الحاجة",
                view: true,
                Step: "في قدر عميق على النار، ضعي الحليب مع عصير البرتقال، ثم أضيفي بشر البرتقال، والفانيليا، والسكر وقلبي.\nأضيفي مكعبات الزبدة.\nذوبي النشا مع القليل من الحليب البارد، ثم أضيفي المزيج إلى الخليط.\nقلبي حتى يتجانس ويتشكل لديكِ القوام المطلوب.\n اسكبي المهلبية في أطباق التقديم، وضعيها في الثلاجة حتى تبرد قبل التقديم.",
                time: "45 min",
                video: "https://www.youtube.com/watch?v=vxsnZPF8Yns"
            },
            {
                categortType: 2,
                Image: require("../img/73b4400bfd3e65a57e083c16720e1606_w750_h500.jpg"),
                name: "مهلبية بالمانجو",
                Elta7der: '10 min',
                Eltahy: "60 min",
                Elsouba: "40",
                components: "- حليب بودرة : 6 ملاعق كبيرة\n- الماء : كوبان وربع\n- سكر : ملعقة كبيرة\n- عصير المانغو : 2 كوب\n- النشاء : 2 ملعقة كبيرة\n- ماء الزهر : 2 ملعقة كبيرة",
                view: true,
                Step: "لتحضير خليط المانجو: في وعاء، اخلطي ربع كوب من الماء مع النشا وعصير المانجو، ثم ضعي المزيج في قدر على النار وحركي حتى يبدأ بالغليان ويكثف قوامه.\nفي قدر آخر، اخلطي كمية الماء المتبقية مع الحليب البودرة، والنشا، والسكر، وحركي المكونات جيداً على نار متوسطة حتى يبدأ بالغليان ويصبح كثيف وكريمي القوام، ثم ارفعي القدر عن النار وأضيفي ماء الزهر وحركي.\nاسكبي خليط المهلبية في أكواب التقديم، واتركيه قليلاً حتى يبرد، ثم اسكبي فوقه خليط المانجو.\nضعي أكواب المهلبية في الثلاجة لمدة 4 ساعات قبل التقديم، وزينيها بقطع المانجو على الوجه وقدميها باردة",
                time: "1 h 10 min",
                video: "https://www.youtube.com/watch?v=ZkfncCNUlkI"
            },
            {
                categortType: 2,
                Image: require("../img/eeefb20bb4b5e29f3acc1404a144c03b_w750_h500.jpg"),
                name: "مهلبية بالقشطة",
                Elta7der: '5 min',
                Eltahy: "25 min",
                Elsouba: "30",
                components: "- حليب : 6 اكواب\n- النشاء : 6 ملاعق كبيرة\n- القشطة : علبة\n- مستكة : ملعقة صغيرة (مطحونة)\n- كريمة : مغلف (بودرة)\n- ماء الزهر : ملعقة كبيرة\n- سكر : كوب\n- فستق حلبي : ربع كوب (مفروم خشن / للزينة)",
                view: true,
                Step: "اخلطي الحليب مع السكر والنشا في قدر على نار متوسطة بواسطة المضرب اليدوي حتى يذوب السكر.\nأضيفي علبة القشطة، وحركي حتى تختلط المكونات.\nأضيفي المستكة المطحونة، ومغلف بودرة الكريمة، وماء الزهر وحركي.\nحركي المزيج حتى يبدأ بالغليان ويتحول لمزيج كثيف وكريمي.\nاسكبي المهلبية بأكواب التقديم، وأدخليها للثلاجة مدة 3 ساعات قبل التقديم.\nعند التقديم زيني بالفستق الحلبي وقدميها باردة",
                time: "30 min",
                video: "https://www.youtube.com/watch?v=4GauvheG4aI"
            },
            {
                categortType: 2,
                Image: require("../img/5464th.jpeg"),
                name: "مهلبية الآيس كريم",
                Elta7der: '5 min',
                Eltahy: "25 min",
                Elsouba: "25",
                components: "- الماء : 3 اكواب\n- حليب : كوب وربع (مجفف)\n- سكر : كوب\n- النشاء : 5 ملاعق كبيرة\n- القشطة : كوب\n- كريمة : 3 باكيت (بودرة جاهزة)\n- فستق حلبي : 4 ملاعق كبيرة",
                view: true,
                Step: "1. أحضري كاسات تقديم.\n2. في كسرولة ضعي الماء، الحليب، السكر، النشا، باستعمال مضرب شبك قلبي ليختلط ثم سخني على نار متوسطة مع استمرار التقليب بهدوء لتحصلي على مهلبية ناعمة.\n3. أضيفي القشطة والكريمة قلبي ليختلط.\n4. وزعي المهلبية على الكاسات.\n5. ضعي المهلبية في البراد لعدة ساعات.\n6. انثري الفستق وقدميها.",
                time: "30 min",
                video: "https://www.youtube.com/watch?v=gNjsBypLU2M"
            },
            {
                categortType: 2,
                Image: require("../img/cc43f268a41c5cd29a78ba55a5473c98_w750_h500.jpg"),
                name: "مهلبية بالنشا واللبن",
                Elta7der: '5 min',
                Eltahy: "30 min",
                Elsouba: "25",
                components: "- حليب : كوب\n- سكر : 2 ملعقة كبيرة\n- نشاء الذرة : ملعقة كبيرة\n- ماء الورد : ملعقة صغيرة",
                view: true,
                Step: "ضعي الحليب والسكر في قدر على النار واتركيه إلى أن يغلي.\nذوّبي النشا بالقليل من الماء وأضيفيه بشكل تدريجي إلى خليط الحليب والسكر وقلبي جيداً حتى يثخن القوام.\nارفعي المزيج عن النار، ثم أضيفي ماء الورد وحركي قليلاً.\nاسكبي المهلبية في أكواب التقديم، ثم زينيها بالمكسرات، وجوز الهند، والزبيب، بحسب الرغبة، ثم قدميها باردة",
                time: "35 min",
                video: "https://www.youtube.com/watch?v=ogI4S49bL0k"
            },
            {
                categortType: 2,
                Image: require("../img/4a9e01c0b201c34c264b2144cb53c41b_w750_h500.jpg"),
                name: "مهلبية اللوز والكاسترد",
                Elta7der: '5 min',
                Eltahy: "20 min",
                Elsouba: "25",
                components: "- الماء : ليتر (بدرجة حرارة الغرفة)\n- حليب بودرة : كوب\n- بودرة الكاسترد الجاهزة : 4 ملاعق كبيرة\n- القشطة : علبة\n- سكر : 3 ملاعق كبيرة\n- هيل : نصف ملعقة صغيرة (مطحون)\n- ماء الورد : ملعقة كبيرة\n- لوز : ربع كوب",
                view: true,
                Step: "في قدر على نار متوسطة اخلطي الماء مع الحليب.\nأضيفي بودرة الكاسترد، والسكر، والقشطة، والهيل وحركي المكونات جيداً حتى يغلي المزيج، ومن ثم خففي النار مع الإستمرار في التحريك حتى يكثف القوام.  \nارفعي القدر عن النار، ثم أضيفي ماء الورد وحركي جيداً.\nاسكبي المهلبية في أكواب التقديم وزينيها باللوز، ثم قدميها",
                time: "25 min",
                video: "https://www.youtube.com/watch?v=vDuGzna8NcA"
            },
            {
                categortType: 2,
                Image: require("../img/5d4baa40180bb6661e72ebe3db61d3c4_w750_h500.jpg"),
                name: "مهلبية الموز",
                Elta7der: '5 min',
                Eltahy: "25 min",
                Elsouba: "25",
                components: "- الموز : 4 حبات\n- عصير الليمون : نصف حبة\n- لبن : 2 كوب\n- سكر : 4 ملاعق كبيرة\n- النشاء : ملعقة صغيرة\n- الفانيليا : ملعقة صغيرة\n- الموز : 1 حبة (للتزيين / حسب الرغبة)",
                view: true,
                Step: "في وعاء، اخلطي الموز مع عصير الليمون وقومي بهرسه جيداً.\nذوبي النشا في القليل من الحليب ثم ارفعي باقي كمية الحليب على نار متوسطة.\nأضيفي النشا والسكر والفانيليا إلى الحليب عندما يصل إلى مرحلة الغليان وقلبي جيداً.\nأضيفي مهروس الموز إلى الخليط وقلبي جيداً.\nبعد أن يبرد صبي المهلبية في أطباق التقديم وزينيها بشرائح الموز",
                time: "30 min",
                video: "https://www.youtube.com/watch?v=lwoQwnAujRg"
            },
            {
                categortType: 2,
                Image: require("../img/1522b111cd5b349f67273c76e8a8a23c_w750_h500.jpg"),
                name: "مهلبية الجوافة",
                Elta7der: '5 min',
                Eltahy: "25 min",
                Elsouba: "25",
                components: "- حليب : نصف لتر\n- عصير جوافة : 500 مل\n- سكر : 150 غراماً\n- الفانيليا : 6 غم\n- الزبدة : 50 غم (مقطعة)\n- النشاء : 50 غم\n- الماء : 100 ملليلتر",
                view: true,
                Step: "1. في قدر على النار، نضع الحليب، وعصير الجوافة، والسكر، والفانيلا، ونقلب المكونات مع بعضها البعض، حتى التأكد من ذوبان السكر.\n2. في وعاء آخر، نذوب النشا مع الماء، حتى يذوب النشا.\n3. نضيف الزبدة، وخليط النشا والماء، على خليط الحليب وعصير الجوافة، ونحرك حتى نحصل على قوام كثيف.\n 4. تصب مهلبية الجوافة بصينية الفرن، وتدخل للفرن حتى يحمر وجهها. وتقدم.",
                time: "30 min",
                video: "https://www.youtube.com/watch?v=br_J1MPbLEM"
            },
            {
                categortType: 1,
                Image: require("../img/1a7ed0813b00fb1b83935a2d4f9d1739_w750_h500.jpg"),
                name: "البيتيفور",
                Elta7der: '10 min',
                Eltahy: "50 min",
                Elsouba: "50",
                components: "- الزبدة : ثلاث أرباع الكوب (طرية)\n- دقيق : كوب\n- الفانيليا : ملعقة صغيرة\n- البيض : 1 حبة\n- سكر : كوب (مطحون)\n- كرز : نصف كوب (مجفف ومفروم)",
                view: true,
                Step: "اخلطي الزبدة والسكر البودرة بمحضرة الطعام حتى يصبح المزيج كريمي.\nأضيفي البيضة والفانيلا واخفقي.\nأضيفي الدقيق واخفقي حتى تتكون عجينة ناعمة.\nضعي العجين بالقمع الخاص بتشكيل البيتفور وشكلي وردات صغيرة.\nضعي البيتيفور بصينية مبطنة بورق الزبدة.\nضعي قطعة من الكرز في منتصف كل حبة.\nأدخلي الصينية للفرن على درجة حرارة 180 لمدة 14 دقيقة.\nأخرجي الصينية من الفرن واتركي البيتيفور يبرد وقدميه.",
                time: "1 h",
                video: "https://www.youtube.com/watch?v=0Ncw53jpfV8"
            },
            {
                categortType: 1,
                Image: require("../img/6dffe6a2c55b0d3be844559538e53bff_w750_h500.jpg"),
                name: "شوكولاتة بدون سكر",
                Elta7der: '10 min',
                Eltahy: "50 min",
                Elsouba: "50",
                components: "- الكاكاو : نصف كوب (خام)\n- زيت جوز الهند : نصف كوب\n- لوز : حسب الرغبة (مجروش)\n- العسل : 2 ملعقة كبيرة",
                view: true,
                Step: "ضعي نصف كمية الزيت في وعاء للخلط.\nأضيفي العسل والكاكاو بالتدريج مع التقليب بعد كل إضافة حتى لا تتكون أي تكتلات في الخليط.\nقومي بتوزيع خليط الشوكولاتة في قالب سيليكون.\nأضيفي اللوز المجروش في القوالب الصغيرة على الوجه.\nأدخلي القالب إلى الفريزر حتى تجمد الشوكولاتة.\nأخرجي الشوكولاتة من الفريزر وقدميها بحسب الرغبة",
                time: "1 h",
                video: "https://www.youtube.com/watch?v=86t0XD0oPUQ"
            },
            {
                categortType: 1,
                Image: require("../img/ec0350670ed17367d7a78b6d7f5726b4_w750_h500.jpg"),
                name: "لبن زبادي بالفراولة",
                Elta7der: '5 min',
                Eltahy: "10 min",
                Elsouba: "20",
                components: "- لبن زبادي : 3 اكواب\n- الفراولة : 2 كوب (مفرومة)\n- السكر الناعم : نصف كوب (بودرة)\n- الفراولة : حسب الرغبة (مقطعة أنصاف / للتزيين)",
                view: true,
                Step: "ضعي الزبادي والسكر وكوباً من الفراولة في الخلاط على سرعة متوسطة إلى أن يصبح الخليط ناعماً.\nأضيفي الكمية الباقية من الفراولة وقلبي ثم ضعي الزبادي في الثلاجة حتى يبرد تماماً.\nقومي بتوزيع الزبادي في الأكواب وزيني بالفراولة.",
                time: "15 min",
                video: "https://www.youtube.com/watch?v=zTfwvek7qmo"
            },
            {
                categortType: 1,
                Image: require("../img/89a3ec2249273fc52325bd98a9e34f46_w750_h500.jpg"),
                name: "كيكة زبادي بالشربات",
                Elta7der: '10 min',
                Eltahy: "50 min",
                Elsouba: "40",
                components: "- مقادير الشربات :\nسكر : كوب\nالماء : ثلث كوب\nعصير الليمون : ملعقة صغيرة\nماء الورد : ملعقة صغيرة\n- زبادي : كوب\n- طحين : كوبان ونصف (منخل)\n- البيض : 3 حبات\n- سكر : كوب\n- الفانيليا : ملعقة صغيرة\n- بيكنج بودر : 2 ملعقة صغيرة\n- بيكربونات الصودا : نصف ملعقة صغيرة\n- الزيت : نصف كوب",
                view: true,
                Step: "سخني الفرن على درجة حرارة 180 مئوية، وجهزي قالب الكيك بدهنه بالزيت ورشة طحين أو بالزبدة.\nفي وعاء للخلط: ضعي السكر والبيض والفانيلا واخفقي المكونات باستخدام المضرب الكهربائي حتى الحصول على مزيج متجانس وقوام كريمي.\nأضيفي الزيت واستمري بالخفق.\nفي وعاء آخر اخلطي المكونات الجافة التالية: الطحين، والملح، وبيكربونات الصودا، والبيكنج باودر، وأضيفي المكونات الجافة على السائلة مع إضافة الزبادي حتى تمتزج المكونات مع بعضها البعض جيداً.\nصبي خليط الكيك في القالب وأدخليه إلى الفرن لمدة 40 – 45 دقيقة حتى تمام نضج الكيك.\nأخرجي الكيك من الفرن ويترك حتى يبرد تماماً.\nلتحضير الشربات: امزجي السكر والماء في وعاء على النار حتى درجة الغليان، ثم أضيفي ماء الورد وعصير الليمون وقلبي المكونات حتى الحصول على مزيج الشربات المطلوب.\nوزعي الشربات على الكيك حتى يتشرب الكيك الشربات جيداً وزيني الكيك بحسب الرغبة.",
                time: "1 h",
                video: "https://www.youtube.com/watch?v=WkV2S_qVEbQ"
            },
            {
                categortType: 1,
                Image: require("../img/eb39a2eb90f3a572ab87e8c573c25d46_w750_h500.jpg"),
                name: "كيكة الزبادي الاسفنجية",
                Elta7der: '10 min',
                Eltahy: "50 min",
                Elsouba: "40",
                components: "- للكيك :\nالزيت النباتي : ثلاث أرباع الكوب\nالبيض : 2 حبة\nبرش ليمون : ملعقة كبيرة\nعصير الليمون : 2 ملعقة كبيرة\nلبن زبادي : كوب\nسكر : كوب وثلاثة ارباع الكوب\nدقيق : 2 كوب\nبيكنج بودر : 2 ملعقة صغيرة\n- للتغطية :\nسكر البودرة : نصف كوب\nعصير الليمون : ربع كوب",
                view: true,
                Step: "اخفقي الزيت والبيض وبرش الليمون وعصير الليمون واللبن والسكر في وعاء كبير حتى يمتزجوا تماماً.\nأضيفي الدقيق والبكينج باودر واخفقي برفق حتى الامتزاج.\nادهني قالب الكيك ببعض الزيت ثم صبي فيه خليط الكيك واخبزي الكيك في فرن حامي على درجة حرارة  180 مئوية لمدة 30 دقيقة.\nحضري طبقة التغطية عن طريق خلط السكر البودرة وعصير الليمون معاً.\nاقلبي الكيك رأساً على عقب على طبق التقديم ورشي على سطحه طبقة التغطية بينما لا يزال ساخناً.",
                time: "1 h",
                video: "https://www.youtube.com/watch?v=fsstwbXlJ-o"
            },
            {
                categortType: 1,
                Image: require("../img/90ba876e49b6a5a2e1986d6b647072cc_w750_h500.jpg"),
                name: "معمول بالمكسرات",
                Elta7der: '10 min',
                Eltahy: "110 min",
                Elsouba: "80",
                components: "- لتحضير حشوة الفستق الحلبي :\nفستق حلبي : 250 غراماً (مجروش)\nقطر : ربع كوب (ثقيل)\n- لتحضير حشوة الجوز :\nالجوز : 250 غراماً (مجروش)\nالقرفة : ملعقة صغيرة\nقطر : ربع كوب (ثقيل)\n- سميد خشن : 8 اكواب\n- سميد ناعم : 3 اكواب\n- الزبدة : حسب الحاجة\n- الماء : كوب ونصف\n- سكر : 2 كوب\n- خميرة : ملعقة كبيرة\n- المحلب : 2 ملعقة صغيرة",
                view: true,
                Step: "ضعي السميد الناعم والسميد الخشن والسكر والمحلب والزبدة في وعاء.\nاخلطي المكونات جيداً حتى تتجانس ثم غطي الوعاء واتركيه جانباً لـ8 ساعات على الأقل.\nقومي بإضافة الخميرة على مزيج السميد ثم اسكبي الماء تدريجياً وادعكي المكونات جيداً حتى تحصلي على عجينة متماسكة.\nقسمي العجينة إلى قسمين متساويين واتركيها ترتاح لبعض الوقت.\nاخلطي الجوز مع القرفة والقطر وفي وعاء آخر اخلطي الفستق الحلبي والقطر.\nخذي كمية من العجين واحشيها بالجوز أو الفستق الحلبي ثم شكليها بحسب رغبتك.\nأعيدي الكرة حتى انتهاء الكمية.\nصفي قطع المعمول في صواني واخبزيها في فرن محمى مسبقاً على حرارة متوسطة.",
                time: "2 h",
                video: "https://www.youtube.com/watch?v=0pya1bnNreM"
            },
            {
                categortType: 5,
                Image: require("../img/4536415th.jpeg"),
                name: "قطايف بالجوز",
                Elta7der: '5 min',
                Eltahy: "30 min",
                Elsouba: "25",
                components: "- للشيرة :\nسكر : كوب\nالماء : كوب\nماء الزهر : ملعقة صغيرة\nعصير الليمون : قليل\n- القطايف : نصف كيلو (عجينة)\n- الجوز : ثلاث أرباع الكوب (مفروم خشن)\n- سكر البودرة : ملعقة كبيرة\n- القرفة : ملعقة كبيرة (مطحونة)\n- سمن : ملعقة كبيرة",
                view: true,
                Step: "اخلطي الجوز والسكر والقرفة في طبق.\nاحشي حبات القطايف بالحشوة ورصيها في صينية للفرن.\nوزعي السمن على حبات القطايف وأدخليها للفرن على حرارة 180 درجة لمدة 20 دقيقة حتى تتحمر.\nلتحضير الشيرة: اخلطي السكر مع الماء في قدر على نار متوسطة وحركي حتى يذوب السكر ويبدأ بالغليان.\nأضيفي عصرة الليمون وحركي حتى تتمازج المكونات.\nارفعي الشيرة عن النار وأضيفي ماء الزهر.\nوزعي الشيرة على حبات القطايف وقدميها دافئة.",
                time: "35 min",
                video: "https://www.youtube.com/watch?v=tbTWQ2TRtCI"
            },
            {
                categortType: 4,
                Image: require("../img/460631a884f126b2d66155b0b20e3a72_w750_h500.jpg"),
                name: "كنافة بالقشطة",
                Elta7der: '10 min',
                Eltahy: "50 min",
                Elsouba: "30",
                components: "- عجينة كنافة : نصف كيلو (جاهزة)\n- سمن : ثلاث أرباع الكوب\n- حليب : 2 كوب (سائل)\n- النشاء : 2 ملعقة كبيرة\n- سكر : 2 ملعقة كبيرة\n- البيض : 1 حبة\n- ماء الورد : ملعقة كبيرة (أو ماء الزهر) ",
                view: true,
                Step: "لتحضير القشطة: في وعاء على النار، ضعي الحليب مع ماء الورد أو ماء الزهر، وأضيفي إليه السكر.\nسخني المزيج قليلاً ثمّ ضعي البيضة مع إستمرارية التحريك.\nأضيفي كميّة النشا بعد أن تذوبيها بالقليل من الماء، وتابعي التحريك.\nبعد أن يغلي المزيج أضيفي علبة القشطة، وحركي حتّى تذوب القشطة في المزيج.\nارفعي المزيج عن النار، وغطّي وجهه لكي لا يجف، وضعيه جانباً حتّى يبرد تماماً.\nإبدأي بتقطيع عجينة الكنافة بيدكِ إلى قطع صغيرة.\nفي وعاء عميق ضعي عجينة الكنافة، وأضيفي إليها السمن، ثم افركيها بيديكِ جيّداً حتى يتوزع السمن على العجينة بأكملها.\nإفردي نصف مقدار عجينة الكنافة على صينية الفرن، وقومي بالضغط عليها بكفّة يدكِ حتى تصبح بمستوى واحد.\nوزعي حشوة القشطة على وجه الطبقة التي فردتها في الصينيّة بشكل متساوي.\nأضيفي النصف الثاني من عجينة الكنافة، ووزعيه بشكل متساوي، واضغطي عليها بكف يدكِ.\nحمّي الفرن، ثم ضعي الكنافة في الفرن لخبزها حوالي 15 دقيقة حتى تصبح ذهبية اللون.\nأخرجيها من الفرن، وضيفي إليها القطر البارد تماماً، ثم زينيها بالفستق الحلبي، وقدميها.",
                time: "1 h",
                video: "https://www.youtube.com/watch?v=GbOL_oMyENg"
            },
            {
                categortType: 4,
                Image: require("../img/cf82378b48898b67305548b733e72ea7_w750_h500.jpeg"),
                name: "كنافة بالمهلبية",
                Elta7der: '10 min',
                Eltahy: "50 min",
                Elsouba: "25",
                components: "- عجينة الكنافة الشعر : 400 غراماً\n- سكر : 5 ملاعق كبيرة\n- الزبدة : 60 غراماً\n- الزبدة : 5 ملاعق كبيرة (للمهلبية)\n- دقيق : نصف كوب (للمهلبية)\n- حليب : 4 اكواب (سائل / للمهلبية)\n- كريمة : نصف كوب (سائلة للحلويات / للمهلبية)\n- حليب بودرة : 2 ملعقة كبيرة (للمهلبية)\n- سكر : نصف كوب (للمهلبية)",
                view: true,
                Step: "في قدر على النار نضع الزبدة والسكر وننتظر حتى تذوب الزبدة ثم نضع الكنافة ونستمر بالتقليب حتى يتغير لونها ويصبح أشقر ثم نضعها جانباً.\nفي قدر آخر على النار نضع الزبدة ونتركها حتى تذوب ثم نزود الدقيق ونحرك حتى تصبح عجينة ثم نضيف جميع كمية الحليب بالتدريج مع التحريك باستمرار.\nنضيف السكر والحليب البودرة والكريمة السائلة على خليط الحليب ونستمر بالتحريك حتى يسخن الخليط ويثخن.\nفي بايركس نضع طبقة أولى من الكنافة ونرصها جيداً ثم نضع كمية المهلبية ثم نضع على الوجه طبقة أخرى من الكنافة ونتركها جانباً حتى تبرد ثم ندخلها الثلاجة لمدة ٤ ساعات.\nتزين بالفستق الحلبي والحليب المكثف المحلى.",
                time: "1 h",
                video: "https://www.youtube.com/watch?v=IenYZRMfwzQ"
            },
            {
                categortType: 1,
                Image: require("../img/110cbf893a9f3a68f23dccb19d2dd6e8_w750_h500.jpg"),
                name: "السينابون",
                Elta7der: '10 min',
                Eltahy: "50 min",
                Elsouba: "25",
                components: "- طحين : 4 اكواب\n- حليب : نصف كوب (دافئ)\n- خميرة : 4 ملعقة صغيرة\n- سكر : ملعقة كبيرة\n- الزبدة : ربع كوب\n- البيض : 1 حبة\n- سكر : ربع كوب\n- ملح : ملعقة صغيرة",
                view: true,
                Step: "ضعي الخميرة على الحليب الدافئ وملعقة السكر في كوب، وقلبي جيداً.\nضعي كل المكونات الأخرى في وعاء كبير الحجم، وقلبي جيداً.\nأضيفي كوب الخميرة والحليب على مكونات عجينة السينابون، ثم اعجني العجينة جيداً حتى تصبح ناعمة الملمس.\nاتركي العجينة حتى تختمر، ثم شكليها واحشيها.",
                time: "1 h",
                video: "https://www.youtube.com/watch?v=uz1r7fhg9A8"
            },
            {
                categortType: 5,
                Image: require("../img/691d959bb2492c326a797797dc29831b_w750_h500.jpg"),
                name: "عجينة القطايف",
                Elta7der: '5 min',
                Eltahy: "30 min",
                Elsouba: "25",
                components: "- طحين : 2 كوب\n- السميد : نصف كوب\n- سكر : نصف كوب\n- الماء : 3 اكواب\n- بيكنج بودر : 3 ملاعق صغيرة\n- الفانيليا : ملعقة صغيرة\n- ملح : رشّة",
                view: true,
                Step: "في الخلاط الكهربائي، ضعي جميع المكونات ثم اخلطي حتى تتجانس مع بعضها البعض.\nاسكبي الخليط في إبريق الشاي.\nحضّري صينية بلا حواف وضعيها على النار.\nاسكبي مقدار من عجينة القطايف في الصينية لتشكلي دائرة، وانتظري لتأخذ لوناً ذهبياً من أسفل.\nعند الإستواء ضعيها جانباً لتبرد وغطيها حتى لا تجف ثم احشيها بالحشوة المفضلة واشوي القطايف في الفرن.",
                time: "35 min",
                video: "https://www.youtube.com/watch?v=0_iQzJK3dPs"
            },
            {
                categortType: 1,
                Image: require("../img/cfcc7fbc8b77933dda0a55659811efe3_w750_h500.jpg"),
                name: "البقلاوة بالقشطة",
                Elta7der: '10 min',
                Eltahy: "50 min",
                Elsouba: "30",
                components: "- عجينة البقلاوة : نصف كيلو (شرائح)\n- القشطة : نصف كيلو\n- الزبدة : كوب (طرية بحرارة الغرفة)\n- سيرب : كوب (أو عسل لتسقية الحلى)",
                view: true,
                Step: "قسّمي شرائح عجينة البقلاوة إلى نصفين وتأكدي من فصل الشرائح عن بعضها في كل قسم، حتى لا تلتصق مع بعضها البعض.\nادهني بالقليل من الزبدة الطرية ما بين كل شريحتين، وقطعيها إلى مستطيلات بأحجام متساوية.\nعلى طرف كل مستطيل ضعي ملعقة من القشطة بعيداً عن الأطراف، وقومي بلف العجينة وأغلقيها جيداً.\nفي صينية الفرن، ضعي ورقة زبدة ورصّي قطع عجينة البقلاوة وادهني الوجه بالزبدة جيداً حتى تتغطى تماماً.\nحمّي الفرن على درجة حرارة  180 مئوية، وأدخلي الصينية لمدة 25 دقيقة حتى تصبح ذهبية اللون.\nأخرجيها من الفرن وضعيها في طبق تقديم ثم اسكبي عليها سيرب ولا بد أن يكون بارد تماماً أو عسل، واتركيه حتى تتشربه أصابع البقلاوة بالقشطة، ثم صفيها من السيرب، ووزعيها في طبق تقديم.",
                time: "1 h",
                video: "https://www.youtube.com/watch?v=FIj3qPyLcmg"
            },
            {
                categortType: 1,
                Image: require("../img/baalawa-choco.jpg"),
                name: "البقلاوة بالشوكولاتة",
                Elta7der: '10 min',
                Eltahy: "50 min",
                Elsouba: "30",
                components: "- طحين : 1 كيلو\n- ملح : 25 غراماً\n- السمنة : 25 غراماً\n- الماء : 600 غراماً\n- الكاكاو : 50 غم\n- النشاء : 100 غراماً\n- كاجو : 1 كيلو (مفروم ناعم)\n- النشاء : 100 غراماً",
                view: true,
                Step: "1. يخلط الطحين مع الماء والملح بشكل جيد، ومن ثم يضاف إلى العجينة السمنة والكاكاو، وتخلط العجينة مرّة أخرى حتى تصبح متماسكة.\n2. تقطّع العجينة الى 13 قطعة، ونضع على كل قطعة القليل من النشاء (المذوّب بالماء).\n3. ترقّ كل عجينة على حدة على شكل رغيف من الخبز، وتوضع فوق بعضها (وبين كل طبقة من العجين نرشّ القليل من النشاء حتى لا تلتصق ببعضها) ويجب ألا ننسى حشو الطبقات بالكاجو المفروم.\n4. توضع العجينة في صينية كبيرة وتقطّع إلى قطع صغيرة ومتجانسة، ويوضع عليها السمنة وتدخل إلى الفرن على درجة حرارة 200 مئوية حتى يصبح لونها ذهبياً.\n5. عندما تخرج من الفرن، نرشّ عليها القطر وتقدّم عندما تبرد.",
                time: "1 h",
                video: "https://www.youtube.com/watch?v=yjGdMMBaZ1o"
            },
            {
                categortType: 1,
                Image: require("../img/5a18aa9160d897b50908c62216043e61_w750_h500.jpg"),
                name: "الجلي",
                Elta7der: '5 min',
                Eltahy: "25 min",
                Elsouba: "20",
                components: "- الجيلي : كيس (بأي نكهة مفضلة)\n- ماء ساخن : 2 كوب\n- الفواكة : حسب الرغبة (موز- فراولة - توت - كرز - كيوي)",
                view: true,
                Step: "اخلطي المسحوق مع الماء المغلي وصبيه فوق الفواكة.\nقومي بوضع القالب في الثلاجة الى أن يبرد بالكامل ويجمد الجلي.",
                time: "30 min",
                video: "https://www.youtube.com/watch?v=gS1z3NxSgcU"
            },
            {
                categortType: 3,
                Image: require("../img/346ab9e3701f79656efa95b2edb95ced_w750_h500.jpg"),
                name: "بسبوسة اللوز",
                Elta7der: '5 min',
                Eltahy: "35 min",
                Elsouba: "25",
                components: "- لتحضير القطر :\nالماء : كوب\nسكر : كوب\nعصير الليمون : نصف ملعقة صغيرة (حامض)\n- السميد : كوب\n- حليب مكثف محلى : نصف علبة (أو 200 غرام)\n- الزبدة : نصف كوب (مذوّبة)\n- الماء : نصف كوب\n- بيكنج بودر : ثلاثة أرباع الملعقة الصغيرة\n- لوز : نصف كوب (مقشر / للزينة)",
                view: true,
                Step: "اخفقي الزبدة، الحليب المكثّف المحلّى والبايكنغ باودر في وعاءٍ كبير.\nأضيفي السميد والماء واخفقي المكوّنات من جديد حتى تتماسك.\nادهني صينية فرن بالقليل من الزبدة ثمّ وزّعي العجينة السائلة فيها.\nقطّعي العجينة إلى مربّعات ورصّي حبّة لوز في وسط كل مربّع.\nاخبزي البسبوسة في فرنٍ محمّى لحوالي 35 دقيقة.\nتفقّدي نضج البسبوسة في الدقيقة الثلاثين.\nلتحضير الشيرة: ذوّبي السكر في الماء في قدرٍ على النار ثمّ اغلي المزيج لمدة 8 دقائق.\nارفعي القدر عن النار، أضيفي عصير الليمون الحامض، حرّكي المكوّنات ودعي القطر يبرد.\nاسكبي القطر البارد على البسبوسة ثمّ قدّميها عندما تتشرّبه.",
                time: "40 min",
                video: "https://www.youtube.com/watch?v=rBC2OphsOmE"
            },
            {
                categortType: 1,
                Image: require("../img/a2363dc4f713e95ef97edbc437d4082b_w750_h500.jpg"),
                name: "أم علي بالجلاش",
                Elta7der: '10 min',
                Eltahy: "50 min",
                Elsouba: "50",
                components: "- عجينة الجلاش الجاهزة : 250 غراماً\n- الزبدة : 2 ملعقة كبيرة\n- حليب : لتر ونصف (سائل)\n- سكر : نصف كوب\n- كريمة : علبة (أو قشدة)\n- مكسرات : ربع كوب (يفضل استخدام البندق المجروش)",
                view: true,
                Step: "قطّعي عجينة الفيلو أو الجلاش إلى قطع صغيرة.\nذوّبي الزبدة في صينية فرن ثمّ ضعي فيها قطع العجين وأدخليها إلى فرن حامٍ حتى تجفّ وتتحمرّ قليلاً.\nفي قدر، إغلي الحليب مع السكر وحرّكي حتى يذوب السكر.\nاسكبي الكريمة أو القشدة وحرّكي حتى الغليان.\nضعي قطع الجلاش في صينية بايركس واسكبي فوقها مزيج الحليب.\nرشّي المكسرات بحسب الرغبة على وجه الطبق وأدخلي الصينية إلى الفرن لمدّة 20 دقيقة مع مراقبتها حتى لا يفور الحليب.\nقدّمي طبق أم علي بالجلاش ساخناً أو بارداً مع إضافة القليل من الحليب بحسب الرغبة عند التقديم.",
                time: "1 h",
                video: "https://www.youtube.com/watch?v=Ankb7iqTI-0"
            },
            {
                categortType: 1,
                Image: require("../img/723e9ba33c55e336b0ba3e2a75d8d038_w750_h500.jpg"),
                name: "تشيز كيك بالكراميل",
                Elta7der: '10 min',
                Eltahy: "50 min",
                Elsouba: "25",
                components: "- جبن كريمي : 4 علب\n- سكر : كوب\n- حليب بودرة : كوب\n- جيلاتين : 2 ملعقة صغيرة\n- بسكويت الشاي السادة : حسب الحاجة\n- الزبدة : ملعقة كبيرة\n- كريم كراميل : حسب الحاجة (بارد / للتزيين)",
                view: true,
                Step: "في الخلاط الكهربائي، اطحني البسكويت ثمّ اخلطيه مع الزبدة.\nفي قعر صينية تشيز كيك متحرّكة القاعدة، مدّي طبقة البسكويت ورصّيها جيداً.\nأدخلي الصينية إلى الثلاجة حتى تجمد الطبقة قليلاً.\nفي الخلاط الكهربائي، ضعي جبن الكريم والسكر والحليب والجيلاتين.\nاخلطي المكونات لمدّة ربع ساعة.\nضعي مزيج الكريم فوق البسكويت.\nأعيدي الصينية إلى الثلاجة لبعض الوقت.\nاسكبي الكريم كراميل البارد فوق التشيز كيك وأعيدي الصينية إلى الثلاجة لساعة على الأقل ثمّ قدّمي التشيز كيك بارداً",
                time: "1 h",
                video: "https://www.youtube.com/watch?v=LQybdyLt9a8"
            },
            {
                categortType: 1,
                Image: require("../img/2f7974a90e09c86fc80a7deec9c60408_w750_h500.jpg"),
                name: "كيك البرتقال والمكسرات",
                Elta7der: '10 min',
                Eltahy: "50 min",
                Elsouba: "30",
                components: "- لتحضير الصلصة :\nعصير البرتقال : كوب\nالماء : كوب\nالنشاء : 2 ملعقة كبيرة\nسكر : 4 ملاعق كبيرة\nالجوز : ربع كوب\nجوز الهند : ربع كوب\n- البيض : 5 حبات\n- سكر : كوب\n- الزيت : نصف كوب\n- عصير البرتقال : نصف كوب\n- حليب : نصف كوب (سائل)\n- قشرة البرتقال : 2 ملعقة كبيرة (مبشور)\n- الفانيليا : ملعقة صغيرة\n- بيكنج بودر : 2 ملعقة صغيرة\n- دقيق : كوبان ونصف (منخول)\n- ملح : رشّة",
                view: true,
                Step: "حمّي الفرن على حرارة 180 درجة مئوية.\nفي الخلاط الكهربائي، اخفقي البيض جيداً لمدّة 5 دقائق مع رشّة ملح والفانيليا حتى ينفش.\nاسكبي الزيت تدريجياً ثمّ عصير البرتقال والحليب واخققي جيداً.\nأضيفي الدقيق المنخول والبايكنغ باودر واخلطي حتى تتجانس المكونات.\nجهّزي صينية فرن وادهنيها بالزبدة ورشّيها بالدقيق.\nاسكبي خليط الكيك في الصينية وأدخليها إلى الفرن حوالي 45 دقيقة أو حتى ينضج الكيك.\nلتحضير الصلصة: في قدر، ضعي الماء وعصير البرتقال والنشاء والسكر على نار هادئة.\nاخلطي حتى تتجانس المكونات وتكثف الصلصة.\nاسكبي الصلصة على الكيكة.\nزيّني بالجوز وجوز الهند وشرائح البرتقال.",
                time: "1 h",
                video: "https://www.youtube.com/watch?v=deU9YNjljOo"
            },
            {
                categortType: 5,
                Image: require("../img/a6364eeb31782120e481f574dcdfb6f1_w750_h500.jpg"),
                name: "قطايف مقلي بالجبن",
                Elta7der: '10 min',
                Eltahy: "50 min",
                Elsouba: "50",
                components: "- لتحضير العجينة :\nدقيق : 3 اكواب\nخميرة : 2 ملعقة صغيرة\nبيكنج بودر : ملعقة كبيرة\nماء الزهر : كوب\nالماء : كوبان ونصف\n- لتحضير القطر :\nسكر : 4 اكواب\nالماء : 2 كوب\nعصير الليمون : 2 ملعقة كبيرة\nماء الزهر : ربع كوب\n- جبن عكاوي : 500 غراماً (منقوع ومقطع إلى مكعبات صغيرة)\n- الزيت : حسب الحاجة (للقلي)",
                view: true,
                Step: "لتحضير العجينة: أخلطي الخميرة في كوب من الماء واتركيه جانباً لبضع دقائق.\nضعي الدقيق والبايكنغ باودر ومزيج الخميرة وماء الزهر وما تبقى من كمية الماء في وعاء كبير ثمّ أخلطي بواسطة المضرب الكهربائي حتى تتجانس المكوّنات.\nأتركي عجينة القطايف جانباً لمدة ساعة على الأقل حتى ترتاح.\nإدهني مقلاة متوسطة الحجم بالقليل من الزيت وضعيها على نار متوسطة.\nأسكبي مقدار نصف كوب من العجينة في المقلاة واتركيها حتى يحمرّ قعرها ثمّ ضعيها في وعاء حتى تبرد.\nأعيدي الكرّة حتى ينتهي المزيج.\nأتركي قطع العجينة جانباً حتى تبرد.\nضعي حوالي ملعقة صغيرة من الجبن في كل قطعة عجينة ثمّ أغلقيها جيداً للحصول على شكل هلال.\nحمّي الزيت في مقلاة صغيرة على نار متوسطة وضعي قطع القطايف لمدة 5 دقائق تقريباً حتى تحمر من الجانبين.\nارفعي القدر عن النار وصفّي القطايف على ورقة مطبخ لإزالة كمية الزيت الزائدة.\n- لتحضير القطر: في قدر كبير، سخني الماء مع السكر على نار متوسطة حتى الغليان ثمّ أضيفي عصير الليمون الحامض وماء الزهر مع التحريك بواسطة ملعقة خشبية حتى تتجانس المكوّنات ويثخن المزيج.\nارفعي القدر عن النار واتركي القطر جانباً ليبرد ثمّ أسكبيه في وعاء صغير.\nضعي قطع القطايف في طبق التقديم وقدّميها إلى جانب القطر",
                time: "1 h",
                video: "https://www.youtube.com/watch?v=RbPa88cB8uc"
            },
            {
                categortType: 1,
                Image: require("../img/fccth.jpeg"),
                name: "بقلاوة بالجوز",
                Elta7der: '10 min',
                Eltahy: "50 min",
                Elsouba: "50",
                components: "- عجينة الكلاج : عبوة\n- الجوز : كوب (مطحون)\n- سمن : نصف كوب (مذاب)\n- قطر : كوب",
                view: true,
                Step: "إفردي عجينة الكلاج الجاهزة على السطح المراد العمل عليه.\nإطوي طرف العجينة على عود خشبي، حتى يُسهّل عليكِ عملية لّف العجينة.\nاحشي طرف العجينة بالجوز.\nلُفي العجينة على الحشوة، ثم اسحبي العود الخشبي من العجينة وضعيها جانباً.\nكرري الخطوة السابقة حتى نفاذ الكمية.\nادهني صينية الفرن بالسمن المذاب.\nضعي حبات الكلاج في الصينية.\nادهني وجه الكلاج بالسمن المذاب، ثم قطعيها.\nأدخلي الصينية إلى الفرن لمدة 10 دقائق.\nصُبي القطر بحسب الرغبة.",
                time: "1 h",
                video: "https://www.youtube.com/watch?v=AT63AheqIjg"
            },
            {
                categortType: 1,
                Image: require("../img/009c0351d12fbec8a9d304db2a97ee47_w750_h500.jpg"),
                name: "بلح الشام",
                Elta7der: '5 min',
                Eltahy: "25 min",
                Elsouba: "30",
                components: "- لتحضير العجينة :\nدقيق : كوب وثلثا الكوب\nالبيض : 5 حبات\nالماء : كوب وثلث\nالزيت النباتي : ثلث كوب\n- لتحضير القطر :\nالماء : كوب ونصف\nسكر : 3 اكواب\nعصير الليمون : 2 ملعقة صغيرة (حامض)\nماء الزهر : ملعقة كبيرة\n- الزيت النباتي : 4 اكواب (للقلي)",
                view: true,
                Step: "لتحضير القطر: ضعي الماء والسكر في قدر على النار واتركيهم حتى الغليان، ثمّ خففي النار، أضيفي عصير الليمون الحامض وماء الزهر واتركيهم لدقيقتين إضافيتين، ثم ارفعي القطر عن النار ودعيه ليبرد.\nلتحضير العجينة: ضعي الماء في قدر مع الزيت النباتي واتركيهما حتى الغليان.\nأضيفي الدقيق واعجني المكونات بملعقة خشبية حتى تتماسك.\nارفعي القدر عن النار واتركي العجينة حتى تبرد.\nأضيفي البيض، واحدة تلو الأخرى، مع التقليب.\nسخّني الزيت في مقلاة عميقة.\nضعي العجينة في كيس حلويات ذي رأس عريض وشكّليها على هيئة أصابع طويلة، وحمّريها في الزيت الساخن ثمّ ارفعيها عن النار.\nضعي بلح الشام في القطر البارد، ثمّ ارفعيه منه وقدّميه.",
                time: "30 min",
                video: "https://www.youtube.com/watch?v=wDuGXAZa4rM"
            },
            {
                categortType: 1,
                Image: require("../img/cfbde0e735352d98aeed8f9209103ba9_w750_h500.jpg"),
                name: "كريم كراميل",
                Elta7der: '10 min',
                Eltahy: "50 min",
                Elsouba: "30",
                components: "- البيض : 7 حبات\n- الخل الأبيض : ملعقة صغيرة\n- الفانيليا : 3 ملاعق صغيرة\n- حليب : كوبان ونصف (سائل)\n- سكر : كوب (أبيض)\n- الماء : 3 اكواب\n- سكر : نصف كوب (أبيض / لقعر الصينية)\n- أناناس : حسب الرغبة (معلب / للتزيين)",
                view: true,
                Step: "حمّي الفرن على حرارة 180 درجة مئوية.\nفي الخلاط الكهربائي، اخفقي البيض البيضة تلو الأخرى إلى أن يصبح قوامها كالكريمة.\nأضيفي الفانيليا والخلّ الأبيض واخلطي.\nاسكبي الحليب تدريجياً ثمّ أضيفي السكر واخفقي جيداً، واسكبي الماء وتابعي الخفق لحوالي دقيقة إلى أن تتجانس المكوّنات.\nصفّي المزيج في مصفاة كي لا يبقى فيه أيّ كتل.\nحمّي السكر المخصص لقعر الصينية في مقلاة على النار إلى أن يتخذّ لون الكراميل الذهبيّ.\nاسكبي الكراميل في قعر صينية فرن ووزّعيه من خلال تحريك الصينية يميناً ويساراً بيديك.\nانتظري حوالي 3 دقائق إلى أن يجفّ الكراميل ثمّ اسكبي المزيج في الصينية.\nغلّفي الصينية بإحكام بورق قصدير وضعيها على حمام مائي ثمّ أدخليها إلى الفرن لحوالي الساعة إلى أن تنضج.\nأخرجي الصينية من الفرن واتركيها لتبرد قليلاً ثمّ ضعيها في الثلاجة من 3 إلى 4 ساعات.\nعند التقديم، اقلبي الكريم كراميل في طبق وزيّني بقطع الأناناس.",
                time: "1 h",
                video: "https://www.youtube.com/watch?v=6QVmtVgYluU"
            },
            {
                categortType: 4,
                Image: require("../img/6ee204c5e7eb449d46886057bfd8fdaa_w750_h500.jpg"),
                name: "كنافة بالمكسرات",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "50",
                components: "- لتحضير الكنافة :\nعجينة كنافة : 500 غراماً\nالزبدة : ربع كوب (أو سمن)\nسكر البودرة : ملعقة صغيرة\n- لتحضير الحشوة :\nمكسرات : حسب الرغبة (لوز، بندق، فول سوداني أو أي نوع من المكسرات)\nالقرفة : ملعقة صغيرة (مطحونة)\nسكر : ملعقة صغيرة\nجوز الهند : ملعقة كبيرة\nزبيب : حسب الرغبة\n- لتحضير الشيرة :\nسكر : كوبان ونصف\nالماء : 3 اكواب\nالزبدة : ملعقة صغيرة (أو سمن)\nالفانيليا : رشّة",
                view: true,
                Step: "لتحضير الكنافة: حمّي الفرن على حرارة 200 درجة مئوية.\nفي وعاء، افركي الكنافة جيداً.\nأضيفي إليها الزبدة (أو السمن) المذوّبة والسكر ووزعيها جيداً.\nلتحضير الحشوة: في وعاء آخر، اخلطي جميع المكسرات معاً.\nأضيفي فوقها السكر والقرفة وجوز الهند والزبيب.\nادهني صينية بالزيت ثم ضعي فيها نصف كمية الكنافة.\nضعي فوق الكنافة مزيج المكسرات ثمّ طبقة من كمية الكنافة المتبقية.\nأدخلي الصينية إلى الفرن إلى أن يصبح وجه الكنافة ذهبيّ اللوّن.\nلتحضير الشيرة (القطر): في قدر، ضعي السكر والماء والزبدة (أو السمن) والفانيليا.\nاتركي المزيج على النار إلى أن يغلي.\nضعي الشيرة جانباً حتى تبرد.\nأخرجي صينية الكنافة فوراً من الفرن وهي لا تزال ساخنة، واسكبي عليها الشيرة وقدّميها.",
                time: "40 min",
                video: "https://www.youtube.com/watch?v=wpjyQyf-Mh8"
            },
            {
                categortType: 5,
                Image: require("../img/flkth.jpeg"),
                name: "القطايف بالمكسرات",
                Elta7der: '5 min',
                Eltahy: "25 min",
                Elsouba: "25",
                components: "- للقطر :\nالماء : كوب\nسكر : 2 كوب\nعصير الليمون : ملعقة كبيرة\n- الجوز : نصف كيلو (مفروم)\n- زبيب : ربع كيلو\n- سكر : ملعقة كبيرة\n- القرفة : ملعقة صغيرة (مطحونة)\n- الزبدة : ملعقة كبيرة\n- القطايف : حسب الحاجة\n- الزيت : غزير (للقلي)",
                view: true,
                Step: "اخلطي الجوز مع الزبيب في طبق، وأضيفي السكر، والقرفة المطحونة.\nأضيفي الزبدة، وقلبي المكونات جيداً حتى تتجانس.\nاحشي القطايف بالحشوة.\nلتحضير القطر: في قدر صغيرة على النار صبي الماء، ثم أضيفي السكر، واتركي المكونات لتغلي وعند الغليان أضيفي عصير الليمون.\nسخني زيت غزير في مقلاة على النار، واقلي حبات القطايف حتى تتحمر، وانقليها فوراً للقطر البارد.\nقدمي القطايف ساخناً أو دافئاً",
                time: "30 min",
                video: "https://www.youtube.com/watch?v=sEzUAeiuFZ0"
            },
            {
                categortType: 5,
                Image: require("../img/dd850b85666ae50c645ad350edae99b7_w750_h500.jpg"),
                name: "قطايف بالفستق الحلبي",
                Elta7der: '10 min',
                Eltahy: "25 min",
                Elsouba: "40",
                components: "- القطايف : 500 غراماً\n- فستق حلبي : نصف كوب (مفروم ناعم)\n- ماء الزهر : ملعقة كبيرة\n- سكر البودرة : ملعقة كبيرة\n- شيرة : 2 كوب\n- السمنة : 2 ملعقة كبيرة (مذابة)\n- مستكة : ربع ملعقة صغيرة (مطحونة)",
                view: true,
                Step: "اخلطي الفستق الحلبي مع المستكة والسكر البودرة وماء الزهر.\nاحشي حبات القطايف بكمية وافرة من المزيج.\nادهني صينية فرن بالقليل من السمن.\nادهني القطايف المحشية بالسمن المذاب بواسطة فرشاة.\nأدخلي الصينية للفرن على حرارة 180 درجة لمدة 25 دقيقة حتى تصبح القطايف ذهبية اللون ومقرمشة.\nضعي القطايف الساخنة في القطر البارد وقدميها ساخنة.",
                time: "1 h",
                video: "https://www.youtube.com/watch?v=1lu_tCNbzsw"
            },
            {
                categortType: 1,
                Image: require("../img/70f1f36a0c9db5caa679addf430db51a_w750_h500.jpg"),
                name: "سلطة فواكة بعصير البرتقال",
                Elta7der: '5 min',
                Eltahy: "25 min",
                Elsouba: "25",
                components: "- الفراولة : نصف كوب (مقطعة أنصاف)\n- التفاح : 1 حبة (كبير الحجم / مقشرة ومفرومة مكعبات)\n- الموز : 1 حبة (مقطع دوائر)\n- كيوي : 1 حبة (مفروم)\n- عصير البرتقال : ربع كوب\n- عصير الليمون : ملعقة كبيرة",
                view: true,
                Step: "اخلطي الفراولة والتفاح والموز والكيوي في طبق.\nوزعي عصير البرتقال وعصير الليمون فوق الفواكة واخلطي المزيج حتى يتجانس.\nاخفظيها في الثلاجة لمدة ساعة قبل التقديم وقدميها باردة.",
                time: "30 min",
                video: "https://www.youtube.com/watch?v=JRimI72VAek"
            },
            {
                categortType: 1,
                Image: require("../img/kollaj.jpg"),
                name: "الكلاج بالقشطة",
                Elta7der: '5 min',
                Eltahy: "25 min",
                Elsouba: "25",
                components: "- عجينة الكلاج : 12 حبة\n- القشطة : 1 كيلو (طازجة)\n- حليب : نصف لتر (طازج)\n- فستق حلبي : حسب الرغبة (للزينة)\n- سكر : كوبان (القطر)\n- الماء : كوب (القطر)\n- ماء الزهر : ملعقة (القطر)\n- ماء الورد : ملعقة (القطر)\n- عصير الليمون : ربع ملعقة (القطر)",
                view: true,
                Step: "1. تفرد عجينة الكلاج على طاولة التحضير وتضاف القشطه الطازجة  حوالي 80 غرام في وسط العجينة  وتغلق العجينة من اليمين واليسار وتلف بشكل مستطيل. وتلف باقي الكمية بنفس الطريقة.\n2. في وعاء يسكب الحليب الطازج ثم تغمس قطع الكلاج بالحليب لمدة نصف دقيقة وتقلى بزيت حامي حتى تحمر وتأخذ لونا ذهبيا. ترفع قطع الكلاج المقلية من النار وتضاف إلى القطر البارد وتترك لمدة عشر دقائق.\n3. تصفى قليلا من القطر وتزيين بالفستق وتقدم ساخنة.\n4. القطر: يوضع السكر والماء على النار ويترك ليغلي قليلا يضاف عصير الحامض وماء الزهر والورد ويترك على حده ليبرد.",
                time: "30 min",
                video: "https://www.youtube.com/watch?v=9WRZoRISal4"
            },
            {
                categortType: 2,
                Image: require("../img/dddfgghth.jpeg"),
                name: "المهلبية بالمكسرات",
                Elta7der: '10 min',
                Eltahy: "50 min",
                Elsouba: "25",
                components: "- القشطة : 600 ملليلتر\n- حليب : كوب\n- الشوكولاتة البيضاء : 180 غم\n- السكر الناعم : ربع كوب\n- جيلاتين : 6 ورقات (أو 3 ملعقة صغيرة من الجيلاتين)\n- ماء الورد : ملعقة كبيرة (أو الورد)",
                view: true,
                Step: "1. ضعي الحليب والقشطة في قدر على النار وأضيفي الورد وحبات الهيل.\n2. ثم أضيفي السكر، وحركي حتى الغليان.\n3. ثم أضيفي الشوكولاتة البيضاء والجيلاتين.\n4. صفي المزيج بالمصفاة.\n5. وصبي خليط المهلبية بأطباق التقديم.",
                time: "1 h",
                video: "https://www.youtube.com/watch?v=iMclG8Jt36E"
            },
            {
                categortType: 4,
                Image: require("../img/884972e5a924823e4c6fa80c6b6ddf3b_w750_h500.jpg"),
                name: "كنافة بالمانجو",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "50",
                components: "- الكنافة : 500 غراماً\n- شيرة : كوب\n- سمن : 500 غراماً (مذوب)\n- عصير المانغو : 3 اكواب\n- كريمة : 3 اكواب (مخفوقة)\n- مانغو : 4 حبات (مقشرة ومقطعة مكعبات)",
                view: true,
                Step: "1. اخلطي عجينة الكنافة مع السمن المذوب جيداً ثم افردي الكنافة في الصينية وأدخليها الفرن على حرارة 180 درجة لمدة 20 دقيقة حتى تتحمص.\n2. ازيلي الكنافة من الفرن وقطعيها باليد حتى تصبح مفتتة.\n3. ضعي في طبق زجاجي عميق للتقديم طبقة من الكنافة المفتتة.\n4. أضيفي عصير المانجو وكمية من الكريمة المخفوقة وكمية من المانجو.\n5. ضعي فوقها طبقة من الكنافة وأعيدي الكرة لعمل طبقتين أو ثلاث حسب الرغبة.\n6. أدخلي الطبق للثلاجة لحين التقديم.",
                time: "40 min",
                video: "https://www.youtube.com/watch?v=D-UjCw-tmCs"
            },
            {
                categortType: 1,
                Image: require("../img/9efbabc53922b47f077743df46a16b30_w750_h500.jpg"),
                name: "الغريبة",
                Elta7der: '5 min',
                Eltahy: "25 min",
                Elsouba: "20",
                components: "- الزبدة : كوبان\n- السكر الناعم : كوب\n- دقيق : 4 اكواب\n- فستق : كوب (مقطع أنصاف)\n- بياض البيض : 1 حبة\n- الفانيليا : ملعقة صغيرة\n- ملح : ربع ملعقة صغيرة",
                view: true,
                Step: "1. في وعاء، ضعي الزبدة وقلبيه جيداً ثم أضيفي السكّر، مع الاستمرار في التقليب.\n2. أضيفي الدقيق بالتّدريج مع الاستمرار في التقليب، ليصبح لديك خليط كثيف.\n3. أضيفي زلال البيض، ويمكن خلط المُكوّنات بالعجانة الكهربائية لتضمني امتزاجها جيداً.\n4. ضعي الفستق المقطّع إلى أنصاف في صحن منفصل.\n5. شكّلي الخليط حسب رغبتك بالشكل الذي تحبين، كشكل كرة صغيرة، أو شكل حلزوني أو غيره من الأشكال بحسب الرغبة.\n6. ضعي حبّة من الفستق أو اللّوز في مُنتصف الخليط للزّينة، وكرّري الخطوات على كامل عجينة الغريبة إلى حين الانتهاء من كامل العجينة.\n7. سخّني الفرن لدقائق على درجة 180 قبل وضع الصينيّة.\n8. ضعي الغريبة في صينية وضعيها في الفرن لمدّة 15 دقيقة، واجعلي حرارته متوسّطة، وحاولي ألّا يتغيّر لونها. ",
                time: "30 min",
                video: "https://www.youtube.com/watch?v=RYEQOoxJtCY"
            },
            {
                categortType: 1,
                Image: require("../img/c7a0a60c91ebac9bd353c0ea4df20e58_w750_h500.jpg"),
                name: "بان كيك بالشوكولاتة",
                Elta7der: '5 min',
                Eltahy: "30 min",
                Elsouba: "20",
                components: "- حليب : كوب\n- البيض : 1 حبة\n- الزبدة : 2 ملعقة كبيرة (مذوبة)\n- طحين : كوب\n- بودرة الكاكاو : نصف كوب\n- سكر : ربع كوب\n- بيكنج صودا : نصف ملعقة صغيرة\n- ملح : نصف ملعقة صغيرة\n- سكر البودرة : 3 ملاعق كبيرة",
                view: true,
                Step: "1. اخلطي الحليب والبيض والزبدة المذوبة في عاء حتى تمتزج المكونات جيداً.\n2. اخلطي الطحين والكاكاو البودرة والسكر والبيكنج صودا والملح في وعاء آخر.\n3. أضيفي خليط الحليب والبيض لخليط الطحين والكاكاو وحركي حتى تمتزج المكونات.\n4. سخني مقلاة على نار متوسطة.\n5. ضعي كمية من خليط البان كيك وحمريها لمدة دقيقتين على كل وجه.\n6. زيني البان كيك بالسكر البودرة أو الفواكة أو المربى حسب الرغبة.",
                time: "35 min",
                video: "https://www.youtube.com/watch?v=xOYp_CWgk7E"
            },
            {
                categortType: 1,
                Image: require("../img/kas.jpg"),
                name: "كاسترد بالفراولة",
                Elta7der: '5 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: "- بودرة الكاسترد الجاهزة : 6 ملاعق كبيرة\n- حليب : 7 اكواب (سائل)\n- بسكويت الشاي السادة : عبوة (مكسّر)\n- الفراولة : كوب (حبات)\n- سكر : نصف كوب\n- جوز الهند : 3 ملاعق كبيرة",
                view: true,
                Step: "في قدر على النار، ذوّبي الكاسترد مع الحليب والسكر حتى يغلي ويثخن قوامه.\nأضيفي البسكويت على الكاسترد، ثم أضيفي الفراولة، وجوز الهند.\nاسكبي الكاسترد في أكواب التقديم، وزينيه بالفراولة بحسب الرغبة، واتركيه حتى يبرد بالثلاجة، وقدميه",
                time: "35 min",
                video: "https://www.youtube.com/watch?v=5P2pjh4a-9Y"
            },
            {
                categortType: 2,
                Image: require("../img/82b4a96f27f086db1d3ac4ee4d097872_w750_h500.jpg"),
                name: "مهلبية بالكاسترد",
                Elta7der: '5 min',
                Eltahy: "50 min",
                Elsouba: "35",
                components: "- حليب : 4 اكواب\n- البيض : 6 حبات\n- صفار البيض : 2 حبة\n- سكر : نصف كوب\n- الفانيليا : نصف ملعقة صغيرة",
                view: true,
                Step: "1. قومي بتشغيل الفرن على درجة حرارة 200.\n2. سخني الحليب في وعاء على نار متوسطة الحرارة مدّة خمس دقائق دون أن يغلي.\n3. أبعدي الحليب عن النار، ثمّ اتركيه جانباً حتى يبرد.\n4. أضيفي الفانيلا  إلى الحليب وامزجيه جيداً.\n5. ضعي كلاً من: البيض وصفار البيض في وعاء وامزجهما جيداً بواسطة الشوكة، يجب عدم استخدام الخفاقة الكهربائية.\n6. أضيفي الحليب إلى خليط البيض تدريجياً مع استمرار الخفق بواسطة الشوكة.\n7. صفي خليط الكاسترد من خلال مصفاة، واسكبيه في صينية فرن بعمق خمس سنتيمترات على الأقل.\n8. جهزي صينية فرن بحجم أكبر، وضعي منشفة وسطها، وثبتي صينية خليط الكاسترد فوق المنشفة، ثمّ اسكبي الماء الساخن في الصينية الكبيرة حتى يصل لمنتصفها.\n9. اخفضي درجة حرارة الفرن إلى 160 مئوية، وضعي الصينية في الفرن مدة 40 - 45 دقيقة.\n10. أخرجي الصينية من الفرن واتركي الكاسترد حتى يبرد، ثمّ احفظيه في البراد مدّة أربع ساعات على الأقل قبل التقديم حتى يبرد تماماً.",
                time: "55 min",
                video: "https://www.youtube.com/watch?v=zsBZs7SXNPE"
            },

            {
                categortType: 3,
                Image: require("../img/602bfa39ff9bc5bb11b5f4d0f41c5c54_w750_h500.jpg"),
                name: "بسبوسة بالهيل",
                Elta7der: '5 min',
                Eltahy: "50 min",
                Elsouba: "35",
                components: "- سميد خشن : 2 كوب\n- طحين : كوب\n- لبن زبادي : 2 كوب\n- بيكنج بودر : 2 ملعقة صغيرة\n- الزيت النباتي : ربع كوب\n- ملح : ربع ملعقة صغيرة\n- هيل : ملعقة صغيرة (مطحون)\n- البيض : 1 حبة\n- سكر : نصف كوب\n- قطر : 2 كوب (شيرة)\n- الفانيليا : ملعقة صغيرة",
                view: true,
                Step: "اخلطي البيضة مع الفانيلا والسكر والزيت حتى يصبح المزيج ناعماً ومتجانساً.\nأضيفي اللبن الزبادي.\nأضيفي الطحين والسميد والملح والبيكنج باودر والهيل المطحون وقلبي المزيج جيداً حتى تتجانس المكونات.\nادهني صينية الفرن بالقليل من الطحينة.\nصبي مزيج البسبوسة في الصينية وأدخليها الفرن على حرارة 170 درجة لمدة 20 دقيقة حتى تنضج وتتحمر.\nأخرجي الصينية من الفرن ووزعي القطر البارد عليها واتركيها لتبرد لمدة 10 – 15 دقيقة.\nقطعيها وقدميها دافئة أو باردة حسب الرغبة.",
                time: "55 min",
                video: "https://www.youtube.com/watch?v=NavbHtGCyaE"
            },


            {
                categortType: 3,
                Image: require("../img/download(5).jpg"),
                name: "بسبوسه جوز الهند",
                Elta7der: '5 min',
                Eltahy: "30 min",
                Elsouba: "20",
                components: "كيس بسبوس\nهكاجو للزينه\nشربات كوب ونص سكر وك ماء وعصره ليمون وهيل وقرفه\nالكيس جاهز فيه بيكنيج بودره وفانيليا\nجوز هند حسب الكميه\nزيت لدهن الصينيه\nعلبه زبادي",
                view: true,
                Step: "كيس بسبوسه\nضيفت معلقتين دقيق وعلبه زبادي ومعلقتين سكر\nوقلبت الخليط جيدا ودهنت الصينيه زيت وضعت الخليط في الصينيه ودخلتها الفرن حوالي نص ساعه حسب فر نكجهزت الشربات كوب ونص سكر وكوب ماء وعصره ليمون وعود قرفه وهيل دى اختيارى\nبعد ما طلعتها من الفرن رشيت عليها الشربات",
                time: "35 min",
                video: "https://www.youtube.com/watch?v=LF7lxXhWlGk"
            },
            {
                categortType: 3,
                Image: require("../img/download(6).jpg"),
                name: "بسبوسة بالكرميل",
                Elta7der: '5 min',
                Eltahy: "30 min",
                Elsouba: "20",
                components: "2 كوب و نص سميد بسبوس\nةم ك ممسوحه بيكنج بودر\nرشه ملح\nكوب لبن\nكوب الا وبع سمنه ع زبده\nكوب سكر\nشربات ساخن\nم ك طحينه\nمكسرات للتزين",
                view: true,
                Step: "ف الاول هانحط السكر لحد ما يدوب كلو وياخد لونو الدهبي و بعدها ننزل بالزبده ع السمنه السايحه و نقلبو كويس ننزل بكوبيه اللبن و نقلب ع نار هاديه لمده 7 دقايق يفك كلو مع بعضو و نطفي النار\nدهنت الصنيه طحينه\nف بوله هانحط السميد مع البيكنج بودر و رشه ملح بسيطه و ننزل بخليط الكرميل و نقلب لحد ما البسبوسه تتشرب كل الخليط السايل ندهن الصنيه بالطحينه و نبدا نرص البسوسبه انا هنا بعد ما خلصت بليت ايدي شويه لبن وًمسحت وش الصنيه عشان تتساوي و كمان اللبن بيخليها تاخد درجه لون حلوا اكتييير. حطيت المكسراات و قطعتها و دخلتها الفرن لحد ما استوت\nاول ما طلعتها سقيتها بالسيرب الساخن و غطيتها و خليتها لمده ساعتين و بعدها رفعت عنها الغطا و بالهنا و الشفا",
                time: "35 min",
                video: "https://www.youtube.com/watch?v=EAbiF2JRSL8"
            },

        ]
        )

    const [Category, SetCategory] = useState(
        [
            {
                id: 1,
                name: "حلويات شرقية",
                img: require("../img/shar.png"),
                choose: false,
                // contant: "",
                view: false,
            },
            {
                id: 2,
                name: "مهلبية",
                img: require("../img/cat2.png"),
                choose: false,
                // contant: "pizzzzzaaaa",
                view: false,
            },
            {
                id: 3,
                name: "بسبوسة",
                img: require("../img/basbosapreview.png"),
                choose: false,
                // contant: "pizzzzzaaaa",
                view: false,
            },
            {
                id: 4,
                name: "كنافة",
                img: require("../img/konafapreview.png"),
                choose: false,
                // contant: "pizzzzzaaaa",
                view: false,
            },
            {
                id: 5,
                name: "قطايف",
                img: require("../img/kataefpreview.png"),
                choose: false,
                // contant: "pizzzzzaaaa",
                view: false,
            },

        ]

    )

    const [IconSearch, setIconSearch] = useState(true)
    const [search, setsearch] = useState("")

    // const [showView, SetshowView] = useState(true)
    // const [Index, SetIndex] = useState(null)

    const ref = React.useRef(null)
    const [animationDisplay, setanimationDisplay] = useState(false)

    const makesearch = (searchText) => {
        let list = Food
        let count = 0

        for (let i = 0; i < list.length; i++) {
            if (((list[i].name).toUpperCase()).includes(searchText.toUpperCase())) {
                list[i].view = true
            }
            else {
                list[i].view = false
                count++

            }
        }
        if (count == list.length) {
            setanimationDisplay(true)
        }

        // 
        if (count != list.length) {
            setanimationDisplay(false)

        }
        setFood(list)
        count = 0
    }


    const [CategoryReturn, setCategoryReturn] = useState([])
    const [showView, setshowView] = useState(true)
    const [indexName, setindexName] = useState()

    const chooseCategory = (index) => {
        let list = Category
        let arr = Food
        if (list[index].choose == true) {
            setshowView(true)
            list[index].choose = false

        }
        else {

            for (let i = 0; i < list.length; i++) {
                list[i].choose = false
            }
            list[index].choose = true
            setshowView(false)
            var ret = []
            for (let i = 0; i < arr.length; i++) {
                if (list[index].id == arr[i].categortType) {
                    //  let newObj={
                    //   Image: arr[i].Image,
                    //   name: arr[i].name,
                    //   view: arr[i].view,
                    //   time: arr[i].time,
                    //   Elta7der: arr[i].Elta7der,
                    //   Eltahy: arr[i].Eltahy,
                    //   Elsouba: arr[i].Elsouba,
                    //   components: arr[i].components,
                    //   Step: arr[i].Step,

                    //   }
                    //   ret.push(newObj)
                    ret.push(arr[i])
                }

            }
            console.log(ret)
            setCategoryReturn(ret)
            // ret = []
        }
        setCategoryReturn(ret)
        SetCategory(list)
        setindexName(index)

    }


    const navigation = useNavigation();

    return (
        <>
            <View style={{ backgroundColor: COLORS.pramary, flex: 1 }}>
                <ScrollView>
                    <View style={styles.Header}>
                        <View>
                            <View></View>
                            {IconSearch ? (
                                <>
                                    <Animatable.View
                                        animation='slideInLeft' >
                                        <TouchableOpacity
                                            onPress={() => {

                                                setIconSearch(false);
                                            }}>
                                            <Ionicons name='ios-search-circle' size={60} color={COLORS.orange} />
                                        </TouchableOpacity>

                                    </Animatable.View>
                                </>
                            ) : (
                                <Animatable.View style={styles.SearchTextView}
                                    animation='flipInY' >
                                    <TextInput style={styles.SearchTextInput}
                                        placeholder={'البحث عن الأكلات...'}
                                        placeholderTextColor={COLORS.grayFont}
                                        onChangeText={(value) => {
                                            makesearch(value)

                                            setsearch(value)
                                        }}

                                        value={search} />
                                    <TouchableOpacity onPress={() => {
                                        setIconSearch(true);
                                    }}>

                                        <Ionicons name='search' size={ICONSSIZE.xlIcon} color={COLORS.pramary} />
                                    </TouchableOpacity>

                                </Animatable.View>
                            )}
                        </View>

                        <View style={styles.category_View}>
                            <ScrollView horizontal>
                                {Category.map((Category, index) =>
                                    <TouchableOpacity style={Category.choose ? styles.category_chosen_Box : styles.category_Box}
                                        onPress={() =>
                                            chooseCategory(index)

                                        }
                                    >
                                        <Image source={Category.img} style={{ width: width / 5, height: height / 12,borderRadius:5, resizeMode: "contain" }} />
                                    </TouchableOpacity>
                                )}
                            </ScrollView>
                        </View>
                        {showView ? (
                            <View style={styles.food_View}>

                                <View style={styles.Headerstarred}>
                                    <Text style={styles.textHeaderstarred}>
                                        الوصفات
                                    </Text>
                                    {/* <Text style={styles.textHeaderstarred2}>
        رؤية الكل
    </Text> */}
                                </View>
                                {animationDisplay ? (
                                    <>
                                        <View style={{ alignItems: "center", justifyContent: "center", alignSelf: "center", width: width, height: height / 1.8 }}>
                                            <LottieView
                                                ref={this.ref}
                                                source={require("../lottie/search_empty.json")}
                                                loop={true}
                                                autoPlay={true}
                                                speed={1.5}
                                            // style={{ alignSelf: "center" }}
                                            />
                                        </View>
                                    </>
                                ) : (
                                    <>
                                        {Food.map((item, index) =>
                                            item.view ? (

                                                <View style={styles.meal_View}>
                                                    <Image source={item.Image} style={styles.meal_image}
                                                        resizeMode={"cover"} />
                                                    <View style={{ width: width / 2.4, height: height / 12, alignItems: "center", justifyContent: "center" }}>
                                                        <Text style={styles.meal_name}>
                                                            {item.name}
                                                        </Text>
                                                    </View>
                                                    <View style={styles.view_time}>
                                                        <Text style={styles.text_time}>
                                                            {item.time}
                                                        </Text>
                                                        <Ionicons name='md-time' style={{ alignSelf: "center" }} size={ICONSSIZE.smIcon} color={COLORS.ButtonWhite} />
                                                    </View>
                                                    <View style={styles.option_view}>
                                                        <TouchableOpacity
                                                            onPress={() => {
                                                                navigation.navigate("Photo_page", {
                                                                    name: item
                                                                })
                                                            }
                                                            }
                                                            style={styles.button_option}>
                                                            <Text style={styles.button_text}>
                                                                الطريقة
                                                            </Text>
                                                        </TouchableOpacity>
                                                        <TouchableOpacity
                                                      onPress={() => {
                                                        navigation.navigate("WbeView", {
                                                            name: item
                                                        })
                                                    }
                                                    } style={styles.button_option}>
                                                            <Text style={styles.button_text}>
                                                                الفيديو
                                                            </Text>
                                                        </TouchableOpacity>

                                                    </View>


                                                </View>
                                            ) : (null)


                                        )}
                                    </>
                                )
                                }



                            </View>
                        ) : (
                            <View style={styles.food_View}>
                                <View style={styles.Headerstarred}>
                                    <Text style={styles.textHeaderstarred}>
                                        {Category[indexName].name}
                                    </Text>
                                    {/* <Text style={styles.textHeaderstarred2}>
                  رؤية الكل
                </Text> */}
                                </View>
                                {CategoryReturn.map((items, index) =>
                                    <View style={styles.meal_View}>
                                        <Image source={items.Image} style={styles.meal_image}
                                            resizeMode={"cover"} />
                                        <View style={{ width: width / 2.4, height: height / 12, alignItems: "center", justifyContent: "center" }}>
                                            <Text style={styles.meal_name}>
                                                {items.name}
                                            </Text>
                                        </View>
                                        <View style={styles.view_time}>
                                            <Text style={styles.text_time}>
                                                {items.time}
                                            </Text>
                                            <Ionicons name='md-time' style={{ alignSelf: "center" }} size={ICONSSIZE.smIcon} color={COLORS.ButtonWhite} />
                                        </View>
                                        <View style={styles.option_view}>
                                            <TouchableOpacity
                                                onPress={() => {
                                                    navigation.navigate("Photo_page", {
                                                        name: items
                                                    })
                                                }
                                                }
                                                style={styles.button_option}>
                                                <Text style={styles.button_text}>
                                                    الطريقة
                                                </Text>
                                            </TouchableOpacity>
                                            <TouchableOpacity
                                            onPress={() => {
                                                navigation.navigate("WbeView", {
                                                    name: items
                                                })
                                            }
                                            } style={styles.button_option}>
                                                <Text style={styles.button_text}>
                                                    الفيديو
                                                </Text>
                                            </TouchableOpacity>

                                        </View>


                                    </View>





                                )}
                            </View>
                        )}

                    </View>
                    <View style={{ height: 55 }}></View>
                </ScrollView>
            </View>


        </>
    )

}


const styles = StyleSheet.create({
    Header: {
        backgroundColor: COLORS.pramary,
        alignItems: "center",
        flex: 1,

    },

    SearchTextView: {
        backgroundColor: COLORS.white,
        width: width / 1.1,
        // height: height / 15,
        alignItems: "center",
        justifyContent: "center",
        borderRadius: RADIUS.smRadius,
        marginVertical: MARGIN.xxsMargin,

        // borderWidth: 1,
        // borderColor: COLORS.orange,
        // paddingHorizontal: PADDING.xsPadding,
        // fontSize: FONTS.h,
        flexDirection: "row"

    },
    SearchTextInput: {
        // backgroundColor: COLORS.white,
        width: width / 1.4,
        // height: height / 17,
        alignItems: "center",
        alignSelf: "center",
        // backgroundColor:COLORS.black,
        color: COLORS.black,
        justifyContent: "flex-end",
        fontFamily: "Generator Black",
        // borderRadius: RADIUS.lgRadius,
        // borderWidth: 2,
        // borderColor: COLORS.orange,
        paddingHorizontal: PADDING.smPadding,
        fontSize: FONTS.h4
        // marginVertical: MARGIN.xsMargin

    },
    category_View: {
        height: height / 10,
        width: width / 1,
        alignItems: "center",
        alignSelf: "flex-start",
        // backgroundColor:"#000",
        flexDirection: "row",
        marginTop: MARGIN.xxsMargin
    },

    category_Box: {
        width: width / 4.5,
        height: height / 11,
        padding: PADDING.xsPadding,
        alignItems: "center",
        justifyContent: "center",
        backgroundColor: COLORS.pramary50,
        marginLeft: 5,
        borderRadius: RADIUS.xsRadius
    },
    category_chosen_Box: {
        width: width / 4.5,
        height: height / 11,
        padding: PADDING.xsPadding,
        alignItems: "center",
        justifyContent: "center",
        backgroundColor: COLORS.warning,
        marginLeft: 5,
        borderRadius: RADIUS.xsRadius
    }
    ,
    food_View: {
        width: width,
        backgroundColor: COLORS.pramary,
        flexDirection: "row",
        flexWrap: "wrap",
        padding: PADDING.xsPadding,
        alignItems: "center",
        justifyContent: "space-around",
        marginTop: MARGIN.xxsMargin
    }
    ,
    Headerstarred: {
        width: width / 1.05,
        flexDirection: "row",
        justifyContent: "space-between",
        alignItems: "center",
        alignSelf: "center"
    },
    textHeaderstarred: {
        fontSize: FONTS.h1,
        color: COLORS.ButtonWhite,
        // fontWeight: "bold",
        fontFamily: "Generator Black"
    },
    textHeaderstarred2: {
        fontSize: FONTS.h5,
        color: COLORS.gray,
        // fontWeight: "bold",
        fontFamily: "Generator Black"
    },
    meal_View: {
        width: width / 2.1,
        alignItems: "center",
        marginVertical: MARGIN.xxsMargin,
        padding: PADDING.lgPadding,
        borderRadius: RADIUS.xxsRadius,
        backgroundColor: COLORS.pramary50
    },
    meal_image: {
        width: width / 2.4,
        height: height / 5,
        borderRadius: RADIUS.xxsRadius,
    },
    meal_name: {
        fontSize: FONTS.h4,
        color: COLORS.white,
        fontFamily: "Generator Black",
        textAlign: "left"
    }
    ,
    view_time: {
        width: width / 2.4,
        alignItems: "center",
        flexDirection: "row",
    },
    text_time: {
        fontSize: FONTS.h4,
        color: COLORS.white,
        fontFamily: "Generator Black",
        alignSelf: "center",
        marginHorizontal: 2
    }
    ,
    option_view: {
        width: width / 2.4,
        alignItems: "center",
        justifyContent: "space-around",
        flexDirection: "row",

    },
    button_option: {
        width: width / 6,
        backgroundColor: COLORS.orange,
        borderRadius: RADIUS.smRadius,
        alignItems: "center",
        justifyContent: "center",
    },
    button_text: {
        fontSize: FONTS.h5,
        color: COLORS.white,
        fontFamily: "Generator Black",
        alignSelf: "center",
        marginHorizontal: 2
    }
});
