import React, { useState } from 'react';
import {
  View,
  Text,
  TouchableOpacity,
  Dimensions,
  StyleSheet,
  TextInput,
  ScrollView,
  Image
} from 'react-native';
import { useNavigation, NavigationContainer } from '@react-navigation/native';
import { createNativeStackNavigator } from '@react-navigation/native-stack';
import { COLORS, PADDING, MARGIN, RADIUS, FONTS, ICONSSIZE } from '../constants/Constants'
import Ionicons from 'react-native-vector-icons/Ionicons'
import * as Animatable from 'react-native-animatable';
const { width, height } = Dimensions.get('window');
import LottieView from 'lottie-react-native';


export default function FoodCommon() {
  const [Food, setFood] = useState(
    [
      {
        Image: require("../img/riseandche.jpg"),
        name: "أرز مقلي بالدجاج",
        view: true,
        time: "25 min",
        Elta7der: '10 min',
        Eltahy: "15 min",
        Elsouba: "10",
        components: "1 صدر دجاج \n ½ بصله \n ثوم كامله \n جزر\n بصله اخضر\n رز مصري\n 2 بيضة",
        Step: "اطبخ في جهاز طهي رز ١٥ دقاق على مع زيت ملح \n بعد زيت و دجاج احط مع بهارات الثوم و بهارات مشكلا و ملح و صلصة صويا حلو \n اقطع الثوم و بصله و بصله أخضر و جزر\n اقلي بصل و الجزر و بيضة مع زيت و قليل صلصة صويا حلو \n بعد احط دجاج مع البصله الخضر و ثوم\n واحط كل حاجه علي بعضها ",
        categortType: 1,
        video: "https://www.youtube.com/watch?v=qZFWEYXOV28"

      },
      {
        Image: require("../img/dgagAndKary.jpg"),
        name: "دجاج بالكاري",
        view: true,
        time: "35 min",
        Elta7der: '10 min',
        Eltahy: "25 min",
        Elsouba: "15",
        components: " كيلو من قطع الدجاج دجاج \n ملح وفلفل أسود  \n ٢ بصلة\n ٤ فصوص ثوم\n قطعة جنزبيل صغيرة \n نصف كوب صلصة طماطم \n ٢ ل ٣ ملعقة صغيرة من بودرة الكاري\n كوب من الكريمة\n ملعقة صغيرة سكر و ملعقة كبيرة خل",
        Step: "نحمص المكونات على نهار هاديه ، ماعدا الدجاج\n نحط المكونات بالخلاط مع الكريمه ونخفقهم لحد ما تنطحن جميع المكونات جيداً\n بنفس المقلاة نقطع الدجاج ونشوحه و نحط فوقه الصوص و نخليه يتسبك معاه لحد ما تنجانس النكهات ويستوي الدجاج\n نرش فوقه كزبره او بقدونس وناكله مع رز او خبز ",
        categortType: 4,
        video: "https://www.youtube.com/watch?v=88rOVd-Aipk&t=13s"

      },
      {
        Image: require("../img/shesh.jpg"),
        name: "شيش طاوق",
        view: true,
        time: "45 min",
        Elta7der: '10 min',
        Eltahy: "35 min",
        Elsouba: "15",
        components: "5 ملاعق كبيره زبادي\n1 معلقه كبيره صلصه\n1 ملعقه صغيره بهارات مشكله\n1 معلقه كبيره ثوم مهروس\n1 ملعقه صغيره فلفل اسود\n1 ملعقه صغيره ملح\nحبتين ليمون\nبصل مقطع مربعات\nصدور دجاج حسب الرغبه مقطعه مربعات",
        Step: "نحط كل المقادير مع الدجاج وخليها ١٢ ساعه في الثلاجة وبعدين نجيب الصيخ ونحط قطعه دجاج وبعدين نحط بصل ونسوي نفس الطريقه الين تخلص كل الكميه وبعدين ندخلها الفرن من فوق وتحت على حرارة ١٧٠ الين تحمر وتستوي تاخذ نص ساعه",
        video: "https://www.youtube.com/watch?v=fXYtJjiPAOU",
        categortType: 1,


      }
      ,
      {
        Image: require("../img/maklopa.jpg"),
        name: "المقلوبة",
        view: true,
        time: "60 min",
        Elta7der: '15 min',
        Eltahy: "40 min",
        Elsouba: "30",
        components: "2 حبة بصل مفرومة\n 3 حبات طماطم مفرومة\n 1 حبة فلفل أخضر مفروم\n1 كوب أرز\n ملح وفلفل أسود حسب الذوق\n 2 ملعقة كبيرة زيت زيتون",
        Step: "يسخن الزيت في مقلاة كبيرة ويضاف البصل ويقلب حتى يصبح شفافاً.\n يضاف الطماطم والفلفل الأخضر ويقلب لبضع دقائق.\nيضاف الأرز ويقلب جيداً حتى يتغطى بالصلصة ويتماسك.\nيضاف الماء ويترك ليغلي ، ثم يخفض الحرارة ويترك ليطهو لمدة 20-25 دقيقة حتى يصبح الأرز مطهواً.\nيقدم المقلوبة ساخنة. ",
        video: "https://www.youtube.com/watch?v=1t8RsqlQd8k",
        categortType: 3,


      },
      {
        Image: require("../img/Egyptian_food_Koshary.jpg"),
        name: "كشري",
        view: true,
        time: "50 min",
        Elta7der: '10 min',
        Eltahy: "40 min",
        Elsouba: "20",
        components: "2 كوب أر\nز1 كوب عدس\n1/2 كوب شعيرية مقطعة\n1 بصلة مفرومة\n3 فصوص ثوم مفرومة\nملح وفلفل حسب الذوق\nزيت للقلي\n",
        Step: "يغلى العدس في ماء مملح حتى يصبح طرياً ثم يصفى.\n  يحمص الأرز في زيت ساخن ثم يضاف الماء والملح ويترك ليطهى حتى يصبح الأرز مطهواً.\nيقلى البصل والثوم في زيت حتى يصبحان ذهبيين ثم يضاف العدس ويترك لمدة 5 دقائق.\n تقلى الشعيرية حتى تصبح ذهبية ثم تضاف إلى الأرز وتخلط جيداً.\n يقدم الكشري ساخناً مع العدس والشعيرية المقلية والبصل والثوم.",
        video: "https://www.youtube.com/watch?v=Jrs7KaqzYHA",
        categortType: 4,


      },


      {
        Image: require("../img/download.jpg"),
        name: "الملوخية ",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '1 باقة ملوخية طازجة أو مجمد\nة  1 كيلو لحم بقري مقطع إلى مكعبات صغيرة\n  2 بصلة متوسطة الحجم مفرومة\n  4 فصوص ثوم مفرومة\n  1/2 كوب كزبرة مفرومة\n  1/2 كوب بقدونس مفروم\n1 ملعقة صغيرة بهارات مشكلة\n 1 ملعقة صغيرة كركم\n 1 ملعقة صغيرة فلفل أسود\n  1 ليمونة مقطعة إلى شرائح\n ملح حسب الذوق\n 2 لتر ماء\n زيت نباتي للطهي\n ',
        Step: "يغسل اللحم ويترك جانباً.\n تقشر البصلة وتفرم جيداً ويضاف إليها الثوم وتخلط معاً.\n تسخن الزيت في قدر كبير ويضاف البصل والثوم ويقلب حتى يصبح لونهما ذهبياً.\n يضاف اللحم وتقلب جيداً حتى يصبح لونه بنياً.\n يضاف الملوخية ويقلب جيداً لمدة 5 دقائق.\n يضاف الماء والتوابل ويترك المزيج يغلي.\n يقلب المزيج جيداً ويترك ليطهى لمدة ساعة تقريباً أو حتى يصبح اللحم طرياً والملوخية مطهوة.\n يضاف الكزبرة والبقدونس ويترك المزيج لمدة 5 دقائق ثم يزال من النار.\n يقدم المزيج الساخن مع الأرز وشرائح الليمون. ",
        video: "https://www.youtube.com/watch?v=bFMVOZFjCmM",
        categortType: 4,


      },

      {
        Image: require("../img/127-010613-egyptian-basrah-recipe-2.jpg"),
        name: "يصاره",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: 'ربع كيلو من الفول المقشر.  بصلة كبيرة.\n 5 فص ثوم مفروم.\n ملعقة كبيرة من النعناع المجفف.\n 2 ملعقة كبيرة من الشبت.\n ملعقة كبيرة من الكزبرة الخضراء.\n  2 ملعقة كبيرة من البقدونس.\n  ملعقة صغيرة من الكمون.\n نصف ملعقة صغيرة من الفلفل الأسود.\n القليل من الملح.',
        Step: "بعد نقع الفول يتم تصفيته ويوضع في قدر به ماء، ويرفع على النار حتى الغليان.\n  يضاف إليه البصل والثوم ويترك على النار لمدة ساعة تقريبا حتى تمام النضج.\n نضع إلى الفول الكزبرة والشبت والبقدونس، ونتبله بالملح والفلفل الأسود والكمون، وتترك المكونات على النار لمدة 10 دقائق إضافية.\n يرفع القدر من على النار ويترك حتى يبرد قليلا، ويتم خلطه في الخلاط الكهربائي حتى نحصل على قوام ناعم.\n نضع الخليط في القدر مرة أخرى ويرفع على النار الهادئة حتى الغليان.\n في مقلاة على النار نضع الزيت ويترك حتى يسخن، ونضيف إليه البصل مع التقليب حتى يذبل.\n نضع الثوم ويتم التقليب حتى يحمر لونه.\n تغرف البصارة في طبق التقديم ويرش عليها البصل والثوم المحمر، ويعصر القليل من الليمون، وتقدم بالهناء والشفاء.",
        video: "https://www.youtube.com/watch?v=Jo8FeBhebQ4",
        categortType: 4,


      },

      {
        Image: require("../img/mapkpaka.jpg"),
        name: "مكرونة مبكبكة ",
        view: true,
        time: " 60 min",
        Elta7der: '10 min',
        Eltahy: "50 min",
        Elsouba: "30",
        components: "ك لحمة مقطع\nة ك طماطم معصورة\n 1/2 مكرونة\n معلقة سمنة\n بصلة مقطعة\n 2 قرن شطة حامي\n معلقة فلفل\n 2 معلقة ملح\n  معلقة كمون شطة",
        Step: "هنجيب حلة ونحط فية السمنة ونحط اللحمة ونقلبة\nلاحد متشوح هنحط مياة سخنة ونحط بصلة وطماطمة\n ولوري وحبهان والشطة ونسيبة تستوي\n هنجيب حلة ونحط معلقة سمنة ونحط البصل ونقلب ونحط الطماطم\nوالتوابل والملح ونسيبة تغلى نحط المكرونة واللحمة ونسيبة لاحد السوية\nبعد كدة نقدمة والف هنا ",
        video: "https://www.youtube.com/watch?v=OMx_uiTsgII",
        categortType: 2,


      },
      {
        Image: require("../img/macrona_bl_skoq.jpg"),
        name: "مكرونة فرن بالسجدق",
        view: true,
        time: " 50 min",
        Elta7der: '10 min',
        Eltahy: "40 min",
        Elsouba: "30",
        components: '½ مكرون\nة ½ سجدق\n ½ طماطم معصورة\n بصلة مقطعة\n 2 قرن فلفل مقطع\n 2 فص توم مقطع\n معلقة ملح فلفل شطة\n رشة بهارات\n معلقة سمنة\n قرن فلفل حامي مقطع',
        Step: "هنجيب طاسة ونحط السمنة \nونحط السجدق ونقلبة لاحد ميتغر لونة هنحط البصل ونقلب\nنحط التوم ونقلب\nنحط الفلفل ونقلبة ونحط الطماطم والتوابل والملح والبهارات\nونسيبة لاحد متسبك\nهنجيب الطاجن ويكون كبير هنحط المكرونة ونحط الصلصة بالسجدق مع كوبية مياة سخنة\n ونغطي الطاجن ونسيبة لاحد السوية\n بعد كدة نشيل الغط وتحت الشوية والف هنا",
        video: "https://www.youtube.com/watch?v=52f1YWvX4vU",
        categortType: 2,


      },

      {
        Image: require("../img/download1.jpg"),
        name: "طاجن مكرونة بشاميل ",
        view: true,
        time: " 50 min",
        Elta7der: '10 min',
        Eltahy: "40 min",
        Elsouba: "30",
        components: '½ كيلو مكرونة بنة او اقلا\nم ماء للغلى\n ملح\n الحشو:\n ¼ كيلو لحمة مفرومة\n ملح\n فلفل اسمر\n بصلة مفرومة او مقطعة صغير\n البشاميل:\n 4 معالق دقيق\n  لتر لبن\n معلقتين سمن\n مكعب مرق\n ملح\n فلفل\n جبن رومى او موتزريلا',
        Step: "فى حلة يغلى الماء ثم يضاف المكرونة والملح وتترك لتستوى ثم تصفى ولا تغسل \nفى طاسة يوضع البصل والسمن حتى تصبح البصل ذهبى اللون يضاف اللحمة ويقلب ثم يضاف الملح والفلفل\nفى حلة يضاف السمن والدقيق ويقلب ثم يضاف اللبن والملح والفلفل والمكعب المرق ويقلب حتى يتقل القوام\nتحضر البرامات الصغيرة او الطواجن الصغيرة تدهن بمادة دهنية\nيضاف قليل من البشاميل الى المكرونة ويقلب ثم توضع طبقة من المكرونة فى البرام ثم يضاف اللحمة ثم توضع الطبقة الثاتية\n يغطى الوجه بالبشاميل و الجبن وتدخل فرن ساخن لمدة 20 دقيقة ",
        video: "https://www.youtube.com/watch?v=jzr_0t74aJA",
        categortType: 2,


      },
      {
        Image: require("../img/Untitled-108.jpg"),
        name: "مكرونة وايت صوص",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '400 جرام مكرونة قلم\n كوب حليب 2\n3 ملعقة كبيرة \n ملعقة كبيرة زبدة\n ملح\n فلفل أسود\n كوب جبن شيدر أو ميكس جبن',
        Step: "تسلق المكرونة في ماء مغلي مملح حتى تصل إلى درجة النضج المرغوب.\nنضيف الدقيق والزبدة إلى الحليب ونخلطهم جيدا بالمضرب اليدوي معه ثم نرفعهم على النار مع استمرار التقليب حتى يتقل القوام. \nنضيف الملح والفلفل الأسود ونقلب ثم الأجبان ونقلب حتى تذوب\nثم نضيف المكرونة المسلوقة إلى الصوص ونقلب ونتركها حتى يغلي بها ثم ترفع من النار وتقدم وبالهنا. ",
        video: "https://www.youtube.com/watch?v=rjH9sgsMADE",
        categortType: 2,


      },

      {
        Image: require("../img/makronawithgampry.jpg"),
        name: "مكرونة بالجمبري",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: "½ كيلو جمبري متقشر ومتنض\nف لمونة\n ½ معلقة صغيرة كمون\n ½ معلقة صغيرة فلفل اسود\n ½ معلقة صغيرة كسبرة\n معلقة كبيرة زبدة\n معلقة صغيرة مليانة توم مفروم\n معلقة كبيرة دقيق\n",
        Step: "بنتبل الجمبري باللمون والكمون والفلفل الاسود والكسبرة \nفي حلة بنشوح التوم وننزل بالجمبري ونقلب لحد مايستوي بعدين نطلعه ونحط مكان الجمبري الزبدة والدقيق ونقلب وبعدين نحط مكعب المرق ونقلب بعدين نحط اللبن والكريمة اللباني ونرجع الجمبري تاني ونقلب ولما يبتدي يتقل نحط المكرونة ونقلب تقلبتين وخلاص ولو حسيتوا ان الصوص تقيل بتزودوا لبن لو مظبوط خلاص  ",
        video: "https://www.youtube.com/watch?v=bgpUK0nkFkY",
        categortType: 2,


      },
      {
        Image: require("../img/makronabldggag.jpg"),
        name: "مكرونة كريمية بالدجاج ",
        view: true,
        time: " 60 min",
        Elta7der: '10 min',
        Eltahy: "50 min",
        Elsouba: "50",
        components: 'تتبيلة الدجاج:\n2 صدور دجاج 4 ملاعق كبيرة زيت نباتي\n 1 ملعقة كبيرة توابل كيچن \n 1 ملعقة صغيرة بودرة بصل\n 1 ملعقة صغيرة بودرة ثوم\n  1 ملعقة صغيرة بقدونس مجفّف\n 1 ملعقة صغيرة بهارات دجاج\n 1/2 ملعقة صغيرة بابريكا المكرونة:\n 500 جرام مكرونة أقلام \n1 كوب كريمة طبخ\n1 كوب مرقة دجاج\n1/2 كوب "115 جرام" جبنة كريمية\n1 حبّة بصل مفروم\n1 حبّة طماطم مقطّعة مكعبات\n1 حبّة فلفل رومي مقطّع مكعبات\n1 ملعقة كبيرة زبدة\n1 ملعقة صغيرة بودرة مرقة دجاج\n1 ملعقة صغيرة توابل كيچن\n1/2 ملعقة صغيرة ثوم مهروس\nملح - فلفل أسود\nة ',
        Step: "نسلق المكرونة بالطريقة المعتادة ثم نصفّيها ونتركها جانباً ونبدأ أولاً بتجهيز الدجاج، إذا كانت الصدور سميكة نضعهم بين طبقتين من الورق الشفاف ونَدُقّهم وهذا حتى ينضجوا تماماً من الداخل ثم ندهنهم بملعقة كبيرة من الزيت\nهذه بهارات الكيچن التي استخدمتها بالوصفة وهي تُضفي نكهة مميزة ولذيذة جداً للطبق، نخلط كل مكونات التتبيلة معاً بطبق صغير ونغلّف بهم صدور الدجاج\nوبمقلاة عميقة وغير لاصقة نسخّن حوالي 3 ملاعق كبيرة من الزيت ونشوِّح به الدجاج لمدة 10 دقائق تقريباً مع التقليب المستمر على كل الجوانب حتى ينضجوا تماماً ثم نُخرجهم جانباً ونتركهم لتهدأ حرارتهم قليلاً\n بنفس المقلاة نُذيب الزبدة ونشوِّح بها البصل والثوم حتى يلين قوام البصل ثم نُضيف مكعبات الفلفل والطماطم وعندما يلين قوام الخضروات نضع الكريما ومرقة الدجاج ثم الجبنة الكريمية ونقلّب جيداً حتى تتجانس المكونات ثم نُضيف بودرة مرقة الدجاج وبهارات الكيچن ونتبّل بالملح والفلفل الأسود\nوعندما يبدأ الخليط بالغليان نُضيف المكرونة المسلوقة مع التقليب الجيد حتى تختلط بها كل المكونات ثم نقطّع صدور الدجاج إلى شرائح ونقلّبهم مع المكرونة ونترك بعض الشرائح جانباً لوضعهم على الوجه عند التقديم النهائي\nنرفع المكرونة عن النار وتوضع بأطباق التقديم ونرُش الوجه بالقليل من الجبنة المبشورة أو نزيّن حسب الرغبة\nوأخيراً تُقدَّم مكرونة الدجاج والكيچن ساخنة",
        video: "https://www.youtube.com/watch?v=rFOASDE9kgs",
        categortType: 1,


      },
      {
        Image: require("../img/733.jpg"),
        name: "صينية بطاطس باللحمة",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "40",
        components: '1 كيلو لحمة مسلوقة \n 1 كيلو بطاطس \n  3 كوب عصير طماطم\n 1 كوب ماء بصلة حلقات \n 1 ملعقة صغيرة ثوم مفروم  \n1 ملعقة كبيرة سمنة \n فلفل حار  حسب الرغبة\n  ملح  \n فلفل أسود ',
        Step: "شوحي البصل في زيت مخصص للطهى على النار مع إضافة ذرة ملح له حتى تذبل ثم تضاف قطع اللحمة وتحمر قليلا ثم يضاف عصير الطماطم والثوم ويقلب الخليط بشكل جيد\n ضعي شرائح البطاطس في صينية مع الفلفل الحار حسب الرغبة و يضاف خليط الطماطم والطماطم إلى البطاطس و يضاف الماء والملح والفلفل الأسود\n توضع الصينية على النار لتغلي ثم توضع في الفرن وانتظري حتى تمام النضج ",
        video: "https://www.youtube.com/watch?v=QaGmEgUaODc",
        categortType: 5,


      },
      {
        Image: require("../img/491.jpg"),
        name: "كفتة الجمبري",
        view: true,
        time: " 35 min",
        Elta7der: '10 min',
        Eltahy: "25 min",
        Elsouba: "50",
        components: 'جمبري مفروم \n سمك فيليه\n  بيض \n زنجبيل طازج \n  شبت \n فلفل ألوان \n أعشاب \n كاري \n جزر \n  كزبرة خضراء \n خلة خشب \n بقسماط \n ثوم \n ملح \n فلفل \n زيت ذرة ',
        Step: "افرمي الزنجبيل والثوم والجزر والفلفل الألوان والكاري والأعشاب وملح وفلفل وسمك فيليه وجمبري بشكل جيد \nضعي القليل من البقسماط مع الاستمرار في الفرم\n ثم شكلي العحينة اصابع في خلة خشب باستخدام الزيت وضعيها على الشواية حتى تنضج ثم قدميها ",
        video: "https://www.youtube.com/watch?v=_oMKekApjXg",
        categortType: 6,


      },
      {
        Image: require("../img/0shrimpsgrilledtomato.jpg"),
        name: "مكرونة بالجمبري",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "40",
        components: '300 جرام معكرونه 300 جرام جمبري\n ½ معلقه صغيره فلفل اسود\n معلقه صغيره كاري\n بصلة متوسطة متقطعة\n كوب فلفل رومي متقطع\n 5 وحدات طماطم متقطعين\n فصين ثوم\n ملح حسب التذوق\n كوب ونص ميه',
        Step: "حلة كبيرة هنضيف المكونات جمب بعضها ونضيف الماء الساخنة ونغطيها ونشغل النار متوسطة\nاول ماتبدأ تغلى هنقلب كل المكونات مع بعضهم حلو اوي وهنهدي النار ونخليها متغطيها و تكمل تسويه\nبعد حوالي ١٥ دقيقه هنفتح عليها ونقلبها كويس اوي وتتقدم ساخنة ",
        video: "https://youtube.com/watch?v=Uk58nYk9gnk",
        categortType: 6,


      },

      {
        Image: require("../img/downloadgggg.jpg"),
        name: "طاجن سمك فيليه بالخضار",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '½ كيلو سمك فيلي\nه 2 فلفل\n2 بصل\n 2 طماطم\n ثوم مفروم\n  توابل',
        Step: "تقطيع الخضار قطع صغيرة\nتتبيل الخضار ملح وفلفل وكمون و2معلقة بهار سمك ومعلقة ثوم مفروم\nنحضر صينية بايركس مقاس وسط ونضع نص كمية الخطار ونرص السمك ثم نضع باقي كمية الخضار                ",
        video: "https://www.youtube.com/watch?v=cqtKgbxeq1c",
        categortType: 6,


      },
      {
        Image: require("../img/19_2020-637241093415267072-526.jpg"),
        name: "شوربه سى فوود بالكريمه",
        view: true,
        time: " 60 min",
        Elta7der: '15 min',
        Eltahy: "45 min",
        Elsouba: "30",
        components: '½ كيلو طبق سى فوود وز\nن علبه كريمه طهى\n ملح وفلفل اسود\n كمون/شطه/حبهان\n لتر مايه مغلى\n معلقتين زبده\n5 فصوص ثوم',
        Step: "نحط حله عالنار ونحط فيها الزبده\nنغسل السى فوود بالمايه\nنحط السى فوود فالحله ونشوحها فالزبده لمده من 5دقايق ل10دقايق\nوبعدين نحط التوم وطبعا يبقا مهروس ونشوحهم تانى تشويحه بسيطه\nوبعدين نحط المايه المغليه عليهم ونحط جميع البهارات وبعدين نسيبهم يغلو على نار متوسطة الحرارة لمده نص ساعة\nوبعد النصف ساعة نحط الكريمه ونسيبها تغلى لمدة 10دقايق\nوبعدين تقدم بالهنا والعافيه",
        video: "https://www.youtube.com/watch?v=uAgYzfTctV8",
        categortType: 6,


      },
      {
        Image: require("../img/flafel.jpg"),
        name: "فلافل بيتي بالخلاط",
        view: true,
        time: " 40 min",
        Elta7der: '35 min',
        Eltahy: "5 min",
        Elsouba: "30",
        components: '1/2 ك فول مدشو\nش 1 بصلة كبيرة\n3 حزم كرات\n  2 حزمة بقدونس\n 1 راس ثوم',
        Step: "يبل الفول ف الماء قبلها بيوم\nيقطع الكرات والبقدونس ويغسل\nيقطع البصل مكعبات ويقشر الثوم\nف كبة الخلاط نضع الخليط ونضرب الي أن تصير ناعمه\nتحفظ ف اكياس ف الثلاجة وعند الاستخدام نضيف على العجين ملح وشطة وكمون وكزبرة حصي ونص ملعقة صغيرة بيكنج بودر\nيشكل العجين لاقراص وتتبل ف السمسم الابيض وتقلي بالزيت",
        video: "https://www.youtube.com/watch?v=3qn7YG4vTdw",
        categortType: 4,


      },
      {
        Image: require("../img/484.jpg"),
        name: "جلاش باللحمة المفرومة",
        view: true,
        time: " 30 min",
        Elta7der: '10 min',
        Eltahy: "20 min",
        Elsouba: "30",
        components: '½ كيلو لحمة معصج\nة لفة جلاش\n بيضتين\n كوب لبن\n ¼ معلقه صغيره فلفل اسود\n ¼ معلقه صغيره ملح\n معلقتين كبار سمن \n  ',
        Step: "هنحضر اللحمة ونخليها على جمب لينك الوصفة فالمكونات \nهندهن صينيه كبيره بالسمن وهنفتح الجلاش هناخد ورقتين ونرص نصهم فالصينيه ونصم برا\nوناخذ ورقتين تاني ونرصهم نصهم في الصينيه ونصهم برا وبين كل راق والتاني هنضيف مسحة من السمن هنضيف اللحمة ونطبق ورق الجلاش الي برا على الحشو\nوبين كل تطبيقه والتانيه هنضيف مسحة سمنه لما تقفل خالص وعلى الوش هنضيف ورقه كاملة وبعدين نقطعها حسب الرغبة يامربعات يامثلثات ومسحة سمن عالوش\nفي طبق صغير هنضيف اللبن والبيض والملح والفلفل الأسود ونربهم مع بعض حلو اوي ونوزعه على وش الجلاش وندخلها الفرن تستوي على درجة حرارة ١٨٠ وتتحمر من الوش تتقدم سخنة وبالهنا ",
        video: "https://www.youtube.com/watch?v=me3ZoOCpb6U",
        categortType: 4,

      },
      {
        Image: require("../img/m5zn_12528406b9a94fc.jpg"),
        name: "الفراخ المشوية بالبقدونس والجزر",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "50",
        components: '6 افخاذ دجا\nج التتبيلة، معلقه ونص كبار ملح\n4 معالق كبار عسل اسود\n½ معلقة صغيره فلفل اسود\n½ معلقة صغيره كاري\n معلقه صغيره زعتر\n 4 معالق كبار خل\n بصله كبيره مبشورة\n ½ كوب جزر مبشور\n معلقتين كبار بقدونس متقطع\n معلقه صغيرة توم مفروم',
        Step: "هنغسل الفراخ وتتقطع ونخليها تتصفي خالص من الميه\nفي بولة غويطة هنضيف مكونات التتبيلة كلها ونقلبها مع بعض حلو اوي\nفي بولة غويطة هنضيف مكونات التتبيلة كلها ونقلبها مع بعض حلو اوي\nهنرصها فالصينيه وندخلها الفرن تتشوي على درجة حرارة ٢٢٠ وتتقدم سخنة مع المكرونة او الأرز وبالهنا ",
        video: "https://www.youtube.com/watch?v=INcw74ZiYnY",
        categortType: 1,
      },
      {
        Image: require("../img/4647824981584556199.jpg"),
        name: "بطاطس محشية باللحمة المفرومة",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: 'كيلو بطاطس صغير\nه½ كيلو لحمه مفرومه\nبصل\nم ص ملح وفلفل\nم ص بهارات\n2 م ك صلصه\nم ص توم مفروم\nم ص بابريكا',
        Step: "تقشر البطاطس وتقور ثم تغسل بالماء ثم تحمر فى زيت غزير\nنقوم بتعصيج اللحمه بوضع معلقه سمنه فى وعاء مناسب ثم ننزل بالبصل يدبل ثم اللحمه ونتبلها ونتركها تنضج\nنقوم بحشو اللحمه داخل البطاطس ثم نرصها فى صينيه\nفى طاسه صغيره ننزل بمعلقه زيت ثم التوم والصلصه والتوابل ثم نسقى بها البطاطس ثم ندخلها الفرن تحمر ونخرجها نقدمها بالف هنا",
        video: "https://www.youtube.com/watch?v=Bybn0UwkOrU",
        categortType: 4,


      },

      {
        Image: require("../img/rokak.jpg"),
        name: "رقاق طري باللحمة المفرومة",
        view: true,
        time: "40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: ' لفه رقاق طري.\n نصف كيلو لحم مفروم.\n بصلة كبيرة مبشورة.\n طماطم مبشورة.\n معلقة صلصة كبيرة.\n مرقة دجاج.\n توابل لحم.\n فلفل أسود.\n فلفل أخضر مقطع.\n ملح.\n لبن.\n شوربة لحم أو فراخ.\n سمن.',
        Step: "نحضر صينية متوسطة مدهونة بالسمن، ثم نضع ورقة واحدة من الرقاق ونمسح بالسمن، ونكمل بهذه الطريقة حتى نكمل نصف الكمية الموجودة من الرقاق.\nنضع اللحم المفروم المعصج في المنتصف ونكمل باقي الأوراق بهذه الطريقة. \nنضع الشوربه من فوقها وتدخل الفرن على درجة حرارة متوسطة حتى يحمر الوجه ويقدم ساخنا. ",
        video: "https://www.youtube.com/watch?v=Op3UgTR3ujE",
        categortType: 4,


      },

      {
        Image: require("../img/54423-55.jpg"),
        name: "طاجن بطاطس باللحمة",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: 'ك بطاطس مقط\nعك لحمة مقطع\n ك طماطم معصور\n3 فص ثوم مقطع\n بصلة مقطعة\n2 معلقة ملح فلفل\n ملعقة كزبرة\n معلقة بهارات على جوزة الطيب\n ورقة لوري على حبهان',
        Step: "هنجيب حلة ونحط فية طماطم وبصلة ولوري وحبها\nونسيبة تغلى نحط للحمة\nاول متخش في السوية نحط ملعقة ملح وفلفل\nبعد كدة هنجيب الطاجن الطاجن ونحط البطاطس واللحمة والبصل والملح\nونحط التوابل والبهارات ونقلبهم في بعض\nونحط الطماطم ومعلقة سمنة\nونغطية بفويل وندخلة الفرن\nلاحد السوية\nهنشيل الغط ونحطة تحت الشوية",
        video: "https://www.youtube.com/watch?v=UiPWYbzN0-U",
        categortType: 6,


      },

      {
        Image: require("../img/meatWithfrek.jpg"),
        name: "طاجن لحمة بالفريك",
        view: true,
        time: " 50 min",
        Elta7der: '10 min',
        Eltahy: "40 min",
        Elsouba: "60",
        components: '¼ ك فريك مغسول ومنقوع\n ½ ك لحمة مقطع\n معلقة سمنة\n2 معلقة زيت\n ملعقة صلصة\n بصلة مقطعة\n2 معلقة ملح وفلفل\n معلقة \n جوزة الطيب',
        Step: "هنجيب حلة ونحط السمنة ونحط اللحمة ونشوحة لاحد ميتغر اللون\nهنحط مياه ساخنة ونحط بصلة وطماطمة ونسيبة تخش في السوية\nنحط ملعقة ملح وفلفل\nهنجيب حلة ونحط ملعقة سمنة ونحط بصلة ونقلب ونحط الصلصة\nونحط ٢كوبية شوربة ونسيبة\nتغلى نحط الفريك ونحط التوابل والبهارات والملح ونسيبة يشرب\nهنجيب الطاجن ونحط الفريك واللحمة وندخلة الفرن\n",
        video: "https://www.youtube.com/watch?v=dQNoYn_7bA0",
        categortType: 6,

      },
      {
        Image: require("../img/1613190183_node.png"),
        name: "كشري مصري",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: 'معكرونة : 1 كيلو (مشكلة)\n  الأرز المصريّ : نصف كيل\nو العدس : نصف كيلو\n طماطم : 1 كيلو\n الثوم : 10 فصوص\n شعيرية : ربع كيلو\n البصل : 3 حبات\n الخل : حسب الحاجة\n ملح : حسب الرغبة\n الشطة : حسب الحاجة\n الكمون : حسب الرغبة\n حمص : ربع كيلو\n عصير الليمون : حسب الرغبة\n الزيت : حسب الحاجة\n الكزبرة : ربع ملعقة صغيرة',
        Step: "حمري 5 فصوص ثوم جيداً وأضيفي الطماطم بعد تصفيتها وضعي نصف ملعقة فلفل أسود وملعقة ونصف ملح و٤ ملعقة خل واتركيهم يغلوا جيداً حوالي نصف ساعة مع تزويد الماء ونتركها حتى تستوي. اغسلي نصف كيلو العدس جيداً ونغطيه بالماء ونزود ونضيف الثوم والبصل ونصف ملعقة كبيرة ملح ويترك على النار.\n ضعي في قدر 4 ملعقة زيت ونضيف الشعيرية ونحمرها جيداً ونغسل الأرز وينزل به على الشعيرية مع ملعقة من الملح والماء وتترك المكونات نصف ساعة حتى يستوي الأرز.\n في قدر آخر نضع الحمص حتى ينسلق مع نصف ملعقة صغيرة ملح.\n لتحضير الدقة: افرمي الثوم وضع كوب من الخل وكوب ماء ثم نصف ملعقة ملح ونصف ملعقة كمون وربع ملعقة كزبرة مطحونة.\n لتحضير الشطة: اضربي الطماطم في الخلاط وضعيهم في قدر وأضيفي 5 ملعقة من صلصة الكشري وعصير الليمون وملعقة كبيرة خل و5 ملعقة صغيرة شطة وملعقة ملح صغيرة وكوب من الماء ويترك ليغلي 5 دقائق.\n اسلقي المكرونة في الماء والزيت والملح وتصفى ونضيف 3 ملعقة زيت ونقلبها.\n حمري البصل الشرائح المغطى بالدقيق في الزيت الغزير حتى يتحمر.\n ضعي المكرونة في طبق التقديم، وأضيفي الأرز مع العدس والحمص وعليهم الصلصة والبصل المقرمش وضعي الدقة والشطة بأطباق جانبية.",
        video: "https://www.youtube.com/watch?v=RX6k_VjkM1M",
        categortType: 4,

      },
      {
        Image: require("../img/46188.jpg"),
        name: "ورق عنب",
        view: true,
        time: " 60 min",
        Elta7der: '20 min',
        Eltahy: "40 min",
        Elsouba: "90",
        components: 'نصف كيلو ورق عنب مسلوق.\n 2كوب كبير من عصير الطماطم.\n حزمه بقدونس.\n بصل مفروم.\n  ملعقة كبيرة سمن بلدي أو نباتي.\n ملح وبهارات محشي.\n 2 كوب مرقه دجاج أو لحم.\n 2 كوب أرز ابيض مغسول ومصفي جيداً من الماء.',
        Step: "تحضير وعاء مناسب وإضافة السمن مع البصل ويقلب جيداً لمدة دقيقتين ثم إضافة عصير الطماطم و الملح وبهارات المحشي  ويترك الطماطم على النار حتى يصبح خليطه سميك ثم إضافة البقدونس المفروم والأرز مع التقليب جيداً في وعاء مع إضافة شرائح من البصل والطماطم ثم حشو ورق العنب بخلطة الأرز ورصه بطريقه منظمه ومرتبة وبعد الانتهاء تضاف المرقة مع معلقة كبيرة من السمن ويطهي ورق العنب على نار عالية لمدة 10 دقائق ثم تهدئة النار ويطهي لمدة 40 دقيقة ويقدم ورق العنب ساخن مع الدجاج أو اللحم أو البط.",
        video: "https://www.youtube.com/watch?v=ELp9zkImO_8",
        categortType: 4,

      },
      {
        Image: require("../img/50e33a46e3aa05b3d61625a1840d936b_w750_h500.jpg"),
        name: "بيتزا الباربكيو",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '- مكونات العجينة :\n ملح : رشّ\nة  الزيت : ربع كوب\n  سكر : رشّة\n الخميرة الفورية : ملعقة كبيرة\nدقيق : 3 اكواب\n  ماء دافئ : كوب\n  - جبنة : كوب (مبشورة)\n   - صدر الدجاج : 2 قطعة\n - صلصة الباربيكيو : كوب\n - البصل : 1 حبة (مقطع شرائح)\n - ملح : رشّة\n - فليفلة خضراء : نصف حبة (مقطعة)\n - صلصة طماطم : 2 ملعقة كبيرة',
        Step: "ضعي الخميرة في كوب ماء دافئ مع رشة سكر، ثم حركي الخليط واتركيه قليلاً حتى يتخمر. ضعي الدقيق في طبق مع رشة ملح والزيت، واعجني جيداً حتى تحصلي على عجينة متماسكة.\n  ضعي العجينة في وعاء مدهون بالزيت وغلفيها واتركيها حتى تتخمر لمدة ساعة واحدة.\n ضعي صدور الدجاج المقطعة في قدر مع رشة ملح واقليها حتى تنضج.\n  افردي العجينة بواسطة الشوبك واصنعي ثقوباً في العجينة بواسطة شوكة.\n اخلطي صلصة الباربكيو مع صلصة الطماطم وافرديها على العجينة.\n ضعي صدور الدجاج والفليفلة الخضراء، وشرائح البصل، والجبنة المبشورة على العجينة.\n اخبزيها في الفرن حتى تنضج ثم قدميها.",
        video: "https://www.youtube.com/watch?v=HHPTD_eXfWI",
        categortType: 7,

      },
      {
        Image: require("../img/0fde4266664dbd6a75ef98da2fd8bb01_w750_h500.jpg"),
        name: "باذنجان محشي  ",
        view: true,
        time: " 50 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "50",
        components: '- الأرز المصريّ : كيل\nو- البصل : 3 حبات (مفروم)\n  - عصير الطماطم : 4 اكواب\n  - مرق دجاج : 4 اكواب\n  - الشبت : نصف كوب\n - بقدونس : نصف كوب\n  - كزبرة خضراء : نصف كوب\n - صلصة طماطم : ملعقة كبيرة\n  - الزيت : ملعقة كبيرة\n - القرفة : نصف ملعقة صغيرة\n - نعناع ناشف : ملعقة صغيرة\n - بهارات مشكلة : ملعقة كبيرة\n  - فلفل أسود : ملعقة \n - جوزة الطيب : ربع ملعقة صغيرة\n  - الشطة : نصف ملعقة صغيرة\n - ملح : حسب الرغبة',
        Step: "على نار متوسطة سخني الزيت ثم أضيفي البصل وقلبيه حتى يذبل ثم أضيفي صلصة الطماطم و3 أكواب من عصير الطماطم وقلبي ثم اتركيها حتى تغلي. أضيفي مكعب المرق وقلبي لمدة 5 دقائق وفي وعاء كبير ضعي الأرز والكزبرة والشبت والبقدونس وخليط البصل والطماطم والنعناع والقرفة والبهارات وجوزة الطيب والفلفل الأسود والملح والفلفل الحار وقلبي جيداً.\n  احشي الباذنجان بالأرز واتركي مقدار عقلة اصبع حتى تسمحي للأرز بالتمدد أثناء النضج وعلى نار متوسطة ضعي باقي عصير الطماطم والمرق واتركيه حتى يغلي.\n رصي الباذنجان في القدر ثم صبي المرق في داخل كل ثمرة باذنجان ثم صبي باقي المرق في قاع القدر حتى يصل إلى منتصف الباذنجان ثم غطي القدر واتركيه على نار متوسطة حتى يغلي المرق.\n أخفضي النار لتصبح هادئة واتركيه لمدة 60 دقيقة حتى ينضج وقدميه ساخناً.",
        video: "https://www.youtube.com/watch?v=QvLdDdt_XoI",
        categortType: 4,

      },
      {
        Image: require("../img/a55cbaa56ad2a42b19c3f0e50e065be5_w750_h500.jpg"),
        name: "أرز بالحمص",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '- الأرز : كوب ونص\nف- البصل : 1 حبة (متوسط الحجم / مفروم فرماً ناعماً)\n - حمص : كوب (حبوب)\n  - السمن البلدي : 2 ملعقة كبيرة\n - بهارات مشكلة : نصف ملعقة صغيرة\n - ملح : رشّة\n - فلفل أسود : رشّة\n',
        Step: "في قدر من الماء على نار متوسطة، ضعي حبوب الحمص حتى تُسلق وتنضج تماماً، ثمّ اغسليها وصفيها من الماء وضعيها جانباً.\n اغسلي الأرز بالماء، ثمّ اتركيه حتى ينقع لفترة من الوقت.\n في قدر غير لاصق ومتوسط الحجم وعلى نار متوسطة سخني السمن، ثم أضيفي البصل وشوحي حتى يذبل ويصبح ذهبي اللون.\n صفّي الأرز من الماء، وأضيفيه فوق البصل في القدر واتركيه حتى يتحمّر قليلاً.\n أضيفي حبوب الحمص مع كميّة البهارات والملح، واسكبي حوالي 2 كوب من الماء، ثم حركي جيداً واتركي المزيج حتى يغلي.\n غطي القدر عند الغليان، ثم خففي النار واتركيه حتى ينضج الأرز تماماً.\n اسكبي الأرز بالحمص في طبق التقديم وقدميه ساخناً.",
        video: "https://www.youtube.com/watch?v=OpEqt-mrcgI",
        categortType: 3,

      },
      {
        Image: require("../img/2b1b8ee85f95fcd65e75e2a1e2c91adc_w750_h500.jpg"),
        name: "دجاج بصوص الخردل",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '- صدر الدجاج : 4 صدو\n - المايونيز : 3 ملاعق كبيرة\n- الخردل : ثلث كوب\n - العسل : 3 ملاعق كبيرة\n - الصويا صوص : ملعقة كبيرة\n- عصير الليمون : ملعقة كبيرة',
        Step: "اخلطي الخردل، والعسل، وعصير الليمون، والصويا صوص، والمايونيز، في طبق.\n ارفعي ملعقتين كبيرتين من الصوص للتقديم.\n اخلطي باقي كمية الصوص بالدجاج في طبق وغطيه، واتركيه في الثلاجة ليلة كاملة.\n أخرجي الطبق من الثلاجة، وضعي الدجاج مع الصوص في صينية فرن، وأدخليها الفرن على درجة حرارة 165 مئوية لمدة 15 دقيقة أو حتى ينضج الدجاج.\n قدميه ساخناً ووزعي كمية الصلصة الإضافية فوقه.",
        video: "https://www.youtube.com/watch?v=dPMkgbc6akY",
        categortType: 1,

      },
      {
        Image: require("../img/9b3fbd09a97d3a465cfcaebe6c7d677c_w750_h500.jpg"),
        name: "مسقعة الباذنجان والبطاطس ",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '- للصلصة البيضاء - البشاميل :\n الزبدة : كوب\nب دقيق : 2 كوب حليب : 6 اكواب (ساخن)\n كريمة الطبخ : 4 اكواب\n - للتقديم :\n  فتات الخبز : نصف كوب\n  جبن البارميزان : 3 ملاعق كبيرة (مبشور)\n- لحم العجل : كيلو (مفروم)\n- القرفة : ملعقة صغيرة (مطحونة)\n- جوزة الطيب : ملعقة صغيرة (مطحونة)\n- زيت الزيتون : كوب\n- البصل الأحمر : 2 كوب (مفروم فرماً ناعماً)\n- الثوم : نصف كوب (مفروم)\n- البطاطس : 5 حبات (مقطّعة قطع كبيرة)\n- الباذنجان : 5 حبات (مقطع قطع كبيرة)\n- الفطر : 2 كوب (مفروم)\n- الكرفس : 2 كوب (مفروم فرماً ناعماً)\n- الكراث : 2 كوب (مفروم فرماً ناعماً)\n- إكليل الجبل : 3 ملاعق صغيرة (مفروم)\n- الزعتر : رشّة\n- أوراق الريحان : حفنة (طازجة)\n- عصير العنب الاحمر : كوب\n- معجون الطماطم : كوب\n - السكر البني : 2 ملعقة صغيرة\n - طماطم : 2 كوب (مقشرة ومفرومة فرماً ناعماً)\n - ملح : حسب الرغبة\n - فلفل أسود : حسب الرغبة',
        Step: "ضعي اللحم المفروم مع القرفة، وجوزة الطيب، إلى قدر به زيت على النار مع غطاء القدر، وبعد 15 دقيقة، ضعي فرم البصل مع التقليب حتى يكتسب لوناً ذهبيا\nً أضيفي الثوم، والبطاطس، والباذنجان، والفطر، والكرفس، والكراث، وإكليل الجبل، والزعتر، وأوراق الريحان، واطهي المكونات جيداً قبل إضافة عصير العنب الأحمر.\n عندما تتشرب المكونات عصير العنب، أضيفي معجون الطماطم، والسكر مع التحريك لـ 3 دقائق، ثم أضيفي الطماطم المقشرة، وتبهر بالملح وتطهى لمده 60 دقيقة. \n لإعداد الصلصة البيضاء (البشاميل): ذوبي الزبدة في قدر صغير على النار، وأضيفي الدقيق مع التحريك لـ 10 دقائق قبل صبّ الحليب الساخن تدريجياً، ودعي المكونات لـ 10 دقائق على نار هادئة. \n    للتقديم: اسكبي الصلصة البيضاء فوق القدر الذي يدخل إلى فرن ساخن وذلك لـ 15 دقيقة، ثم زيني القدر بالجبن، وفتات الخبز، وتدخل إلى الفرن مجدداً لدقائق قبل التقديم.",
        video: "https://www.youtube.com/watch?v=eABWp3GPIUE",
        categortType: 4,

      },
      {
        Image: require("../img/f3e6936fc09d00be1c90bec714625521_w750_h500.jpg"),
        name: "كفته داوود باشا",
        view: true,
        time: " 60 min",
        Elta7der: '20 min',
        Eltahy: "40 min",
        Elsouba: "60",
        components: '- مقادير الصلصة :\n البصل : 1 حبة (مفروم)\n الثوم : فصّان (مهروس)\n صلصة طماطم : 2 كوب\n معجون الطماطم : 2 ملعقة صغير\nة الزيت النباتي : 2 ملعقة كبيرة\n الماء : ربع كوب\n - لحم مفروم : 500 غراماً\n - البصل : 1 حبة (مفروم)\n - كزبرة خضراء : ربع كوب (مفرومة)\n - بقدونس : نصف كوب (مفروم)\n - الزيت النباتي : ربع كوب\n - فلفل رومي : 1 حبة (مفروم)\n  - الثوم : فصّان (مهروس)\n - فلفل أسود : نصف ملعقة صغيرة\n - كزبرة يابسة : ملعقة صغيرة\n - بهارات مشكلة : ملعقة صغيرة',
        Step: "في وعاء للخلط، ضعي اللحم، والكزبرة، والبصل، والبقدونس، والثوم، والفلفل الأسود، والبهارات، والفلفل الرومي، والكزبرة الجافة، اخلطي المكونات حتى تتداخل.\n حمّي الزيت في مقلاة على نار متوسطة، وشكلي كرات متساوية الحجم من خليط اللحم، وضعيه في المقلاة، وقلبي حتى يتغير لونها وتنضج، ثم ارفعيها من المقلاة وضعيها في طبق جانبي.\n في مقلاة على النار، سخني الزيت، ثم أضيفي البصل والثوم وقلبي حتى يذبلا.\n أضيفي معجون الطماطم، وصلصة الطماطم، والملح، والبهارات المشكلة، والماء وحركي المكونات حتى تتداخل.\n عند الغليان خففي النار، وأضيفي كرات اللحم، ثم غطي المقلاة، واطبخي المكونات حتى تنضج وتكثف الصلصة.\n يقدم ساخناً بجانب الأرز الأبيض.",
        video: "https://www.youtube.com/watch?v=hcRuAVoOIQI",
        categortType: 4,

      },
      {
        Image: require("../img/b370dcb6a455f9e136588beaec699d2d_w750_h500.jpg"),
        name: "محشي الكوسا والباذنجان ",
        view: true,
        time: " 65 min",
        Elta7der: '25 min',
        Eltahy: "40 min",
        Elsouba: "70",
        components: '- الباذنجان : نصف كيل\nو- الكوسا : نصف كيلو\n- الأرز : 2 كوب (مغسول ومصفى)\n- البصل : 1 حبة (مفروم)\n- بقدونس : نصف كوب (مفروم)\n- طماطم : 2 حبة (مقطعة)\n- الثوم : 3 فصوص\n- لحم مفروم : ربع كيلو\n- زيت الزيتون : نصف كوب\n- مرق دجاج : مكعب\n- نعناع ناشف : ملعقة صغيرة\n- ملح : حسب الرغبة\n- فلفل أسود : حسب الرغبة\n- البطاطس : 2 حبة (مقطعة شرائح)\n- ماء ساخن : حسب الحاجة',
        Step: "احفري الكوسا والباذنجان أزيلي اللبّ من الداخل، ثم اغسلي الخضار جيداً وصفيها.\nحضري وعاء، واخلطي اللحم المفروم، والطماطم، والبصل، والبقدونس، والأرز المغسول.\nأضيفي الملح، والفلفل الأسود حسب الرغبة، والثوم، والنعناع الجاف، وزيت الزيتون، وقلبي المكونات جيداً حتى تمتزج تماماً.\nاحشي الكوسا والباذنجان بالخليط دون ملئها.\nحضري قدر، وضعي به القليل من الزيت ويتم رص شرائح البطاطس به.\nضعي الكوسا والباذنجان فوق البطاطس، وأضيفي الماء المغلي مع مرق الدجاج والملح.\nضعي القدر على النار مع تغطيه، واتركيه حتى الغليان، ثم خففي النار، واتركيه حتى تنضج الخضار.\nقبل الإستواء ضعي الثوم المهروس مع ملعقة كبيرة نعناع جاف واتركيه لعشر دقائق إضافية.\n اسكبي المحشي في طبق التقديم وقدميه ساخناً.",
        video: "https://www.youtube.com/watch?v=5El4aaTrCVg",
        categortType: 4,

      },
      {
        Image: require("../img/7868aa162f2f871cdd7db810f98f8b5c_w750_h500.jpg"),
        name: "مقلوبة السمك",
        view: true,
        time: " 60 min",
        Elta7der: '15 min',
        Eltahy: "45 min",
        Elsouba: "30",
        components: '- سمك الفيليه : 2 كيل\nو مرق السمك : 2 مكعب\n البصل : 6 حبات (مقطع شرائح)\n السمنة : 2 ملعقة كبيرة\n بهار السمك : ملعقة كبيرة\n الكمون : ملعقة كبيرة\n الزيت : نصف لتر (لقلي السمك)',
        Step: "تبلي السمك بالبهارات واتركيه جانباً.\nانقعي الأرز لمدة 20 دقيقة ثم صفيه.\nفي قدر على النار، ضعي البصل واقليه بالسمنة، وضعي مكعبات مرق السمك، والبهارات، والأرز.\nصُبي الماء على الأرز واتركيه لينضج.\nاقلي السمك وضعيه فوق الأرز المفلفل، وتقدم المقلوبة مع السلطة بالطحينة.",
        video: "https://www.youtube.com/watch?v=atLWX35t51Q",
        categortType: 6,

      },
      {
        Image: require("../img/31b85a6c088484f1f33ed58316ded79f_w750_h500.jpg"),
        name: "الكباب المشوي",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '- زيت الزيتون : 3 ملاعق كبير\nة- خل العنب : 3 ملاعق كبيرة\n - الخردل : ملعقة كبيرة\n- لحم البتلو : 500 غراماً (لحم العجل / مقطع مكعبات)\n- صلصة الباربيكيو : ملعقة كبيرة (جاهزة)\n- إكليل الجبل : ملعقة صغيرة (روزماري / مفروم)\n- الفليفلة الحمراء : 2 حبة (متوسطة الحجم / منزوعة البذور ومُقطَّعة إلى مكعبات)\n',
        Step: " لإعداد التتبيلة: يُضاف زيت الزيتون والخل والخردل إلى قارورة صغيرة، وتُرجُّ هذه الأخيرة جيِّدًا، حتَّى تختلط المكوِّنات جيِّدًا.\n توزَّع مكعبات اللحم في طبق زجاج عميق، وتُملَّح وتُبهَّر حسب الرغبة، ثمَّ تُصبُّ التتبيلة عليها، كما يُضاف فرم إكليل الجبل، وصلصة الباربكيو. وتمرَّغ المكعبات بالصلصة جيِّدًا.\n  توزَّع مكعبات اللحم على الأشياش، بالتناوب مع الفليفلة، وتشوى حتَّى تنضج وتصبح بنيَّة اللون، وزهريَّة وطريَّة من الداخل.\n ستحتاجين إلى: أشياش الخشب، منقوعة بالماء.",
        video: "https://www.youtube.com/watch?v=rQD1DApqkE0",
        categortType: 5,

      },
      {
        Image: require("../img/31b5fb1d5b095a960dfbe7d2e31cd273_w750_h500.jpg"),
        name: "مكرونة بالتونة دايت",
        view: true,
        time: " 25 min",
        Elta7der: '5 min',
        Eltahy: "20 min",
        Elsouba: "20",
        components: '- معكرونة : 500 غراما\nً التونا : علبة (مصفاة من الزيت)\n طماطم : 400 غراماً (مقطعة)\n الفلفل الملوّن : 3 حبات\n كزبرة خضراء : ضمة\n الفلفل الحار : نصف ملعقة صغيرة\n الثوم : فصّان (مفروم)\n ملح : رشّة\n فلفل أسود : رشّة\n الزيتون : ربع كوب (منزوع النواة)\n زيت الزيتون : 2 ملعقة كبيرة\n البصل : 1 حبة (مفروم)',
        Step: "اسلقي المكرونة في ماء وملح وزيت لمدة 10 دقائق حتى تنضج، ثم صفيها واتركيها جانباً.\n سخني الزيت في مقلاة على النار، وشوحي البصل والثوم حتى يذبلا.\n أضيفي الفلفل الألوان، والطماطم، والكزبرة، والزيتون، والتونة.\n تبلي بالملح والفلفل الأسود، ثم حركي قليلاً.\n أضيفي المكرونة المسلوقة وقلبي جيداً، ثم ضعيها في طبق التقديم وقدميها ساخنة.",
        video: "https://www.youtube.com/watch?v=XXegVJTN1Qc",
        categortType: 2,

      },
      {
        Image: require("../img/969e8aab44a92214cae12916d30bbe4a_w750_h500.jpg"),
        name: "كاساديا الدجاج بالجبن الشيدر",
        view: true,
        time: " 30 min",
        Elta7der: '5 min',
        Eltahy: "25 min",
        Elsouba: "30",
        components: '- الزيت النباتي : ملعقتان كبيرتان ونص\nف- خبز التورتيلا : 4 أرغفة\n- الدجاج : 2 كوب (مسلوق ومفتت)\n- جبن الشيدر : 2 كوب (مبشور)',
        Step: "قطّعي خبز التورتيلا إلى أنصاف.\nوزعي كمية من جبن الشيدر، ثم الدجاج المفتت، ثم جبن الشيدر داخل نصف الخبز.\nأغلقي أنصاف الخبز على الحشوة بالنصف الفارغ من الخبز، واضغطي عليه قليلاً.\nكرري الخطوة السابقة حتى نفاذ الكمية.\nسخني الزيت في مقلاة على نار متوسطة، واقلي الخبز المحشي لدقيقتان حتى يذوب الجبن بداخله.\n قدمي كاساديا الدجاج بجبن الشيدر ساخناً.",
        video: "https://www.youtube.com/watch?v=HzWKH4FgPvM",
        categortType: 7,

      },
      {
        Image: require("../img/a0a8698daa960a40c15194a6a0b3ba7b_w750_h500.jpg"),
        name: "كريب شيش طاووق",
        view: true,
        time: " 60 min",
        Elta7der: '30 min',
        Eltahy: "30 min",
        Elsouba: "50",
        components: '- لتحضير الحشوة :\nصدر الدجاج : 500 غراماً (مقطع مكعبات)\nمعجون الطماطم : 2 ملعقة كبير\nةالخل الأبيض : ملعقة كبيرة\nملح : ملعقة صغيرة ونصف\nفلفل أسود : نصف ملعقة صغيرة\nالقرفة : ربع ملعقة صغيرة\nفلفل رومي : 1 حبة (مقطع مكعبات)\nالبصل : 1 حبة (مقطع شرائح)\nبهار دجاج : ملعقة صغيرة\n- لتحضير الكريب :\nحليب : كوب (سائل)\nالماء : كوب\nالبيض : 1 حبة\nملح : رشّة\nفلفل أسود : رشّة\n دقيق : كوب',
        Step: "لتحضير الحشوة: في وعاء، ضعي الدجاج، ومعجون الطماطم، والخلّ، والبهارات، وقلبي المكونات حتى تمتزج واتركيها منقوعة في التتبيلة.\nلتحضير العجينة: في وعاء الخلاط، ضعي الحليب، والماء، والدقيق، والبيض، والملح، والفلفل الأسود.\nاخلطي المكونات في الخلاط حتى تحصلي على عجينة متجانسة وسائلة.\nسخني مقلاة مدهونة بالزيت على نار متوسطة إلى هادئة، واسكبي مقدار مغرفة من العجينة.\nحركي المقلاة بشكل دائري لتشكيل العجينة واتركيها حتى تنضج وتتحمر ثم اقلبيها للجهة الأخرى.\nكرري العملية حتى نفاذ الكمية.\nفي مقلاة أخرى، حمّي ملعقتان من الزيت على نار متوسطة وضعي الشيش طاووق قلبيه حتى يتبدل لونه.\nأضيفي البصل وقلبيه مع الشيش طاووق حتى ينضج.\nأضيفي الفلفل وقلبيه مع باقي المكونات حتى يذبل.\nوزعي كمية من خليط الشيش طاووق على خبز الكريب وقدميه ساخناً.",
        video: "https://www.youtube.com/watch?v=Dd5qSRtd4x8",
        categortType: 7,

      },
      {
        Image: require("../img/4df924d6215941ec344097c77d8d409f_w750_h500.jpg"),
        name: "كبسة خضار سريعة",
        view: true,
        time: " 60 min",
        Elta7der: '15 min',
        Eltahy: "45 min",
        Elsouba: "30",
        components: '- أرز بسمتي : 2 كو\nب مرق دجاج : 4 اكواب\n ملح : ملعقة صغيرة وثلاثة أرباع الملعقة\n الفلفل الاحمر الحار : نصف ملعقة صغيرة\n بودرة الكاري : ملعقة صغيرة ونصف\n الكمون : ملعقة صغيرة ونصف\n الكركم : ملعقة صغيرة ونصف\n الثوم : نصف ملعقة صغيرة (مهروس)\n طماطم : 1 حبة (مفرومة فرماً ناعماً)\n البصل : 1 حبة (مفروم فرماً ناعماً)\n ورق غار : 2 ورقة\n لومي : 2 حبة (مجفف)\n الزعفران : ربع ملعقة صغيرة\n سمن : 3 ملاعق كبيرة',
        Step: "انقعي الأرز بالماء البارد لحوالي 35 دقيقة، ثم اغسليه جيداً حتى تتخلصي من أكبر كمية من النشا من الأرز.سخني السمن في قدر كبير الحجم على نار متوسّطة.\nأضيفي البصل وشوّحي مع السمن حتى يذبل.\nأضيفي الثوم والطماطم، ثم قلّبي لدقيقة.تبلي بجميع البهارات واللومي وورق الغار، ثم قلّبي الخليط لعدة دقائق.\nأضيفي الأرز والمرق، ثم خففي النار، واتركي القدر حتى ينضج الأرز.\nاسكبي كبسة الخضار في طبق التقديم وقدميها ساخنة.",
        video: "https://www.youtube.com/watch?v=PnoYKPnyxvc",
        categortType: 3,

      },
      {
        Image: require("../img/f213a26ce9152d184baeed39a4076fa2_w750_h500.jpg"),
        name: "روستو دجاج بالبرتقال",
        view: true,
        time: " 55 min",
        Elta7der: '10 min',
        Eltahy: "45 min",
        Elsouba: "60",
        components: '- الدجاج : دجاج\nة البرتقال : 1 حبة (مقطع)\n عصير البرتقال : كوب\n ورق غار : 2 ورقة\n البصل : 1 حبة (مفروم)\n برش البرتقال : ملعقة صغيرة\n زعتر مجفف : ربع ملعقة صغيرة\n الزيت النباتي : 2 ملعقة صغيرة\n الزبدة : 2 ملعقة صغيرة\n ملح : حسب الرغبة\n فلفل أسود : حسب الرغبة\n الثوم : فصّان\n صلصة طماطم : 2 ملعقة كبيرة',
        Step: "قطعي الدجاجة إلى نصفين طولياً.\nضعي الزيت في قدر على النار، واقلي الدجاج من جميع الجهات ثم ضعيه جانباً.\nفي القدر نفسه، حمري البصل المفروم مع الثوم حتى يذبل.\nأضيفي برش برتقال وعصيره، وصلصة الطماطم، وورق الغار، والزعتر الجاف، واتركي المقدار يغلي على النار لمدة 5 دقائق.\nأضيفي الدجاج وغطيه حتى ينضج، ثم قدميه وزينيه بقطع البرتقال.\n",
        video: "https://www.youtube.com/watch?v=jHBpvyElA4k",
        categortType: 1,

      },
      {
        Image: require("../img/202109041239143914.jpg"),
        name: "ارز معمر",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: 'يتم معايرة الأرز بنصف كمية البرا\nم لتر حلب\n كريمة لباني\nزبدة\n  قشطة\n ملح',
        Step: "يتم غسل الأرز جيداً قبل أن يصف\nى قومي بوضع كمية الأرز والتي تكون نصف حجم البرام في الطاجن\n يوضع عليه معلقة كبيرة من الزبدة البقري أو الفلاحي\n علبة كريمة لباني صغيرة للطبخ قومي بوضعها على الأرز\n يغطى تماماً بالحليب المغلي على أن يغمر الأرز به\n ثم يوضع عليه الملح فقط حسب الرغبة\n ملحوظة: ا يوضع عليه توابل لكي يظهر به طعم القشطة والزبدة في الطاجن فلا يتم وضع أي توابل غير الملح\n ثم توضع في الفرن على درجة حرارة متوسطة 180 درجة حتى يصل الأرز بأن يتشرب من الحليب تماماً توضع القشطة على وجه الطاجن\n يترك في الفرن حتى يحمر وجه برام الأرز المعمر ويكتمل نضوجه\n يمكن وضع قطع من الحمام مسلوق أو قطع من اللحم البتلو المسلوق أو كبد الدجاج مسلوقة أو صدور فراخ بقلب الطاجن\n يمكنك إضافة جوز الطيب حسب الرغبة",
        video: "https://www.youtube.com/watch?v=IHWqrDccHuA",
        categortType: 4,

      },
      {
        Image: require("../img/12b1ffc4d25e01c114fecc8f82d4693b_w750_h500.jpg"),
        name: "سلطة البطاطس المقلية بالخل والثوم",
        view: true,
        time: " 15 min",
        Elta7der: '5 min',
        Eltahy: "10 min",
        Elsouba: "20",
        components: '- للصوص :\nالطحينية : ربع كو\nبزبادي : 4 ملعقة صغيرة\n الثوم : فصّان (مهروس)\n عصير الليمون : نصف حبة\n الخل : ملعقة صغيرة\n الماء : 2 ملعقة كبيرة\n ملح : نصف ملعقة صغيرة\n- خس : كوب ونصف (مقطع)\n- البطاطس : 1 حبة (مقطعة مكعبات ومقلية)\n- طماطم : 1 حبة (مقطعة)',
        Step: "ضعي الخس المقطع، والبطاطس المقلية، والطماطم في طبق التقديم.\nاخلطي الزبادي مع الماء، والطحينية، وعصير الليمون، والخل، والملح، والثوم جيداً في وعاء صغير.\nوزعي المزيج فوق خليط السلطة وزيني بالبقدونس وقدميها.",
        video: "https://www.youtube.com/watch?v=YEmkiZPEKIM",
        categortType: 3,

      },
      {
        Image: require("../img/20211211164112024.jpg"),
        name: "بط مشوي بدبس الرمان",
        view: true,
        time: " 60 min",
        Elta7der: '10 min',
        Eltahy: "50 min",
        Elsouba: "60",
        components: 'بط\nهم. ص ملح وفلفل اسود\nبابريكا\nكركم\nكاري\nزنجبيل\nصوص حار\nم. ك دبس الرمان\nخل\n2 بصله\n1 فلفل رومي\n1 جزره كبيره\n2 طماطم\n1 مرقه ماجي فورى\nورق لورى وحبهان ومستكه\n1/2 كوب شوربة بط\nم. ص سكر\n1 مرقة دجاج',
        Step: "يغسل البط وينقع في خل وملح ثم نضع ماء يغلى وعند الغليان نضع ورق اللورى والحبهان والمستكه ونشطف البط ونفتحه فتحات بالعرض بالسكين لسهوله السوا ونسقطه في الماء.  \nنزيل الريم ثم نضع ملح وفلفل وماجى والسكر ونهدئ النار ونغطيه ونتركه حتى قرب السوا لمدة ساعة ونص ساعتين حسب حجم البطه.\nاضرب طماطم وبصلايه وبقية التوابل في الكبه حتى تمام التجانس و ننشل البطه من الشربه ونتبلها بالخلطه دى ونتركها ساعتين في التتبيله.\n نحضر صينيه نقطع فيها البصل والجزر والفلفل والطماطم دوائر ونضع ملح وفلفل اسود ونقلب ونضع البط فوقيها ثم نضع نص كوب الشوربه وندخلها الفرن مدة 15 : 20 دقيقه حتى يحمر الوجه. وبالف هنا وشفا",
        video: "https://www.youtube.com/watch?v=a1BVwmbtHkg",
        categortType: 4,

      },
      {
        Image: require("../img/104-233834-how-sambosk-works-with-cheese-2.png"),
        name: "سمبوسه بالجبنه",
        view: true,
        time: " 20 min",
        Elta7der: '10 min',
        Eltahy: "10 min",
        Elsouba: "50",
        components: '1/2 كيلو سمبوس\nهقطعتين جبنه قريش\n2 فلفل اخضر متقطع\n1 بصله متوسطه متقطعه\nرشة فلفل اسود\nرشة ملح\nرشة كمون\nرشة كزبره\nمعلقه صغيره زيت زيتون او نباتي',
        Step: "هنضيف كل المكونات ع الجبنه ونخلطهم كويس\nهنحشي السمبوسه ع شكل مثلثات\nونسخن الزيت ونحمرها فيها الي ان تأخذ اللون الذهبي",
        video: "https://www.youtube.com/watch?v=tYb2mKyU9kw",
        categortType: 4,

      },
      {
        Image: require("../img/downloadhamam.jpg"),
        name: "حمام محشى",
        view: true,
        time: " 70 min",
        Elta7der: '30 min',
        Eltahy: "40 min",
        Elsouba: "80",
        components: 'جوز حمام\nكوب ارز\nكبد الحمام\nبصل\nم ك ملح وفلفل\nم ك كمون\nم ك بهارات\nرشه نعناع ناشف',
        Step: "نقوم بتنضيف الحمام وغسله جيدا مع فصل جلد البطن عن اللحم حتى يسهل الحشو\nفى حله نضع معلقه كبيره سمنه ثم ننزل بكبد الحمام وبصله متقطعه صغير وملح وفلفل وكمون ونقلبهم شويه ثم ننزل بالارز المغسول ثم رشه النعناع ونضيف ماء مغلى نصف مقدار الارز لكى يستوي نصف سوا فقط ثم نتركه يبرد قليلا ثم نحشو به الحمام بين الجلد والبطن وايضا نحشو قليل من الارز فى داخل الحمام ثم نغلق الحمام (بتكتيف الارجل داخل بعض)\nيسلق فى ماء مغلى به بصله وشريحه جزر وملح وفلفل وحبهان وورق لوري واي مطيبات تفضلينها\n يترك لينضج ثم نخرجه ونحمره في سمنه او ندهنه من الخارج بالسمن وندخله الفرن تحت الشوايه ليحمر ثم يقدم بالف هنا ",
        video: "https://www.youtube.com/watch?v=psZA8rf00NI",
        categortType: 4,

      },
      {
        Image: require("../img/downloadl7maa.jpg"),
        name: "ورقة لحم بالخضروات",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '2 بطاطس كبيرة حلقا\nت2 بصل جوليان\n2 فلفل رومي حلقات\nقرن فلفل حامي\n2 جزر حلقات\n3 طماطم حلقات\nم صلصة\n5 فص ثوم حلقات\n3 م زيت\n2 مكعب زبدة\nم ص ملح\n1/2 م ص بهار لحم\n1/2 م ص فلفل اسود\n1/2 كيلو لحم بفتيك مدقوق',
        Step: "تتيل اللحم بملح وفلفل وبهار وتشوح في الزيت والزبدة\nندعك البصل والفلفل الحامي مع ملح وفلفل وبهار باليد\nتجهز الخضروات وتخلط جميعها\nنفرش ورقتين فويل عكس بعض في صينية وفوقها ورقتين زبدة عكس بعض ونضع جزء من اللحم ثم نص الخضار ثم نرص اللحم ثم باقي الخضار\nتغلق الورق جيداً عليها\nتدخل فرن مسخن اعلى حرارة ربع ساعة ثم نهدا النار ١٨٠ ساعة ثم تقلب وتشق على شكل زائد",
        video: "https://www.youtube.com/watch?v=n0LriJQbzok",
        categortType: 5,

      },
      {
        Image: require("../img/downloadsopet.jpg"),
        name: "سبيط مقلي",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "50",
        components: 'ك سبيط (حبار) مقط\nع5 فصوص ثوم\n2 قرن فلفل\nمعلقة ملح\nمعلقة شطة\nمعلقة كمون\nمعلقة كزبرة\n½كوبية دقيق\nمعلقة ثوم بودرة وبصل بودرة\nكوبية زيت\n2قرن فلفل حامي\nمعلقة خل وليمون',
        Step: "هنجيب الكبة نحط الثوم والتوابل والملح والثوم والبصل والفلفل\nوالليمون والخل ونضربهم\nبعد كدة نقطع السبيط قطع ونغسلة ونحطة في الخلطة ساعة\nبعد كدة نحطة في الدقيق\nونقلي السبيط والفلفل",
        video: "https://www.youtube.com/watch?v=vBsiEA0Cg24",
        categortType: 6,

      },
      {
        Image: require("../img/saidaya.jpg"),
        name: "رز صياديه",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '1/2 كيلو ر\nزبصل مفروم\nملح\nكمون\nمكعب مرقه دجاج',
        Step: "نقوم بتحمير البصل للون البنى\nثم نضع الرز عليه ونقلب ثم نضع الملح والكمون ومكعب المرقه ونقلب جيدا\nثم نضع المياه السخنه ونتركه على نار متوسطه ثم نهدى النار ونتركه للتسويه",
        video: "https://www.youtube.com/watch?v=I_mdyPAQW18",
        categortType: 4,

      },
      {
        Image: require("../img/20171120020043043.jpg"),
        name: "النجرسكو",
        view: true,
        time: " 80 min",
        Elta7der: '20 min',
        Eltahy: "60 min",
        Elsouba: "60",
        components: 'مكرونة شرايط مسلوقة.\n نصف كيلو صدور دجاج مقطعة ومسلوقة.\n مشروم طازج مقطع شرائح (اختياري).\n 1 ملعقة زيت.\n3 ملاعق كبيرة دقيق.\n 7 ملاعق كبيرة لبن بودرة خالي الدسم.\n 1 لتر مرقة منزوعة الدسم.\n  جبنة موزاريلا مبشورة للوجه.\n جوزة الطيب.\n بودرة ثوم أو بصل.\nملح وفلفل.',
        Step: "تسلق المكرونة في ماء مغلي مملح بدون إضافة زيت، ويراعى سلقها 3/4 سلقة.\n لعمل البشاميل نضع 1 ملعقة دقيق مع ملعقة الزبدة والزيت حتى يصل إلى اللون الذهبي الفاتح، ثم تضاف المرقة بالتدريج مع التقليب المستمر، ويذاب اللبن البودرة والدقيق مع باقي المرقة وتكون باردة.\n ويصب خليط المرقة على الدقيق والزبدة، مع التقليب المستمر، ثم يضاف الملح والفلفل وجوزة الطيب والثوم البودرة، ويترك على النار حتى القوام المظبوط.\n بعد ذلك يضاف المشروم للبشاميل ويقلب، ثم يضاف الدجاج ويقلب في الصوص، ويضاف قليل من الجبنة للصوص.\n بودرة الثوم رائحتها اقوى من بودرة البصل، لذا كميتها بتكون أقل ويمكن إضافة بصلة مبشورة ويتم تحميرها مع الحشوة، ولكن بيكون القوام مرملاً أكثر.\n لإنهاء وصفة النجرسكو اللايت، ندهن وعاء بايركس الفرن بالزيت، وتوضع المكرونة المسلوقة (ومقلبة في ملعقة زيت)، ثم تضاف الحشوة مع الصوص، ثم تضاف القليل من الجبنة الموزاريلا على الوجه. \nونضعها في الفرن على 200 درجة حتى تصل إلى اللون الذهبي.",
        video: "https://www.youtube.com/watch?v=DWBJcbSAf9Q",
        categortType: 2,

      },
      {
        Image: require("../img/images.jpg"),
        name: 'فتة باللحمة المفرومة',
        view: true,
        time: " 25 min",
        Elta7der: '5 min',
        Eltahy: "20 min",
        Elsouba: "30",
        components: 'لحمة مفرومة، بصل، طماطم، ثوم، فلفل أحمر، كمون، فلفل أسود، ملح',
        Step: "'يُقلى البصل والثوم في زيت حتى يذبلان ثم يُضاف إليهم اللحمة المفرومة ويُقلى الكل. تُضاف الطماطم المقطعة إلى الخليط ويُترك لمدة 5 دقائق حتى تنضج ثم يُتبل بالكمون والفلفل الأسود والملح.'",
        video: "https://www.youtube.com/watch?v=zhPV1SI7ukc",
        categortType: 4,

      },
      {
        Image: require("../img/15489737431619515555.jpg"),
        name: "كفتة",
        view: true,
        time: " 30 min",
        Elta7der: '10 min',
        Eltahy: "20 min",
        Elsouba: "50",
        components: 'لحمة مفرومة، بصل، ثوم، بقدونس، كمون، فلفل، ملح، طحين، زيت',
        Step: 'تُخلط اللحمة المفرومة مع البصل المفروم والثوم والبقدونس والكمون والفلفل والملح والطحين. تُشكل الخليط إلى كفتة وتُقلى في الزيت حتى تنضج.',
        video: "https://www.youtube.com/watch?v=0l9HiHwM5Vc",
        categortType: 4,

      },
      {
        Image: require("../img/download(1).jpg"),
        name: "طاجن مكرونة بالكبدة",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '½ ك كبدة مقطعة ومحمره\nمعلقة سمن\nةمعلقة ملح شطة بهارات\n بصلة مقطعة\n 2 قرن فلفل مقطع\n½ مكرونة مقطعة\n2 معلقة صلصة',
        Step: "هنجيب حلة ونحط السمنة ونحط البصل ونقلب\nبعد كدة نحط الصلصة والطماطم\nوالتوابل والبهارات ونسيبة تسبك\nهنجيب الطاجن ونحط الكبدة ونحط المكرونة ونحط الفلفل\nونحط التسبيك وندخلة الفرن",
        video: "https://www.youtube.com/watch?v=_Mn_V9atVCM",
        categortType: 2,

      }
      ,
      {
        Image: require("../img/kepdaaaa.jpg"),
        name: "كبده اسكندراني",
        view: true,
        time: " 30 min",
        Elta7der: '10 min',
        Eltahy: "20 min",
        Elsouba: "30",
        components: 'كبده بلد\nيثوم مفروم\nعصير ليمون\n2 معلقه خل\nملح وفلفل\nكمون\nشطه',
        Step: "حطيت كل التوابل مع بعض وسبتها لحد ما حضرت الكبده\nمقطعة الكبده وضيفتهم سبتهم حوالي ربع ساعة وفي طاسه تيفال فيها حوالي 2 ملعقة كبيره زيت سخن نزل بالكبده وسبتها على النار 10 دقائق ونزلت عليها بالفلفل الاخضر وقلبتها وقفلت النار",
        video: "https://www.youtube.com/watch?v=J84l8JxnTW0",
        categortType: 4,

      }
      ,
      {
        Image: require("../img/okra-1400x788.jpg"),
        name: "البامية",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "60",
        components: '2 ملعقة كبيرة زيت زيتو\nن1 حبة بصل مفرومة\n2 فص ثوم مهروس\n200 غرام بامية\nرشة ملح\nرشة فلفل حار\nرشة فلفل أسود\nرشة بابريكا\n1 ملعقة كبيرة معجون طماطم\n½ كوب ماء\n¼ كوب عصير ليمون حامض\nكزبرة خضراء، للزينة',
        Step: "سخني الزيت في قدر على نار متوسطة. أضيفي البصل وحمريه لمدة 10 دقائق حتى يصبح لونه ذهبياً.أضيفي الثوم وحمريه لمدة دقيقة ثم أضيفي البامية وحركيها باستمرار.\nامزجي معجون الطماطم مع نصف كوب ماء، وقلّبي المزيج جيداً.\nأضيفي الملح، الفلفل الحار، الفلفل والبابريكا إلى الصلصة وقلّبي المزيج.\nأضيفي مزيج الصلصة إلى القدر.\nغطّي القدر واتركيه على نار هادئة لمدة 30 دقيقة مع التقليب كل 5 دقائق",
        video: "https://www.youtube.com/watch?v=ls1nodywhuA",
        categortType: 4,

      }
      ,
      {
        Image: require("../img/kkkk.jpg"),
        name: "فطيرة الدجاج",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "70",
        components: 'زيت الزيتون للقل\nي1 بصل مقطع شرائح\n2 فص ثوم مفروم\n3 كوب صدر دجاج ، مطبوخ ومقطع شرائح\n1 كوب معجون طماطم\nملح حسب الذوق\nفلفل أسود حسب الذوق\nبقدونس مفروم حسب الذوق\n2 كوب حليب\n1 كوب زيت\n2 ملعقة كبيرة زبدة\n5 بيضات\n2 بطاطس مطهية، مهروسة\n2 كوب دقيق قمح\n1 ملعقة كبيرة بايكينج باودر\n1 كوب جبن كريمي برازيلي\n½ 1 كوب جبن موزاريلا',
        Step: "في مقلاة، حمري البصل والثوم، ثم أضيفي الدجاج واطهيه حتى يصبح ذهبي اللون.\nأضيفي معجون الطماطم ثم تبليه بالملح، الفلفل والبقدونس المفروم. اتركي المزيج جانباً.\nفي الخلاط، اخفقي الحليب مع الزيت، الزبدة، البيض والبطاطس المهروسة. انقلي الخليط إلى وعاء ثم أضيفي دقيق القمح والبايكينج باودر مع رشة من الملح.\nاسكبي نصف العجين في صحن فرن مدهون بالزبدة، ثم وزعي خليط الدجاج فوقه بالتساوي باستخدام ملعقة، ثم أضيفي الجبن الكريمي وجبن الموزاريلا.\nغطي الحشو بالعجين المتبقي ثم اخبزي الفطيرة في فرن مسخّن مسبقاً بدرجة حرارة 350 درجة فهرنهايت لمدة 30 دقيقة.",
        video: "https://www.youtube.com/watch?v=QptPLrcVXcM",
        categortType: 1,

      }
      ,
      {
        Image: require("../img/download(2).jpg"),
        name: " كفتة الارز",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '¾ كوب لحم عجل مفرو\nم¾ كوب أرز مطحون\n2 بندورة\n1 بصل\n2 بطاطس\n1 ملعقة كبيرة بقدونس\n2 ملعقة كبيرة رب بندورة (معجون طماطم)\n¾ كوب زيت نباتي\n1 ملعقة صغيرة قرفة\n1 ملعقة صغيرة بهار حلو\n1 ملعقة صغيرة جوزة الطيب\n1 ملعقة صغيرة كمون\n1 ملعقة صغيرة ملح\n6 فص ثوم\n1 مكعب مرق دجاج\n½1 كوب ماء',
        Step: "قطّعي المكونات.ضعي ½ كمية كل من (البصل، البقدونس، الثوم) وعليهم أضيفي الطحين، التوابل ثم قومي بالخلط.\nشكّلي اللحم على شكل أصابع وضعيهم بصحن مدهون بالزيت.\nفي مقلاة سخّني الزيت ثم قلي أصابع الكفتة من كل الجهات.\nارفعيهم من على النار.\nفي وعاء سخّني ملعقتين زيت ثم أضيفي باقي البصل والثوم وقومي بالتقليب.\nأضيفي الطماطم وبعد أن تنهرس الطماطم أضيفي مكعبات البطاطس ومعجون الطماطم مع الماء، مرق الدجاج والكفتة اتركيهم حتى تنضج البطاطس بالكامل.\nارفعي الوعاء من النار وزيّني الصحن بالبقدونس عند التقديم",
        video: "https://www.youtube.com/watch?v=t2xL-EKSiQU",
        categortType: 4,

      }
      ,
      {
        Image: require("../img/0kabsayemen.jpg"),
        name: "الكبسة اليمني",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "60",
        components: '1 كيلو غرام لحم مع العظا\nم4 كوب أرز بسمتي، منقوع بالماء لمدة ساعة قبل الطهي\n1 معلقة كبيرة خل\n1 معلقة كبيرة بهارات مشكلة\n1 كوب ماء\n1 ملعقة كبيرة ملح\n4 حبات هيل\n4 عود قرفة\n4 كبش قرنفل\n3 حبة بصل كبيرة، مقطعة حلقات\n200 غرام زبادي\n1 ملعقة صغيرة زعفران، منقوع فى قليل من الماء\n1 معلقة كبيرة زنجبيل',
        Step: "فى قدر الضغط على النار، أضيفي جميع المكونات عدا الأرز و الزعفران.\nقلبي المزيج ثم غطى القدر واتركيه على النار حتى ينضج اللحم تماماً.\nفى هذه الأثناء، اسلقى الارز حتى يصبح نصف ناضجاً.\nبعد نضج اللحم، انقلي محتويات قدر الضغط إلى قدر عادى عميق.\nأضيفى الأرز فوق خليط اللحم، ثم سخني القدر على النار.\nأضيفى الزعفران على الوجه، ثم غطي القدر واتركيه على النار، حتى ينضج الأرز تماماً.\nقدمي الكبسة ساخنة",
        video: "https://www.youtube.com/watch?v=k0GCjA_TohI",
        categortType: 3,

      }
      ,
      {
        Image: require("../img/0Hawawshi.jpg"),
        name: "الحواوشي",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '½ كيلو لحم مفرو\nم250 غ دهن خروف\nبصلة وسط مفرومة ناعم\n2 فلفل اخضر\nرشة ملح\nرشة كمون\nرشة فلفل اسود\n2 حبهان\n¼ كوب زيت\n2 فلفل اخضر\n5 أرغفة خبز',
        Step: "افرمي البصل ناعما جدا و اتركيه جانبا فى وعاء عميق \nقطعى الفلفل قصطع صغيرة و ضيفيه بالوعاء على البصل\nضيفى الملح و الكمون و الحبهان و الفلفل \n ضيفى اللحم المفروم و قومى برش قطعة من دهن الخروف على الخليط\n قومى بالتقليب و الخلط جيدا لتمتزج كل المكونات معا \nدخلى الوعاء الثلاجة لمدة ساعة \nاحضرى الخبز بعد مرور الساعة و اصنعى فى كل خبز من الجانب فتحة صغيرة ادخلى من خلالها الحشو و افرديه داخل الرغيف\nكررى الامر مع كل الارغفة الحشو .\nادهنى الخبز من اعلى و من اسفل بالزيت \nسخنى الفرن جيدا على نار متوسطة\nرصى الخبز فى صينية و ادخليها الفرن على الشبكة و اتركيه حتى تمام النضج (من ربع لتلت ساعة) .\nيقدم الحواوشي ساخنا ",
        video: "https://www.youtube.com/watch?v=iT0BPY3H-A0",
        categortType: 1,

      }
      ,
      {
        Image: require("../img/3eeegga.jpg"),
        name: "عجة البيض",
        view: true,
        time: " 20 min",
        Elta7der: '5 min',
        Eltahy: "15 min",
        Elsouba: "20",
        components: '4 بيضا\nترشة ملح\nرشة بقدونس5 ملعقة كبيرة زيت أو زبدة\n1 مكعب مرق دجاج\n1 ملعقة صغيرة فلفل أسود\nرشة نعناع\n¼ كوب بصل أخضر مفروم فرماً ناعماً\n2 حبة فلفل حلو مفرومة فرماً ناعماً',
        Step: "فى مقلاة غير لاصقة على النار، ذوبى الزبدة ثم أضيفى الخضار بعد تقطيعه ومكعب مرق الدجاج، قلبي المزيج.\nأضيفي الفلفل الاسود وقومي بتغطية المقلاة، استمري في الطهي على نار هادئة لمدة 5-10 دقائق مع التحريك من حين لآخر حتى تنضج الخضروات على البخار.",
        video: "https://www.youtube.com/watch?v=rPQN7xjy7Yw",
        categortType: 4,

      }
      ,
      {
        Image: require("../img/download(3).jpg"),
        name: "فطيرة مشلتت",
        view: true,
        time: " 50 min",
        Elta7der: '30 min',
        Eltahy: "20 min",
        Elsouba: "70",
        components: '1 كيلو دقي\nق1 كوب سكر\n1 كوب ماء\n½ كيلو زبدة\n1 ملعقة صغيرة بايكينج باودر',
        Step: "احضري وعاء وضعي السكر، الدقيق معاً.قطّعي الزبدة قطع صغيرة واضيفيها إلى خليط الدقيق واعجنيهم بأطراف أصابعك حتى تتكون عجينة يابسة.\nضعي العجينة في مكان مرشوش بالدقيق وافرديها بالنشابة حتى تصبح بعرض ½ سم، رشّيها بالماء بين الحين والآخر حتى لا تلتصق بالسطح.\nقطّعي العجينة لعدة قطع متساوية، افردي كل قطعة حتى تصبح رقيقة جداً.\nكرّري العملية حتى نفاذ القطع.\nاحضري صينية دائرية مدهونة بالزبدة وضعي قطعة من العجين المفرود في الصينية ثم ادهنيها بالزبدة ثم ضعي قطعة اخرى وادهنيها بالزبدة، وهكذا حتى تنتهي الكمية.\nاخبزيها في الفرن على درجة حرارة 180 درجة حتى يحمر ثم قدميه ساخناً.",
        video: "https://www.youtube.com/watch?v=a4sBaw0Xrbo",
        categortType: 7,

      }
      ,
      {
        Image: require("../img/kapapshamii.jpg"),
        name: "كباب شامي",
        view: true,
        time: " 45 min",
        Elta7der: '25 min',
        Eltahy: "20 min",
        Elsouba: "30",
        components: 'حبة بصل مبروش\nة300 غ لحمة مفرومة\n½ كوب كزبرة\n½ ملعقة صغيرة بهار كاري\n½ ملعقة صغيرة قرفة\nبيضة\n½ كوب طحين\nبهار أسود حسب الرغبة\nملح حسب الرغبة\nزيت نباتي\n⅔ كوب عصير ليمون حامض\n2 فص ثوم',
        Step: "1.في صحن ضعي كل المقادير (ماعدا الزيت، الثوم، وعصير الليمون) وقومي بالخلط.\n2.شكّلي الخليط كما بالفيديو وضعيهم بصحن.\n3.أدخلي الصحن الثلاجة لمدة 20 دقيقة.\n4.في مقلاة على النار سخّني الزيت ثم قلّي الكباب.\n5.في مقلاة أخرى ضعي عصير الليمون الحامض والثوم وقومي التقليب.\n6.أضيفي الكباب بالمقلاة وقومي بالتحريك.",
        video: "https://www.youtube.com/watch?v=pUadgLI9tb0",
        categortType: 5,

      }
      ,
      {
        Image: require("../img/0Garlic.lemon.steak.jpg"),
        name: " اللحم بالثوم والليمون",
        view: true,
        time: " 70 min",
        Elta7der: '30 min',
        Eltahy: "40 min",
        Elsouba: "70",
        components: '400 غ لحم مقط\nع½ ملعقة صغيرة بهار أسود\n½ ملعقة صغيرة زنجبيل\n½ ملعقة صغيرة بودرة ثوم\n½ ملعقة صغيرة بهار تشيلي\nرشة ملح\nملعقة كبيرة زيت زيتون\n3 ملاعق كبيرة طحين\n2 فص ثوم\nملعقة كبيرة خل التفاح\nكوب مرق اللحم\n3 ملاعق كبيرة عصير ليمون حامض\n3 ملاعق كبيرة بقدونس\nحبة بصل مقطعة',
        Step: "1.ضعي اللحم بصحن غويط.\n2.تبّليه بالبهار الأسود، بهار تشيلي، زنجبيل، بودرة الثوم، الملح، وزيت الزيتون ثم قومي بالتقليب.\n3.أضيفي الطحين، وقومي بإعادة التقليب.\n4.في مقلاة على النار ضعي زيت الزيتون.\n5.أضيفي اللحم وقومي بالتقليب حتى يتغير لونه.\n6.أضيفي الثوم وقومي بالتحريك.\n7.أضيفي خل التفاح، مرق اللحم، عصير الليمون الحامض واستمري بالتحريك.\n8.أضيفي البقدونس وقومي بالتقليب.\n9.ارفعي المقلاة من على النار بعد تمام نضج اللحم.\n10.في مقلاة أخرى على النار سخّني الزيت ثم ضعي البصل وقومي بالتقليب حتى يتغير لونه.\n11.زيّني وجه اللحم بشرائح البصل التي حضرتيها.\n12.قدميها ساخنة.",
        video: "https://www.youtube.com/watch?v=EFu7QZG-luI",
        categortType: 5,

      }
      ,
      {
        Image: require("../img/maxresdefault-1-22.jpg"),
        name: "كبة اللحم بالبرغل",
        view: true,
        time: " 80 min",
        Elta7der: '30 min',
        Eltahy: "50 min",
        Elsouba: "70",
        components: '1 كيلو لحم مفرو\nم1 بصلة مفرومة\n1 ملعقة بهارات\n1 ملعقة ملح\n1 ملعقة فلفل\n2 كوب برغل ناعم\n1 ملعقة كمون\n2 ملعقة معجون فلفل أحمر\n2 ملعقة صنوبر مطحون\nزيت للقلي',
        Step: "احضري وعاء واخلطي البرغل مع اللحم، الملح، الفلفل، البهارات، البصل، الكمون، الصنوبر ومعجون الفلفل الأحمر.\nشكّلي الخليط على شكل كرات ثم قلّيها في الزيت حتى تصبح بنية اللون.\nقدميها ساخنة.",
        video: "https://www.youtube.com/watch?v=gZx3iqpAbN8",
        categortType: 5,

      }
      
      // {
      //   Image: require("../img/"),
      //   name: "",
      //   view: true,
      //   time: " 40 min",
      //   Elta7der: '10 min',
      //   Eltahy: "30 min",
      //   Elsouba: "30",
      //   components: '',
      //   Step: "",
      //   video: "",
      //   categortType: 1,

      // }
    ])

  const [Category, SetCategory] = useState(
    [
      {
        id: 1,
        name: "الدجاج",
        img: require("../img/pngwing.png"),//حط صور صح
        choose: false,

      }
      ,
      {
        id: 2,
        name: "مكرونات",
        img: require("../img/Pasta-PNG-File-Download-Free.png"),
        choose: false,


      }
      ,
      {
        id: 3,
        name: "اطباق عربيه",
        img: require("../img/catarab.png"),
        choose: false,


      }
      ,
      {
        id: 4,
        name: "اطباق مصريه",
        img: require("../img/catEgy.png"),
        choose: false,


      }
      ,
      {
        id: 5,
        name: "لحوم",
        img: require("../img/kindpng_4344308.png"),
        choose: false,
      }
      ,
      {
        id: 6,
        name: "أسماك",
        img: require("../img/pngwingfish.png"),
        choose: false,
      },
      {
        id: 7,
        name: "ٌفطائر ومعجنات",
        img: require("../img/pizzaa.png"),
        choose: false,
      }
    ]
  )
  const [IconSearch, setIconSearch] = useState(true)
  const [search, setsearch] = useState("")




  const ref = React.useRef(null)
  const [animationDisplay, setanimationDisplay] = useState(false)

  const makesearch = (searchText) => {
    let list = Food
    let count = 0

    for (let i = 0; i < list.length; i++) {
      if (((list[i].name).toUpperCase()).includes(searchText.toUpperCase())) {
        list[i].view = true
      }
      else {
        list[i].view = false
        count++

      }
    }
    if (count == list.length) {
      setanimationDisplay(true)
    }

    // 
    if (count != list.length) {
      setanimationDisplay(false)

    }
    setFood(list)
    count = 0
  }


  const [CategoryReturn, setCategoryReturn] = useState([])
  const [showView, setshowView] = useState(true)
  const [indexName, setindexName] = useState()

  const chooseCategory = (index) => {
    let list = Category
    let arr = Food
    if (list[index].choose == true) {
      setshowView(true)
      list[index].choose = false

    }
    else {

      for (let i = 0; i < list.length; i++) {
        list[i].choose = false
      }
      list[index].choose = true
      setshowView(false)
      var ret = []
      for (let i = 0; i < arr.length; i++) {
        if (list[index].id == arr[i].categortType) {
          //  let newObj={
          //   Image: arr[i].Image,
          //   name: arr[i].name,
          //   view: arr[i].view,
          //   time: arr[i].time,
          //   Elta7der: arr[i].Elta7der,
          //   Eltahy: arr[i].Eltahy,
          //   Elsouba: arr[i].Elsouba,
          //   components: arr[i].components,
          //   Step: arr[i].Step,

          //   }
          //   ret.push(newObj)
          ret.push(arr[i])
        }

      }
      // console.log(ret)
      setCategoryReturn(ret)
      // ret = []
    }
    setCategoryReturn(ret)
    SetCategory(list)
    setindexName(index)

  }

  const navigation = useNavigation();

  return (
    <>
      <View style={{ backgroundColor: COLORS.pramary, flex: 1 }}>
        <ScrollView>
          <View style={styles.Header}>
            <View>
              <View></View>
              {IconSearch ? (
                <>
                  <Animatable.View
                    animation='slideInLeft' >
                    <TouchableOpacity
                      onPress={() => {

                        setIconSearch(false);
                      }}>
                      <Ionicons name='ios-search-circle' size={60} color={COLORS.orange} />
                    </TouchableOpacity>

                  </Animatable.View>
                </>
              ) : (
                <Animatable.View style={styles.SearchTextView}
                  animation='flipInY' >
                  <TextInput style={styles.SearchTextInput}
                    placeholder={'البحث عن الأكلات...'}
                    placeholderTextColor={COLORS.grayFont}
                    onChangeText={(value) => {
                      makesearch(value)

                      setsearch(value)
                    }}


                    value={search} />
                  <TouchableOpacity onPress={() => {
                    setIconSearch(true);
                  }}>

                    <Ionicons name='search' size={ICONSSIZE.xlIcon} color={COLORS.pramary} />
                  </TouchableOpacity>

                </Animatable.View>
              )}
            </View>

            <View style={styles.category_View}>
              <ScrollView horizontal>
                {Category.map((Category, index) =>
                  <TouchableOpacity style={Category.choose ? styles.category_chosen_Box : styles.category_Box}
                    onPress={() =>
                      chooseCategory(index)

                    }
                  >
                    <Image source={Category.img} style={{ width: width / 5, height: height / 12, resizeMode: "contain" }} />
                  </TouchableOpacity>
                )}
              </ScrollView>
            </View>
            {showView ? (
              <View style={styles.food_View}>
                <View style={styles.Headerstarred}>
                  <Text style={styles.textHeaderstarred}>
                    الوصفات
                  </Text>
                  {/* <Text style={styles.textHeaderstarred2}>
رؤية الكل
</Text> */}
                </View>
                {animationDisplay ?
                  (
                    <>
                      <View style={{ alignItems: "center", justifyContent: "center", alignSelf: "center", width: width, height: height / 1.8 }}>
                        <LottieView
                          ref={this.ref}
                          source={require("../lottie/search_empty.json")}
                          loop={true}
                          autoPlay={true}
                          speed={1.5}
                        // style={{ alignSelf: "center" }}
                        />
                      </View>
                    </>
                  ) : (
                    <>
                      {Food.map((item, index) =>
                        item.view ? (
                          <View style={styles.meal_View}>
                            <Image source={item.Image} style={styles.meal_image}
                              resizeMode={"cover"} />
                            <View style={{ width: width / 2.4, height: height / 12, alignItems: "center", justifyContent: "center" }}>
                              <Text style={styles.meal_name}>
                                {item.name}
                              </Text>
                            </View>
                            <View style={styles.view_time}>
                              <Text style={styles.text_time}>
                                {item.time}
                              </Text>
                              <Ionicons name='md-time' style={{ alignSelf: "center" }} size={ICONSSIZE.smIcon} color={COLORS.ButtonWhite} />
                            </View>
                            <View style={styles.option_view}>
                              <TouchableOpacity
                                onPress={() => {
                                  navigation.navigate("Photo_page", {
                                    name: item
                                  })
                                }
                                }
                                style={styles.button_option}>
                                <Text style={styles.button_text}>
                                  الطريقة
                                </Text>
                              </TouchableOpacity>
                              <TouchableOpacity onPress={() => {
                                navigation.navigate("WbeView", {
                                  name: item
                                })
                              }
                              }
                                style={styles.button_option}>
                                <Text style={styles.button_text}>
                                  الفيديو
                                </Text>
                              </TouchableOpacity>

                            </View>


                          </View>

                        ) : (
                          null
                        )



                      )}
                    </>
                  )}



              </View>
            ) : (
              <View style={styles.food_View}>
                <View style={styles.Headerstarred}>
                  <Text style={styles.textHeaderstarred}>
                    {Category[indexName].name}
                  </Text>
                  {/* <Text style={styles.textHeaderstarred2}>
                  رؤية الكل
                </Text> */}
                </View>
                {CategoryReturn.map((items, index) =>
                  <View style={styles.meal_View}>
                    <Image source={items.Image} style={styles.meal_image}
                      resizeMode={"cover"} />
                    <View style={{ width: width / 2.4, height: height / 12, alignItems: "center", justifyContent: "center" }}>
                      <Text style={styles.meal_name}>
                        {items.name}
                      </Text>
                    </View>
                    <View style={styles.view_time}>
                      <Text style={styles.text_time}>
                        {items.time}
                      </Text>
                      <Ionicons name='md-time' style={{ alignSelf: "center" }} size={ICONSSIZE.smIcon} color={COLORS.ButtonWhite} />
                    </View>
                    <View style={styles.option_view}>
                      <TouchableOpacity
                        onPress={() => {
                          navigation.navigate("Photo_page", {
                            name: items
                          })
                        }
                        }
                        style={styles.button_option}>
                        <Text style={styles.button_text}>
                          الطريقة
                        </Text>
                      </TouchableOpacity>
                      <TouchableOpacity onPress={() => {
                        navigation.navigate("WbeView", {
                          name: items
                        })
                      }
                      } style={styles.button_option}>
                        <Text style={styles.button_text}>
                          الفيديو
                        </Text>
                      </TouchableOpacity>

                    </View>


                  </View>





                )}
              </View>
            )}

          </View>
          <View style={{ height: 55 }}></View>
        </ScrollView>
      </View>


    </>
  )

}


const styles = StyleSheet.create({
  Header: {
    backgroundColor: COLORS.pramary,
    alignItems: "center",
    flex: 1,

  },

  SearchTextView: {
    backgroundColor: COLORS.white,
    width: width / 1.1,
    // height: height / 15,
    alignItems: "center",
    justifyContent: "center",
    borderRadius: RADIUS.smRadius,
    marginVertical: MARGIN.xxsMargin,

    // borderWidth: 1,
    // borderColor: COLORS.orange,
    // paddingHorizontal: PADDING.xsPadding,
    // fontSize: FONTS.h,
    flexDirection: "row"

  },
  SearchTextInput: {
    // backgroundColor: COLORS.white,
    width: width / 1.4,
    // height: height / 17,
    alignItems: "center",
    alignSelf: "center",
    // backgroundColor:COLORS.black,
    color: COLORS.black,
    justifyContent: "flex-end",
    fontFamily: "Generator Black",
    // borderRadius: RADIUS.lgRadius,
    // borderWidth: 2,
    // borderColor: COLORS.orange,
    paddingHorizontal: PADDING.smPadding,
    fontSize: FONTS.h4
    // marginVertical: MARGIN.xsMargin

  },
  category_View: {
    height: height / 10,
    // width: width / 2,
    alignItems: "center",
    alignSelf: "flex-start",
    // backgroundColor:"#000",
    flexDirection: "row",
    marginTop: MARGIN.xxsMargin
  },
  category_Box: {
    width: width / 4.5,
    height: height / 11,
    padding: PADDING.xsPadding,
    alignItems: "center",
    justifyContent: "center",
    backgroundColor: COLORS.pramary50,
    marginLeft: 5,
    borderRadius: RADIUS.xsRadius
  },
  category_chosen_Box: {
    width: width / 4.5,
    height: height / 11,
    padding: PADDING.xsPadding,
    alignItems: "center",
    justifyContent: "center",
    backgroundColor: COLORS.warning,
    marginLeft: 5,
    borderRadius: RADIUS.xsRadius
  }
  ,
  food_View: {
    width: width,
    backgroundColor: COLORS.pramary,
    flexDirection: "row",
    flexWrap: "wrap",
    padding: PADDING.xsPadding,
    alignItems: "center",
    justifyContent: "space-around",
    marginTop: MARGIN.xxsMargin
  }
  ,
  Headerstarred: {
    width: width / 1.05,
    flexDirection: "row",
    justifyContent: "space-between",
    alignItems: "center",
    alignSelf: "center"
  },
  textHeaderstarred: {
    fontSize: FONTS.h1,
    color: COLORS.ButtonWhite,
    // fontWeight: "bold",
    fontFamily: "Generator Black"
  },
  textHeaderstarred2: {
    fontSize: FONTS.h5,
    color: COLORS.gray,
    // fontWeight: "bold",
    fontFamily: "Generator Black"
  },
  meal_View: {
    width: width / 2.1,
    // height:height/2.5,
    alignItems: "center",
    marginVertical: MARGIN.xxsMargin,
    padding: PADDING.lgPadding,
    borderRadius: RADIUS.xxsRadius,
    backgroundColor: COLORS.pramary50
  },
  meal_image: {
    width: width / 2.4,
    height: height / 5,
    borderRadius: RADIUS.xxsRadius,
  },
  meal_name: {
    fontSize: FONTS.h4,
    color: COLORS.white,
    fontFamily: "Generator Black",
    textAlign: "left"
  }
  ,
  view_time: {
    width: width / 2.4,
    alignItems: "center",
    flexDirection: "row",
  },
  text_time: {
    fontSize: FONTS.h4,
    color: COLORS.white,
    fontFamily: "Generator Black",
    alignSelf: "center",
    marginHorizontal: 2
  }
  ,
  option_view: {
    width: width / 2.4,
    alignItems: "center",
    justifyContent: "space-around",
    flexDirection: "row",

  },
  button_option: {
    width: width / 6,
    backgroundColor: COLORS.orange,
    borderRadius: RADIUS.smRadius,
    alignItems: "center",
    justifyContent: "center",
  },
  button_text: {
    fontSize: FONTS.h5,
    color: COLORS.white,
    fontFamily: "Generator Black",
    alignSelf: "center",
    marginHorizontal: 2
  }
});
