import React, { useState } from 'react';
import {
  View,
  Text,
  TouchableOpacity,
  Dimensions,
  StyleSheet,
  TextInput,
  ScrollView,
  Image
} from 'react-native';
import { useNavigation, NavigationContainer } from '@react-navigation/native';
import { createNativeStackNavigator } from '@react-navigation/native-stack';
import { COLORS, PADDING, MARGIN, RADIUS, FONTS, ICONSSIZE } from '../constants/Constants'
import Ionicons from 'react-native-vector-icons/Ionicons'
import * as Animatable from 'react-native-animatable';
const { width, height } = Dimensions.get('window');
import LottieView from 'lottie-react-native';


export default function FoodCommon() {
  const [Food, setFood] = useState(
    [

      {
        Image: require("../img/riseandche.jpg"),
        name: "أرز مقلي بالدجاج",
        view: true,
        time: "25 min",
        Elta7der: '10 min',
        Eltahy: "15 min",
        Elsouba: "10",
        components: "1 صدر دجاج\n½ بصله\nثوم كامله\nجزر\nبصله اخضر\nرز مصري\n2 بيضة",
        Step: "اطبخ في جهاز طهي رز ١٥ دقاق على مع زيت ملح\nبعد زيت و دجاج احط مع بهارات الثوم و بهارات مشكلا و ملح و صلصة صويا حلو\nاقطع الثوم و بصله و بصله أخضر و جزر\nاقلي بصل و الجزر و بيضة مع زيت و قليل صلصة صويا حلو\nبعد احط دجاج مع البصله الخضر و ثوم\nواحط كل حاجه علي بعضها",
        categortType: 1,
        video: "https://www.youtube.com/watch?v=qZFWEYXOV28"

    },
    {
        Image: require("../img/dgagAndKary.jpg"),
        name: "دجاج بالكاري",
        view: true,
        time: "35 min",
        Elta7der: '10 min',
        Eltahy: "25 min",
        Elsouba: "15",
        components: " كيلو من قطع الدجاج\nملح وفلفل أسود\n٢ بصلة\n٤ فصوص ثوم\nقطعة جنزبيل صغيرة\nنصف كوب صلصة طماطم\n٢ ل ٣ ملعقة صغيرة من بودرة الكاري\nكوب من الكريمة\nملعقة صغيرة سكر و ملعقة كبيرة خل",
        Step: "نحمص المكونات على نهار هاديه \nماعدا الدجاج\nنحط المكونات بالخلاط مع الكريمه ونخفقهم لحد ما تنطحن جميع المكونات جيدا\nبنفس المقلاة نقطع الدجاج ونشوحه و نحط فوقه الصوص و نخليه يتسبك معاه لحد ما تنجانس النكهات ويستوي الدجاج\nنرش فوقه كزبره او بقدونس وناكله مع رز او خبز ",
        categortType: 4,
        video: "https://www.youtube.com/watch?v=88rOVd-Aipk&t=13s"

    },
    {
        Image: require("../img/shesh.jpg"),
        name: "شيش طاوق",
        view: true,
        time: "45 min",
        Elta7der: '10 min',
        Eltahy: "35 min",
        Elsouba: "15",
        components: "5 ملاعق كبيره زبادي\n1 معلقه كبيره صلصه\n1 ملعقه صغيره بهارات مشكله\n1 معلقه كبيره ثوم مهروس\n1 ملعقه صغيره فلفل اسود\n1 ملعقه صغيره ملح\nحبتين ليمون\nبصل مقطع مربعات\nصدور دجاج حسب الرغبه مقطعه مربعات",
        Step: "نحط كل المقادير مع الدجاج وخليها ١٢ ساعه في الثلاجة وبعدين نجيب الصيخ ونحط قطعه دجاج وبعدين نحط بصل ونسوي نفس الطريقه الين تخلص كل الكميه وبعدين ندخلها الفرن من فوق وتحت على حرارة ١٧٠ الين تحمر وتستوي تاخذ نص ساعه",
        video: "https://www.youtube.com/watch?v=fXYtJjiPAOU",
        categortType: 1,


    }
    ,
    {
        Image: require("../img/maklopa.jpg"),
        name: "المقلوبة",
        view: true,
        time: "60 min",
        Elta7der: '15 min',
        Eltahy: "40 min",
        Elsouba: "30",
        components: "2 حبة بصل مفرومة\n3 حبات طماطم مفرومة\n1 حبة فلفل أخضر مفروم\n1 كوب أرز\nملح وفلفل أسود حسب الذوق\n2 ملعقة كبيرة زيت زيتون",
        Step: "يسخن الزيت في مقلاة كبيرة ويضاف البصل ويقلب حتى يصبح شفافا.\nيضاف الطماطم والفلفل الأخضر ويقلب لبضع دقائق.\nيضاف الأرز ويقلب جيدا حتى يتغطى بالصلصة ويتماسك.\nيضاف الماء ويترك ليغلي \nثم يخفض الحرارة ويترك ليطهو لمدة 20-25 دقيقة حتى يصبح الأرز مطهوا.\nيقدم المقلوبة ساخنة.",
        video: "https://www.youtube.com/watch?v=1t8RsqlQd8k",
        categortType: 3,


    },
    {
        Image: require("../img/Egyptian_food_Koshary.jpg"),
        name: "كشري",
        view: true,
        time: "50 min",
        Elta7der: '10 min',
        Eltahy: "40 min",
        Elsouba: "20",
        components: "2 كوب أرز\n1 كوب عدس\n1/2 كوب شعيرية مقطعة\n1 بصلة مفرومة\n3 فصوص ثوم مفرومة\nملح وفلفل حسب الذوق\nزيت للقلي",
        Step: "يغلى العدس في ماء مملح حتى يصبح طريا ثم يصفى.\nيحمص الأرز في زيت ساخن ثم يضاف الماء والملح ويترك ليطهى حتى يصبح الأرز مطهوا.\nيقلى البصل والثوم في زيت حتى يصبحان ذهبيين ثم يضاف العدس ويترك لمدة 5 دقائق.\nتقلى الشعيرية حتى تصبح ذهبية ثم تضاف إلى الأرز وتخلط جيدا.\nيقدم الكشري ساخنا مع العدس والشعيرية المقلية والبصل والثوم.",
        video: "https://www.youtube.com/watch?v=Jrs7KaqzYHA",
        categortType: 4,


    },


    {
        Image: require("../img/download.jpg"),
        name: "الملوخية ",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '1 باقة ملوخية طازجة أو مجمدة\n1 كيلو لحم بقري مقطع إلى مكعبات صغيرة\n2 بصلة متوسطة الحجم مفرومة\n4 فصوص ثوم مفرومة\n1/2 كوب كزبرة مفرومة\n1/2 كوب بقدونس مفروم\n1 ملعقة صغيرة بهارات مشكلة\n1 ملعقة صغيرة كركم\n1 ملعقة صغيرة فلفل أسود\n1 ليمونة مقطعة إلى شرائح\nملح حسب الذوق\n2 لتر ماء\nزيت نباتي للطهي',
        Step: "يغسل اللحم ويترك جانبا.\nتقشر البصلة وتفرم جيدا ويضاف إليها الثوم وتخلط معا.\nتسخن الزيت في قدر كبير ويضاف البصل والثوم ويقلب حتى يصبح لونهما ذهبيا.\nيضاف اللحم وتقلب جيدا حتى يصبح لونه بنيا.\nيضاف الملوخية ويقلب جيدا لمدة 5 دقائق.\nيضاف الماء والتوابل ويترك المزيج يغلي.\nيقلب المزيج جيدا ويترك ليطهى لمدة ساعة تقريبا أو حتى يصبح اللحم طريا والملوخية مطهوة.\nيضاف الكزبرة والبقدونس ويترك المزيج لمدة 5 دقائق ثم يزال من النار.\nيقدم المزيج الساخن مع الأرز وشرائح الليمون.",
        video: "https://www.youtube.com/watch?v=bFMVOZFjCmM",
        categortType: 4,


    },

    {
        Image: require("../img/127-010613-egyptian-basrah-recipe-2.jpg"),
        name: "بصاره",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: 'ربع كيلو من الفول المقشر بصلة كبيرة.\n5 فص ثوم مفروم.\nملعقة كبيرة من النعناع المجفف.\n2 ملعقة كبيرة من الشبت.\nملعقة كبيرة من الكزبرة الخضراء.\n2 ملعقة كبيرة من البقدونس.\nملعقة صغيرة من الكمون.\nنصف ملعقة صغيرة من الفلفل الأسود.\nالقليل من الملح.',
        Step: "بعد نقع الفول يتم تصفيته ويوضع في قدر به ماء\nويرفع على النار حتى الغليان.\nيضاف إليه البصل والثوم ويترك على النار لمدة ساعة تقريبا حتى تمام النضج.\nنضع إلى الفول الكزبرة والشبت والبقدونس\nونتبله بالملح والفلفل الأسود والكمون\nوتترك المكونات على النار لمدة 10 دقائق إضافية.\nيرفع القدر من على النار ويترك حتى يبرد قليلا\nويتم خلطه في الخلاط الكهربائي حتى نحصل على قوام ناعم.\nنضع الخليط في القدر مرة أخرى ويرفع على النار الهادئة حتى الغليان.\nفي مقلاة على النار نضع الزيت ويترك حتى يسخن\nونضيف إليه البصل مع التقليب حتى يذبل.\nنضع الثوم ويتم التقليب حتى يحمر لونه.\nتغرف البصارة في طبق التقديم ويرش عليها البصل والثوم المحمر\nويعصر القليل من الليمون\nوتقدم بالهناء والشفاء.",
        video: "https://www.youtube.com/watch?v=Jo8FeBhebQ4",
        categortType: 4,


    },

    {
        Image: require("../img/mapkpaka.jpg"),
        name: "مكرونة مبكبكة ",
        view: true,
        time: " 60 min",
        Elta7der: '10 min',
        Eltahy: "50 min",
        Elsouba: "30",
        components: "ك لحمة مقطعة\nك طماطم معصورة\n1/2 مكرونة\nمعلقة سمنة\nبصلة مقطعة\n2 قرن شطة حامي\nمعلقة فلفل\n2 معلقة ملح\nمعلقة كمون شطة",
        Step: "هنجيب حلة ونحط فية السمنة ونحط اللحمة ونقلبة\nلحد متشوح هنحط مياة سخنة ونحط بصلة وطماطمة\nولوري وحبهان والشطة ونسيبة تستوي\nهنجيب حلة ونحط معلقة سمنة ونحط البصل ونقلب ونحط الطماطم\nوالتوابل والملح ونسيبة تغلى نحط المكرونة واللحمة ونسيبة لاحد السوية\nبعد كدة نقدمة والف هنا ",
        video: "https://www.youtube.com/watch?v=OMx_uiTsgII",
        categortType: 2,


    },
    {
        Image: require("../img/macrona_bl_skoq.jpg"),
        name: "مكرونة فرن بالسجدق",
        view: true,
        time: " 50 min",
        Elta7der: '10 min',
        Eltahy: "40 min",
        Elsouba: "30",
        components: '½ مكرونة\n½ سجدق\n½ طماطم معصورة\nبصلة مقطعة\n2 قرن فلفل مقطع\n2 فص توم مقطع\nمعلقة ملح فلفل شطة\nرشة بهارات\nمعلقة سمنة\nقرن فلفل حامي مقطع',
        Step: "هنجيب طاسة ونحط السمنة\nونحط السجدق ونقلبة لاحد ميتغر لونة هنحط البصل ونقلب\nنحط التوم ونقلب\nنحط الفلفل ونقلبة ونحط الطماطم والتوابل والملح والبهارات\nونسيبة لاحد متسبك\nهنجيب الطاجن ويكون كبير هنحط المكرونة ونحط الصلصة بالسجدق مع كوبية مياة سخنة\nونغطي الطاجن ونسيبة لاحد السوية\nبعد كدة نشيل الغط وتحت الشوية والف هنا",
        video: "https://www.youtube.com/watch?v=52f1YWvX4vU",
        categortType: 2,


    },

    {
        Image: require("../img/download1.jpg"),
        name: "طاجن مكرونة بشاميل ",
        view: true,
        time: " 50 min",
        Elta7der: '10 min',
        Eltahy: "40 min",
        Elsouba: "30",
        components: '½ كيلو مكرونة بنة او اقلام\nماء للغلى\nملح\nالحشو :\n¼ كيلو لحمة مفرومة\nملح\nفلفل اسمر\nبصلة مفرومة او مقطعة صغير\nالبشاميل :\n4 معالق دقيق\nلتر لبن\nمعلقتين سمن\nمكعب مرق\nملح\nفلفل\nجبن رومى او موتزريلا',
        Step: "فى حلة يغلى الماء ثم يضاف المكرونة والملح وتترك لتستوى ثم تصفى ولا تغسل\nفى طاسة يوضع البصل والسمن حتى تصبح البصل ذهبى اللون يضاف اللحمة ويقلب ثم يضاف الملح والفلفل\nفى حلة يضاف السمن والدقيق ويقلب ثم يضاف اللبن والملح والفلفل والمكعب المرق ويقلب حتى يتقل القوام\nتحضر البرامات الصغيرة او الطواجن الصغيرة تدهن بمادة دهنية\nيضاف قليل من البشاميل الى المكرونة ويقلب ثم توضع طبقة من المكرونة فى البرام ثم يضاف اللحمة ثم توضع الطبقة الثاتية\nيغطى الوجه بالبشاميل و الجبن وتدخل فرن ساخن لمدة 20 دقيقة ",
        video: "https://www.youtube.com/watch?v=jzr_0t74aJA",
        categortType: 2,


    },
    {
        Image: require("../img/Untitled-108.jpg"),
        name: "مكرونة وايت صوص",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '400 جرام مكرونة قلم\nكوب حليب 2\n3 ملعقة كبيرة\nملعقة كبيرة زبدة\nملح\nفلفل أسود\nكوب جبن شيدر أو ميكس جبن',
        Step: "تسلق المكرونة في ماء مغلي مملح حتى تصل إلى درجة النضج المرغوب.\nنضيف الدقيق والزبدة إلى الحليب ونخلطهم جيدا بالمضرب اليدوي معه ثم نرفعهم على النار مع استمرار التقليب حتى يتقل القوام.\nنضيف الملح والفلفل الأسود ونقلب ثم الأجبان ونقلب حتى تذوب\nثم نضيف المكرونة المسلوقة إلى الصوص ونقلب ونتركها حتى يغلي بها ثم ترفع من النار وتقدم وبالهنا. ",
        video: "https://www.youtube.com/watch?v=rjH9sgsMADE",
        categortType: 2,


    },

    {
        Image: require("../img/makronawithgampry.jpg"),
        name: "مكرونة بالجمبري",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: "½ كيلو جمبري متقشر ومتنض\nف لمونة\n½ معلقة صغيرة كمون\n½ معلقة صغيرة فلفل اسود\n½ معلقة صغيرة كسبرة\nمعلقة كبيرة زبدة\nمعلقة صغيرة مليانة توم مفروم\nمعلقة كبيرة دقيق",
        Step: "بنتبل الجمبري باللمون والكمون والفلفل الاسود والكسبرة\nفي حلة بنشوح التوم وننزل بالجمبري ونقلب لحد مايستوي بعدين نطلعه ونحط مكان الجمبري الزبدة والدقيق ونقلب وبعدين نحط مكعب المرق ونقلب بعدين نحط اللبن والكريمة اللباني ونرجع الجمبري تاني ونقلب ولما يبتدي يتقل نحط المكرونة ونقلب تقلبتين وخلاص ولو حسيتوا ان الصوص تقيل بتزودوا لبن لو مظبوط خلاص  ",
        video: "https://www.youtube.com/watch?v=bgpUK0nkFkY",
        categortType: 2,


    },
    {
        Image: require("../img/makronabldggag.jpg"),
        name: "مكرونة كريمية بالدجاج ",
        view: true,
        time: " 60 min",
        Elta7der: '10 min',
        Eltahy: "50 min",
        Elsouba: "50",
        components: 'تتبيلة الدجاج:\n2 صدور دجاج 4 ملاعق كبيرة زيت نباتي\n1 ملعقة كبيرة توابل كيچن\n1 ملعقة صغيرة بودرة بصل\n1 ملعقة صغيرة بودرة ثوم\n1 ملعقة صغيرة بقدونس مجفّف\n1 ملعقة صغيرة بهارات دجاج\n1/2 ملعقة صغيرة بابريكا المكرونة:\n500 جرام مكرونة أقلام\n1 كوب كريمة طبخ\n1 كوب مرقة دجاج\n1/2 كوب "115 جرام" جبنة كريمية\n1 حبّة بصل مفروم\n1 حبّة طماطم مقطّعة مكعبات\n1 حبّة فلفل رومي مقطّع مكعبات\n1 ملعقة كبيرة زبدة\n1 ملعقة صغيرة بودرة مرقة دجاج\n1 ملعقة صغيرة توابل كيچن\n1/2 ملعقة صغيرة ثوم مهروسة\nملح - فلفل أسود',
        Step: "نسلق المكرونة بالطريقة المعتادة ثم نصفّيها ونتركها جانبا ونبدأ أولا بتجهيز الدجاج\nإذا كانت الصدور سميكة نضعهم بين طبقتين من الورق الشفاف ونَدُقّهم وهذا حتى ينضجوا تماما من الداخل ثم ندهنهم بملعقة كبيرة من الزيت\nهذه بهارات الكيچن التي استخدمتها بالوصفة وهي تُضفي نكهة مميزة ولذيذة جدا للطبق\nنخلط كل مكونات التتبيلة معا بطبق صغير ونغلّف بهم صدور الدجاج\nوبمقلاة عميقة وغير لاصقة نسخّن حوالي 3 ملاعق كبيرة من الزيت ونشوِّح به الدجاج لمدة 10 دقائق تقريبا مع التقليب المستمر على كل الجوانب حتى ينضجوا تماما ثم نُخرجهم جانبا ونتركهم لتهدأ حرارتهم قليلا\nبنفس المقلاة نُذيب الزبدة ونشوِّح بها البصل والثوم حتى يلين قوام البصل ثم نُضيف مكعبات الفلفل والطماطم وعندما يلين قوام الخضروات نضع الكريما ومرقة الدجاج ثم الجبنة الكريمية ونقلّب جيدا حتى تتجانس المكونات ثم نُضيف بودرة مرقة الدجاج وبهارات الكيچن ونتبّل بالملح والفلفل الأسود\nوعندما يبدأ الخليط بالغليان نُضيف المكرونة المسلوقة مع التقليب الجيد حتى تختلط بها كل المكونات ثم نقطّع صدور الدجاج إلى شرائح ونقلّبهم مع المكرونة ونترك بعض الشرائح جانبا لوضعهم على الوجه عند التقديم النهائي\nنرفع المكرونة عن النار وتوضع بأطباق التقديم ونرُش الوجه بالقليل من الجبنة المبشورة أو نزيّن حسب الرغبة\nوأخيرا تُقدَّم مكرونة الدجاج والكيچن ساخنة",
        video: "https://www.youtube.com/watch?v=rFOASDE9kgs",
        categortType: 1,


    },
    {
        Image: require("../img/733.jpg"),
        name: "صينية بطاطس باللحمة",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "40",
        components: '1 كيلو لحمة مسلوقة\n1 كيلو بطاطس\n3 كوب عصير طماطم\n1 كوب ماء بصلة حلقات\n1 ملعقة صغيرة ثوم مفروم\n1 ملعقة كبيرة سمنة\nفلفل حار  حسب الرغبة\nملح\nفلفل أسود ',
        Step: "شوحي البصل في زيت مخصص للطهى على النار مع إضافة ذرة ملح له حتى تذبل ثم تضاف قطع اللحمة وتحمر قليلا ثم يضاف عصير الطماطم والثوم ويقلب الخليط بشكل جيد\nضعي شرائح البطاطس في صينية مع الفلفل الحار حسب الرغبة و يضاف خليط الطماطم والطماطم إلى البطاطس و يضاف الماء والملح والفلفل الأسود\nتوضع الصينية على النار لتغلي ثم توضع في الفرن وانتظري حتى تمام النضج ",
        video: "https://www.youtube.com/watch?v=QaGmEgUaODc",
        categortType: 5,


    },
    {
        Image: require("../img/491.jpg"),
        name: "كفتة الجمبري",
        view: true,
        time: " 35 min",
        Elta7der: '10 min',
        Eltahy: "25 min",
        Elsouba: "50",
        components: 'جمبري مفروم\nسمك فيليه\nبيض\nزنجبيل طازج\nشبت\nفلفل ألوان\nأعشاب\nكاري\nجزر\nكزبرة خضراء\nخلة خشب\nبقسماط\nثوم\nملح\nفلفل\nزيت ذرة ',
        Step: "افرمي الزنجبيل والثوم والجزر والفلفل الألوان والكاري والأعشاب وملح وفلفل وسمك فيليه وجمبري بشكل جيد\nضعي القليل من البقسماط مع الاستمرار في الفرم\nثم شكلي العحينة اصابع في خلة خشب باستخدام الزيت وضعيها على الشواية حتى تنضج ثم قدميها ",
        video: "https://www.youtube.com/watch?v=_oMKekApjXg",
        categortType: 6,


    },
    {
        Image: require("../img/0shrimpsgrilledtomato.jpg"),
        name: "مكرونة بالجمبري",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "40",
        components: '300 جرام معكرونه 300 جرام جمبري\n½ معلقه صغيره فلفل اسود\nمعلقه صغيره كاري\nبصلة متوسطة متقطعة\nكوب فلفل رومي متقطع\n5 وحدات طماطم متقطعين\nفصين ثوم\nملح حسب التذوق\nكوب ونص ميه',
        Step: "حلة كبيرة هنضيف المكونات جمب بعضها ونضيف الماء الساخنة ونغطيها ونشغل النار متوسطة\nاول ماتبدأ تغلى هنقلب كل المكونات مع بعضهم حلو اوي وهنهدي النار ونخليها متغطيها و تكمل تسويه\nبعد حوالي ١٥ دقيقه هنفتح عليها ونقلبها كويس اوي وتتقدم ساخنة ",
        video: "https://youtube.com/watch?v=Uk58nYk9gnk",
        categortType: 6,


    },

    {
        Image: require("../img/downloadgggg.jpg"),
        name: "طاجن سمك فيليه بالخضار",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '½ كيلو سمك فيليه\n2 فلفل\n2 بصل\n2 طماطم\nثوم مفروم\nتوابل',
        Step: "تقطيع الخضار قطع صغيرة\nتتبيل الخضار ملح وفلفل وكمون و2معلقة بهار سمك ومعلقة ثوم مفروم\nنحضر صينية بايركس مقاس وسط ونضع نص كمية الخطار ونرص السمك ثم نضع باقي كمية الخضار                ",
        video: "https://www.youtube.com/watch?v=cqtKgbxeq1c",
        categortType: 6,


    },
    {
        Image: require("../img/19_2020-637241093415267072-526.jpg"),
        name: "شوربه سى فوود بالكريمه",
        view: true,
        time: " 60 min",
        Elta7der: '15 min',
        Eltahy: "45 min",
        Elsouba: "30",
        components: '½ كيلو طبق سى فوود\nعلبه كريمه طهى\nملح وفلفل اسود\nكمون/شطه/حبهان\nلتر مايه مغلى\nمعلقتين زبده\n5 فصوص ثوم',
        Step: "نحط حله عالنار ونحط فيها الزبده\nنغسل السى فوود بالمايه\nنحط السى فوود فالحله ونشوحها فالزبده لمده من 5دقايق ل10دقايق\nوبعدين نحط التوم وطبعا يبقا مهروس ونشوحهم تانى تشويحه بسيطه\nوبعدين نحط المايه المغليه عليهم ونحط جميع البهارات وبعدين نسيبهم يغلو على نار متوسطة الحرارة لمده نص ساعة\nوبعد النصف ساعة نحط الكريمه ونسيبها تغلى لمدة 10دقايق\nوبعدين تقدم بالهنا والعافيه",
        video: "https://www.youtube.com/watch?v=uAgYzfTctV8",
        categortType: 6,


    },
    {
        Image: require("../img/flafel.jpg"),
        name: "فلافل بيتي بالخلاط",
        view: true,
        time: " 40 min",
        Elta7der: '35 min',
        Eltahy: "5 min",
        Elsouba: "30",
        components: '1/2 ك فول مدشوش\n1 بصلة كبيرة\n3 حزم كرات\n2 حزمة بقدونس\n1 راس ثوم',
        Step: "يبل الفول ف الماء قبلها بيوم\nيقطع الكرات والبقدونس ويغسل\nيقطع البصل مكعبات ويقشر الثوم\nف كبة الخلاط نضع الخليط ونضرب الي أن تصير ناعمه\nتحفظ ف اكياس ف الثلاجة وعند الاستخدام نضيف على العجين ملح وشطة وكمون وكزبرة حصي ونص ملعقة صغيرة بيكنج بودر\nيشكل العجين لاقراص وتتبل ف السمسم الابيض وتقلي بالزيت",
        video: "https://www.youtube.com/watch?v=3qn7YG4vTdw",
        categortType: 4,


    },
    {
        Image: require("../img/484.jpg"),
        name: "جلاش باللحمة المفرومة",
        view: true,
        time: " 30 min",
        Elta7der: '10 min',
        Eltahy: "20 min",
        Elsouba: "30",
        components: '½ كيلو لحمة معصجة\nلفة جلاش\nبيضتين\nكوب لبن\n¼ معلقه صغيره فلفل اسود\n¼ معلقه صغيره ملح\nمعلقتين كبار سمن',
        Step: "هنحضر اللحمة ونخليها على جمب لينك الوصفة فالمكونات\nهندهن صينيه كبيره بالسمن وهنفتح الجلاش هناخد ورقتين ونرص نصهم فالصينيه ونصم برا\nوناخذ ورقتين تاني ونرصهم نصهم في الصينيه ونصهم برا وبين كل راق والتاني هنضيف مسحة من السمن هنضيف اللحمة ونطبق ورق الجلاش الي برا على الحشو\nوبين كل تطبيقه والتانيه هنضيف مسحة سمنه لما تقفل خالص وعلى الوش هنضيف ورقه كاملة وبعدين نقطعها حسب الرغبة يامربعات يامثلثات ومسحة سمن عالوش\nفي طبق صغير هنضيف اللبن والبيض والملح والفلفل الأسود ونربهم مع بعض حلو اوي ونوزعه على وش الجلاش وندخلها الفرن تستوي على درجة حرارة ١٨٠ وتتحمر من الوش تتقدم سخنة وبالهنا ",
        video: "https://www.youtube.com/watch?v=me3ZoOCpb6U",
        categortType: 4,

    },
    {
        Image: require("../img/m5zn_12528406b9a94fc.jpg"),
        name: "الفراخ المشوية بالبقدونس والجزر",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "50",
        components: '6 افخاذ دجاج\nالتتبيلة\nمعلقه ونص كبار ملح\n4 معالق كبار عسل اسود\n½ معلقة صغيره فلفل اسود\n½ معلقة صغيره كاري\nمعلقه صغيره زعتر\n4 معالق كبار خل\nبصله كبيره مبشورة\n½ كوب جزر مبشور\nمعلقتين كبار بقدونس متقطع\nمعلقه صغيرة توم مفروم',
        Step: "هنغسل الفراخ وتتقطع ونخليها تتصفي خالص من الميه\nفي بولة غويطة هنضيف مكونات التتبيلة كلها ونقلبها مع بعض حلو اوي\nفي بولة غويطة هنضيف مكونات التتبيلة كلها ونقلبها مع بعض حلو اوي\nهنرصها فالصينيه وندخلها الفرن تتشوي على درجة حرارة ٢٢٠ وتتقدم سخنة مع المكرونة او الأرز وبالهنا ",
        video: "https://www.youtube.com/watch?v=INcw74ZiYnY",
        categortType: 1,
    },
    {
        Image: require("../img/4647824981584556199.jpg"),
        name: "بطاطس محشية باللحمة المفرومة",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: 'كيلو بطاطس صغيره\n½ كيلو لحمه مفرومه\nبصل\nم ص ملح وفلفل\nم ص بهارات\n2 م ك صلصه\nم ص توم مفروم\nم ص بابريكا',
        Step: "تقشر البطاطس وتقور ثم تغسل بالماء ثم تحمر فى زيت غزير\nنقوم بتعصيج اللحمه بوضع معلقه سمنه فى وعاء مناسب ثم ننزل بالبصل يدبل ثم اللحمه ونتبلها ونتركها تنضج\nنقوم بحشو اللحمه داخل البطاطس ثم نرصها فى صينيه\nفى طاسه صغيره ننزل بمعلقه زيت ثم التوم والصلصه والتوابل ثم نسقى بها البطاطس ثم ندخلها الفرن تحمر ونخرجها نقدمها بالف هنا",
        video: "https://www.youtube.com/watch?v=Bybn0UwkOrU",
        categortType: 4,


    },

    {
        Image: require("../img/rokak.jpg"),
        name: "رقاق طري باللحمة المفرومة",
        view: true,
        time: "40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: ' لفه رقاق طري.\nنصف كيلو لحم مفروم.\nبصلة كبيرة مبشورة.\nطماطم مبشورة.\nمعلقة صلصة كبيرة.\nمرقة دجاج.\nتوابل لحم.\nفلفل أسود.\nفلفل أخضر مقطع.\nملح.\nلبن.\nشوربة لحم أو فراخ.\nسمن.',
        Step: "نحضر صينية متوسطة مدهونة بالسمن\nثم نضع ورقة واحدة من الرقاق ونمسح بالسمن\nونكمل بهذه الطريقة حتى نكمل نصف الكمية الموجودة من الرقاق.\nنضع اللحم المفروم المعصج في المنتصف ونكمل باقي الأوراق بهذه الطريقة.\nنضع الشوربه من فوقها وتدخل الفرن على درجة حرارة متوسطة حتى يحمر الوجه ويقدم ساخنا. ",
        video: "https://www.youtube.com/watch?v=Op3UgTR3ujE",
        categortType: 4,


    },

    {
        Image: require("../img/54423-55.jpg"),
        name: "طاجن بطاطس باللحمة",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: 'ك بطاطس مقطع\nك لحمة مقطع\nك طماطم معصور\n3 فص ثوم مقطع\nبصلة مقطعة\n2 معلقة ملح فلفل\nملعقة كزبرة\nمعلقة بهارات على جوزة الطيب\nورقة لوري على حبهان',
        Step: "هنجيب حلة ونحط فية طماطم وبصلة ولوري وحبها\nونسيبة تغلى نحط للحمة\nاول متخش في السوية نحط ملعقة ملح وفلفل\nبعد كدة هنجيب الطاجن الطاجن ونحط البطاطس واللحمة والبصل والملح\nونحط التوابل والبهارات ونقلبهم في بعض\nونحط الطماطم ومعلقة سمنة\nونغطية بفويل وندخلة الفرن\nلاحد السوية\nهنشيل الغط ونحطة تحت الشوية",
        video: "https://www.youtube.com/watch?v=UiPWYbzN0-U",
        categortType: 6,


    },

    {
        Image: require("../img/meatWithfrek.jpg"),
        name: "طاجن لحمة بالفريك",
        view: true,
        time: " 50 min",
        Elta7der: '10 min',
        Eltahy: "40 min",
        Elsouba: "60",
        components: '¼ ك فريك مغسول ومنقوع\n½ ك لحمة مقطع\nمعلقة سمنة\n2 معلقة زيت\nملعقة صلصة\nبصلة مقطعة\n2 معلقة ملح وفلفل\nمعلقة\nجوزة الطيب',
        Step: "هنجيب حلة ونحط السمنة ونحط اللحمة ونشوحة لاحد ميتغر اللون\nهنحط مياه ساخنة ونحط بصلة وطماطمة ونسيبة تخش في السوية\nنحط ملعقة ملح وفلفل\nهنجيب حلة ونحط ملعقة سمنة ونحط بصلة ونقلب ونحط الصلصة\nونحط ٢كوبية شوربة ونسيبة\nتغلى نحط الفريك ونحط التوابل والبهارات والملح ونسيبة يشرب\nهنجيب الطاجن ونحط الفريك واللحمة وندخلة الفرن",
        video: "https://www.youtube.com/watch?v=dQNoYn_7bA0",
        categortType: 6,

    },
    {
        Image: require("../img/1613190183_node.png"),
        name: "كشري مصري",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: 'معكرونة : 1 كيلو (مشكلة)\nالأرز المصريّ : نصف كيلو\nالعدس : نصف كيلو\nطماطم : 1 كيلو\nالثوم : 10 فصوص\nشعيرية : ربع كيلو\nالبصل : 3 حبات\nالخل : حسب الحاجة\nملح : حسب الرغبة\nالشطة : حسب الحاجة\nالكمون : حسب الرغبة\nحمص : ربع كيلو\nعصير الليمون : حسب الرغبة\nالزيت : حسب الحاجة\nالكزبرة : ربع ملعقة صغيرة',
        Step: "حمري 5 فصوص ثوم جيدا وأضيفي الطماطم بعد تصفيتها وضعي نصف ملعقة فلفل أسود وملعقة ونصف ملح و٤ ملعقة خل واتركيهم يغلوا جيدا حوالي نصف ساعة مع تزويد الماء ونتركها حتى تستوي. اغسلي نصف كيلو العدس جيدا ونغطيه بالماء ونزود ونضيف الثوم والبصل ونصف ملعقة كبيرة ملح ويترك على النار.\nضعي في قدر 4 ملعقة زيت ونضيف الشعيرية ونحمرها جيدا ونغسل الأرز وينزل به على الشعيرية مع ملعقة من الملح والماء وتترك المكونات نصف ساعة حتى يستوي الأرز.\nفي قدر آخر نضع الحمص حتى ينسلق مع نصف ملعقة صغيرة ملح.\nلتحضير الدقة: افرمي الثوم وضع كوب من الخل وكوب ماء ثم نصف ملعقة ملح ونصف ملعقة كمون وربع ملعقة كزبرة مطحونة.\nلتحضير الشطة: اضربي الطماطم في الخلاط وضعيهم في قدر وأضيفي 5 ملعقة من صلصة الكشري وعصير الليمون وملعقة كبيرة خل و5 ملعقة صغيرة شطة وملعقة ملح صغيرة وكوب من الماء ويترك ليغلي 5 دقائق.\nاسلقي المكرونة في الماء والزيت والملح وتصفى ونضيف 3 ملعقة زيت ونقلبها.\nحمري البصل الشرائح المغطى بالدقيق في الزيت الغزير حتى يتحمر.\nضعي المكرونة في طبق التقديم\nوأضيفي الأرز مع العدس والحمص وعليهم الصلصة والبصل المقرمش وضعي الدقة والشطة بأطباق جانبية.",
        video: "https://www.youtube.com/watch?v=RX6k_VjkM1M",
        categortType: 4,

    },
    {
        Image: require("../img/46188.jpg"),
        name: "ورق عنب",
        view: true,
        time: " 60 min",
        Elta7der: '20 min',
        Eltahy: "40 min",
        Elsouba: "90",
        components: 'نصف كيلو ورق عنب مسلوق.\n2كوب كبير من عصير الطماطم.\nحزمه بقدونس.\nبصل مفروم.\nملعقة كبيرة سمن بلدي أو نباتي.\nملح وبهارات محشي.\n2 كوب مرقه دجاج أو لحم.\n2 كوب أرز ابيض مغسول ومصفي جيدا من الماء.',
        Step: "تحضير وعاء مناسب وإضافة السمن مع البصل ويقلب جيدا لمدة دقيقتين ثم إضافة عصير الطماطم و الملح وبهارات المحشي  ويترك الطماطم على النار حتى يصبح خليطه سميك ثم إضافة البقدونس المفروم والأرز مع التقليب جيدا في وعاء مع إضافة شرائح من البصل والطماطم ثم حشو ورق العنب بخلطة الأرز ورصه بطريقه منظمه ومرتبة وبعد الانتهاء تضاف المرقة مع معلقة كبيرة من السمن ويطهي ورق العنب على نار عالية لمدة 10 دقائق ثم تهدئة النار ويطهي لمدة 40 دقيقة ويقدم ورق العنب ساخن مع الدجاج أو اللحم أو البط.",
        video: "https://www.youtube.com/watch?v=ELp9zkImO_8",
        categortType: 4,

    },
    {
        Image: require("../img/50e33a46e3aa05b3d61625a1840d936b_w750_h500.jpg"),
        name: "بيتزا الباربكيو",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '- مكونات العجينة :\nملح : رشّة\nالزيت : ربع كوب\nسكر : رشّة\nالخميرة الفورية : ملعقة كبيرة\nدقيق : 3 اكواب\nماء دافئ : كوب\n- جبنة : كوب (مبشورة)\n- صدر الدجاج : 2 قطعة\n- صلصة الباربيكيو : كوب\n- البصل : 1 حبة (مقطع شرائح)\n- ملح : رشّة\n- فليفلة خضراء : نصف حبة (مقطعة)\n- صلصة طماطم : 2 ملعقة كبيرة',
        Step: "ضعي الخميرة في كوب ماء دافئ مع رشة سكر\nثم حركي الخليط واتركيه قليلا حتى يتخمر. ضعي الدقيق في طبق مع رشة ملح والزيت\nواعجني جيدا حتى تحصلي على عجينة متماسكة.\nضعي العجينة في وعاء مدهون بالزيت وغلفيها واتركيها حتى تتخمر لمدة ساعة واحدة.\nضعي صدور الدجاج المقطعة في قدر مع رشة ملح واقليها حتى تنضج.\nافردي العجينة بواسطة الشوبك واصنعي ثقوبا في العجينة بواسطة شوكة.\nاخلطي صلصة الباربكيو مع صلصة الطماطم وافرديها على العجينة.\nضعي صدور الدجاج والفليفلة الخضراء\nوشرائح البصل\nوالجبنة المبشورة على العجينة.\nاخبزيها في الفرن حتى تنضج ثم قدميها.",
        video: "https://www.youtube.com/watch?v=HHPTD_eXfWI",
        categortType: 7,

    },
    {
        Image: require("../img/0fde4266664dbd6a75ef98da2fd8bb01_w750_h500.jpg"),
        name: "باذنجان محشي",
        view: true,
        time: " 50 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "50",
        components: '- الأرز المصريّ : كيلو\n- البصل : 3 حبات (مفروم)\n- عصير الطماطم : 4 اكواب\n- مرق دجاج : 4 اكواب\n- الشبت : نصف كوب\n- بقدونس : نصف كوب\n- كزبرة خضراء : نصف كوب\n- صلصة طماطم : ملعقة كبيرة\n- الزيت : ملعقة كبيرة\n- القرفة : نصف ملعقة صغيرة\n- نعناع ناشف : ملعقة صغيرة\n- بهارات مشكلة : ملعقة كبيرة\n- فلفل أسود : ملعقة\n- جوزة الطيب : ربع ملعقة صغيرة\n- الشطة : نصف ملعقة صغيرة\n- ملح : حسب الرغبة',
        Step: "على نار متوسطة سخني الزيت ثم أضيفي البصل وقلبيه حتى يذبل ثم أضيفي صلصة الطماطم و3 أكواب من عصير الطماطم وقلبي ثم اتركيها حتى تغلي. أضيفي مكعب المرق وقلبي لمدة 5 دقائق وفي وعاء كبير ضعي الأرز والكزبرة والشبت والبقدونس وخليط البصل والطماطم والنعناع والقرفة والبهارات وجوزة الطيب والفلفل الأسود والملح والفلفل الحار وقلبي جيدا.\nاحشي الباذنجان بالأرز واتركي مقدار عقلة اصبع حتى تسمحي للأرز بالتمدد أثناء النضج وعلى نار متوسطة ضعي باقي عصير الطماطم والمرق واتركيه حتى يغلي.\nرصي الباذنجان في القدر ثم صبي المرق في داخل كل ثمرة باذنجان ثم صبي باقي المرق في قاع القدر حتى يصل إلى منتصف الباذنجان ثم غطي القدر واتركيه على نار متوسطة حتى يغلي المرق.\nأخفضي النار لتصبح هادئة واتركيه لمدة 60 دقيقة حتى ينضج وقدميه ساخنا.",
        video: "https://www.youtube.com/watch?v=QvLdDdt_XoI",
        categortType: 4,

    },
    {
        Image: require("../img/a55cbaa56ad2a42b19c3f0e50e065be5_w750_h500.jpg"),
        name: "أرز بالحمص",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '- الأرز : كوب ونصف\n- البصل : 1 حبة (متوسط الحجم / مفروم فرما ناعما)\n- حمص : كوب (حبوب)\n- السمن البلدي : 2 ملعقة كبيرة\n- بهارات مشكلة : نصف ملعقة صغيرة\n- ملح : رشّة\n- فلفل أسود : رشّة\n',
        Step: "في قدر من الماء على نار متوسطة\nضعي حبوب الحمص حتى تُسلق وتنضج تماما\nثمّ اغسليها وصفيها من الماء وضعيها جانبا.\nاغسلي الأرز بالماء\nثمّ اتركيه حتى ينقع لفترة من الوقت.\nفي قدر غير لاصق ومتوسط الحجم وعلى نار متوسطة سخني السمن\nثم أضيفي البصل وشوحي حتى يذبل ويصبح ذهبي اللون.\nصفّي الأرز من الماء\nوأضيفيه فوق البصل في القدر واتركيه حتى يتحمّر قليلا.\nأضيفي حبوب الحمص مع كميّة البهارات والملح\nواسكبي حوالي 2 كوب من الماء\nثم حركي جيدا واتركي المزيج حتى يغلي.\nغطي القدر عند الغليان\nثم خففي النار واتركيه حتى ينضج الأرز تماما.\nاسكبي الأرز بالحمص في طبق التقديم وقدميه ساخنا.",
        video: "https://www.youtube.com/watch?v=OpEqt-mrcgI",
        categortType: 3,

    },
    {
        Image: require("../img/2b1b8ee85f95fcd65e75e2a1e2c91adc_w750_h500.jpg"),
        name: "دجاج بصوص الخردل",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '- صدر الدجاج : 4 صدو\n- المايونيز : 3 ملاعق كبيرة\n- الخردل : ثلث كوب\n- العسل : 3 ملاعق كبيرة\n- الصويا صوص : ملعقة كبيرة\n- عصير الليمون : ملعقة كبيرة',
        Step: "اخلطي الخردل\nوالعسل\nوعصير الليمون\nوالصويا صوص\nوالمايونيز\nفي طبق.\nارفعي ملعقتين كبيرتين من الصوص للتقديم.\nاخلطي باقي كمية الصوص بالدجاج في طبق وغطيه\nواتركيه في الثلاجة ليلة كاملة.\nأخرجي الطبق من الثلاجة\nوضعي الدجاج مع الصوص في صينية فرن\nوأدخليها الفرن على درجة حرارة 165 مئوية لمدة 15 دقيقة أو حتى ينضج الدجاج.\nقدميه ساخنا ووزعي كمية الصلصة الإضافية فوقه.",
        video: "https://www.youtube.com/watch?v=dPMkgbc6akY",
        categortType: 1,

    },
    {
        Image: require("../img/9b3fbd09a97d3a465cfcaebe6c7d677c_w750_h500.jpg"),
        name: "مسقعة الباذنجان والبطاطس ",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '- للصلصة البيضاء - البشاميل :\nالزبدة : كوب دقيق : 2 كوب حليب : 6 اكواب (ساخن)\nكريمة الطبخ : 4 اكواب\n- للتقديم :\nفتات الخبز : نصف كوب\nجبن البارميزان : 3 ملاعق كبيرة (مبشور)\n- لحم العجل : كيلو (مفروم)\n- القرفة : ملعقة صغيرة (مطحونة)\n- جوزة الطيب : ملعقة صغيرة (مطحونة)\n- زيت الزيتون : كوب\n- البصل الأحمر : 2 كوب (مفروم فرما ناعما)\n- الثوم : نصف كوب (مفروم)\n- البطاطس : 5 حبات (مقطّعة قطع كبيرة)\n- الباذنجان : 5 حبات (مقطع قطع كبيرة)\n- الفطر : 2 كوب (مفروم)\n- الكرفس : 2 كوب (مفروم فرما ناعما)\n- الكراث : 2 كوب (مفروم فرما ناعما)\n- إكليل الجبل : 3 ملاعق صغيرة (مفروم)\n- الزعتر : رشّة\n- أوراق الريحان : حفنة (طازجة)\n- عصير العنب الاحمر : كوب\n- معجون الطماطم : كوب\n- السكر البني : 2 ملعقة صغيرة\n- طماطم : 2 كوب (مقشرة ومفرومة فرما ناعما)\n- ملح : حسب الرغبة\n- فلفل أسود : حسب الرغبة',
        Step: "ضعي اللحم المفروم مع القرفة\nوجوزة الطيب\nإلى قدر به زيت على النار مع غطاء القدر\nوبعد 15 دقيقة\nضعي فرم البصل مع التقليب حتى يكتسب لونا ذهبيا\nً أضيفي الثوم\nوالبطاطس\nوالباذنجان\nوالفطر\nوالكرفس\nوالكراث\nوإكليل الجبل\nوالزعتر\nوأوراق الريحان\nواطهي المكونات جيدا قبل إضافة عصير العنب الأحمر.\nعندما تتشرب المكونات عصير العنب\nأضيفي معجون الطماطم\nوالسكر مع التحريك لـ 3 دقائق\nثم أضيفي الطماطم المقشرة\nوتبهر بالملح وتطهى لمده 60 دقيقة.\nلإعداد الصلصة البيضاء (البشاميل): ذوبي الزبدة في قدر صغير على النار\nوأضيفي الدقيق مع التحريك لـ 10 دقائق قبل صبّ الحليب الساخن تدريجيا\nودعي المكونات لـ 10 دقائق على نار هادئة.\nللتقديم: اسكبي الصلصة البيضاء فوق القدر الذي يدخل إلى فرن ساخن وذلك لـ 15 دقيقة\nثم زيني القدر بالجبن\nوفتات الخبز\nوتدخل إلى الفرن مجددا لدقائق قبل التقديم.",
        video: "https://www.youtube.com/watch?v=eABWp3GPIUE",
        categortType: 4,

    },
    {
        Image: require("../img/f3e6936fc09d00be1c90bec714625521_w750_h500.jpg"),
        name: "كفته داوود باشا",
        view: true,
        time: " 60 min",
        Elta7der: '20 min',
        Eltahy: "40 min",
        Elsouba: "60",
        components: '- مقادير الصلصة :\nالبصل : 1 حبة (مفروم)\nالثوم : فصّان (مهروس)\nصلصة طماطم : 2 كوب\nمعجون الطماطم : 2 ملعقة صغيرة\nالزيت النباتي : 2 ملعقة كبيرة\nالماء : ربع كوب\n- لحم مفروم : 500 غراما\n- البصل : 1 حبة (مفروم)\n- كزبرة خضراء : ربع كوب (مفرومة)\n- بقدونس : نصف كوب (مفروم)\n- الزيت النباتي : ربع كوب\n- فلفل رومي : 1 حبة (مفروم)\n- الثوم : فصّان (مهروس)\n- فلفل أسود : نصف ملعقة صغيرة\n- كزبرة يابسة : ملعقة صغيرة\n- بهارات مشكلة : ملعقة صغيرة',
        Step: "في وعاء للخلط\nضعي اللحم\nوالكزبرة\nوالبصل\nوالبقدونس\nوالثوم\nوالفلفل الأسود\nوالبهارات\nوالفلفل الرومي\nوالكزبرة الجافة\nاخلطي المكونات حتى تتداخل.\nحمّي الزيت في مقلاة على نار متوسطة\nوشكلي كرات متساوية الحجم من خليط اللحم\nوضعيه في المقلاة\nوقلبي حتى يتغير لونها وتنضج\nثم ارفعيها من المقلاة وضعيها في طبق جانبي.\nفي مقلاة على النار\nسخني الزيت\nثم أضيفي البصل والثوم وقلبي حتى يذبلا.\nأضيفي معجون الطماطم\nوصلصة الطماطم\nوالملح\nوالبهارات المشكلة\nوالماء وحركي المكونات حتى تتداخل.\nعند الغليان خففي النار\nوأضيفي كرات اللحم\nثم غطي المقلاة\nواطبخي المكونات حتى تنضج وتكثف الصلصة.\nيقدم ساخنا بجانب الأرز الأبيض.",
        video: "https://www.youtube.com/watch?v=hcRuAVoOIQI",
        categortType: 4,

    },
    {
        Image: require("../img/b370dcb6a455f9e136588beaec699d2d_w750_h500.jpg"),
        name: "محشي الكوسا والباذنجان ",
        view: true,
        time: " 65 min",
        Elta7der: '25 min',
        Eltahy: "40 min",
        Elsouba: "70",
        components: '- الباذنجان : نصف كيلو\n- الكوسا : نصف كيلو\n- الأرز : 2 كوب (مغسول ومصفى)\n- البصل : 1 حبة (مفروم)\n- بقدونس : نصف كوب (مفروم)\n- طماطم : 2 حبة (مقطعة)\n- الثوم : 3 فصوص\n- لحم مفروم : ربع كيلو\n- زيت الزيتون : نصف كوب\n- مرق دجاج : مكعب\n- نعناع ناشف : ملعقة صغيرة\n- ملح : حسب الرغبة\n- فلفل أسود : حسب الرغبة\n- البطاطس : 2 حبة (مقطعة شرائح)\n- ماء ساخن : حسب الحاجة',
        Step: "احفري الكوسا والباذنجان أزيلي اللبّ من الداخل\nثم اغسلي الخضار جيدا وصفيها.\nحضري وعاء\nواخلطي اللحم المفروم\nوالطماطم\nوالبصل\nوالبقدونس\nوالأرز المغسول.\nأضيفي الملح\nوالفلفل الأسود حسب الرغبة\nوالثوم\nوالنعناع الجاف\nوزيت الزيتون\nوقلبي المكونات جيدا حتى تمتزج تماما.\nاحشي الكوسا والباذنجان بالخليط دون ملئها.\nحضري قدر\nوضعي به القليل من الزيت ويتم رص شرائح البطاطس به.\nضعي الكوسا والباذنجان فوق البطاطس\nوأضيفي الماء المغلي مع مرق الدجاج والملح.\nضعي القدر على النار مع تغطيه\nواتركيه حتى الغليان\nثم خففي النار\nواتركيه حتى تنضج الخضار.\nقبل الإستواء ضعي الثوم المهروس مع ملعقة كبيرة نعناع جاف واتركيه لعشر دقائق إضافية.\nاسكبي المحشي في طبق التقديم وقدميه ساخنا.",
        video: "https://www.youtube.com/watch?v=5El4aaTrCVg",
        categortType: 4,

    },
    {
        Image: require("../img/7868aa162f2f871cdd7db810f98f8b5c_w750_h500.jpg"),
        name: "مقلوبة السمك",
        view: true,
        time: " 60 min",
        Elta7der: '15 min',
        Eltahy: "45 min",
        Elsouba: "30",
        components: '- سمك الفيليه : 2 كيلو\nمرق السمك : 2 مكعب\nالبصل : 6 حبات (مقطع شرائح)\nالسمنة : 2 ملعقة كبيرة\nبهار السمك : ملعقة كبيرة\nالكمون : ملعقة كبيرة\nالزيت : نصف لتر (لقلي السمك)',
        Step: "تبلي السمك بالبهارات واتركيه جانبا.\nانقعي الأرز لمدة 20 دقيقة ثم صفيه.\nفي قدر على النار\nضعي البصل واقليه بالسمنة\nوضعي مكعبات مرق السمك\nوالبهارات\nوالأرز.\nصُبي الماء على الأرز واتركيه لينضج.\nاقلي السمك وضعيه فوق الأرز المفلفل\nوتقدم المقلوبة مع السلطة بالطحينة.",
        video: "https://www.youtube.com/watch?v=atLWX35t51Q",
        categortType: 6,

    },
    {
        Image: require("../img/31b85a6c088484f1f33ed58316ded79f_w750_h500.jpg"),
        name: "الكباب المشوي",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '- زيت الزيتون : 3 ملاعق كبيرة\n- خل العنب : 3 ملاعق كبيرة\n- الخردل : ملعقة كبيرة\n- لحم البتلو : 500 غراما (لحم العجل / مقطع مكعبات)\n- صلصة الباربيكيو : ملعقة كبيرة (جاهزة)\n- إكليل الجبل : ملعقة صغيرة (روزماري / مفروم)\n- الفليفلة الحمراء : 2 حبة (متوسطة الحجم / منزوعة البذور ومُقطَّعة إلى مكعبات)\n',
        Step: " لإعداد التتبيلة: يُضاف زيت الزيتون والخل والخردل إلى قارورة صغيرة\nوتُرجُّ هذه الأخيرة جيِّدًا\nحتَّى تختلط المكوِّنات جيِّدًا.\nتوزَّع مكعبات اللحم في طبق زجاج عميق\nوتُملَّح وتُبهَّر حسب الرغبة\nثمَّ تُصبُّ التتبيلة عليها\nكما يُضاف فرم إكليل الجبل\nوصلصة الباربكيو. وتمرَّغ المكعبات بالصلصة جيِّدًا.\nتوزَّع مكعبات اللحم على الأشياش\nبالتناوب مع الفليفلة\nوتشوى حتَّى تنضج وتصبح بنيَّة اللون\nوزهريَّة وطريَّة من الداخل.\nستحتاجين إلى: أشياش الخشب\nمنقوعة بالماء.",
        video: "https://www.youtube.com/watch?v=rQD1DApqkE0",
        categortType: 5,

    },
    {
        Image: require("../img/31b5fb1d5b095a960dfbe7d2e31cd273_w750_h500.jpg"),
        name: "مكرونة بالتونة دايت",
        view: true,
        time: " 25 min",
        Elta7der: '5 min',
        Eltahy: "20 min",
        Elsouba: "20",
        components: '- معكرونة : 500 غراما\nالتونا : علبة (مصفاة من الزيت)\nطماطم : 400 غراما (مقطعة)\nالفلفل الملوّن : 3 حبات\nكزبرة خضراء : ضمة\nالفلفل الحار : نصف ملعقة صغيرة\nالثوم : فصّان (مفروم)\nملح : رشّة\nفلفل أسود : رشّة\nالزيتون : ربع كوب (منزوع النواة)\nزيت الزيتون : 2 ملعقة كبيرة\nالبصل : 1 حبة (مفروم)',
        Step: "اسلقي المكرونة في ماء وملح وزيت لمدة 10 دقائق حتى تنضج\nثم صفيها واتركيها جانبا.\nسخني الزيت في مقلاة على النار\nوشوحي البصل والثوم حتى يذبلا.\nأضيفي الفلفل الألوان\nوالطماطم\nوالكزبرة\nوالزيتون\nوالتونة.\nتبلي بالملح والفلفل الأسود\nثم حركي قليلا.\nأضيفي المكرونة المسلوقة وقلبي جيدا\nثم ضعيها في طبق التقديم وقدميها ساخنة.",
        video: "https://www.youtube.com/watch?v=XXegVJTN1Qc",
        categortType: 2,

    },
    {
        Image: require("../img/969e8aab44a92214cae12916d30bbe4a_w750_h500.jpg"),
        name: "كاساديا الدجاج بالجبن الشيدر",
        view: true,
        time: " 30 min",
        Elta7der: '5 min',
        Eltahy: "25 min",
        Elsouba: "30",
        components: '- الزيت النباتي : ملعقتان كبيرتان ونصف\n- خبز التورتيلا : 4 أرغفة\n- الدجاج : 2 كوب (مسلوق ومفتت)\n- جبن الشيدر : 2 كوب (مبشور)',
        Step: "قطّعي خبز التورتيلا إلى أنصاف.\nوزعي كمية من جبن الشيدر\nثم الدجاج المفتت\nثم جبن الشيدر داخل نصف الخبز.\nأغلقي أنصاف الخبز على الحشوة بالنصف الفارغ من الخبز\nواضغطي عليه قليلا.\nكرري الخطوة السابقة حتى نفاذ الكمية.\nسخني الزيت في مقلاة على نار متوسطة\nواقلي الخبز المحشي لدقيقتان حتى يذوب الجبن بداخله.\nقدمي كاساديا الدجاج بجبن الشيدر ساخنا.",
        video: "https://www.youtube.com/watch?v=HzWKH4FgPvM",
        categortType: 7,

    },
    {
        Image: require("../img/a0a8698daa960a40c15194a6a0b3ba7b_w750_h500.jpg"),
        name: "كريب شيش طاووق",
        view: true,
        time: " 60 min",
        Elta7der: '30 min',
        Eltahy: "30 min",
        Elsouba: "50",
        components: '- لتحضير الحشوة :\nصدر الدجاج : 500 غراما (مقطع مكعبات)\nمعجون الطماطم : 2 ملعقة كبيرة\nالخل الأبيض : ملعقة كبيرة\nملح : ملعقة صغيرة ونصف\nفلفل أسود : نصف ملعقة صغيرة\nالقرفة : ربع ملعقة صغيرة\nفلفل رومي : 1 حبة (مقطع مكعبات)\nالبصل : 1 حبة (مقطع شرائح)\nبهار دجاج : ملعقة صغيرة\n- لتحضير الكريب :\nحليب : كوب (سائل)\nالماء : كوب\nالبيض : 1 حبة\nملح : رشّة\nفلفل أسود : رشّة\nدقيق : كوب',
        Step: "لتحضير الحشوة: في وعاء\nضعي الدجاج\nومعجون الطماطم\nوالخلّ\nوالبهارات\nوقلبي المكونات حتى تمتزج واتركيها منقوعة في التتبيلة.\nلتحضير العجينة: في وعاء الخلاط\nضعي الحليب\nوالماء\nوالدقيق\nوالبيض\nوالملح\nوالفلفل الأسود.\nاخلطي المكونات في الخلاط حتى تحصلي على عجينة متجانسة وسائلة.\nسخني مقلاة مدهونة بالزيت على نار متوسطة إلى هادئة\nواسكبي مقدار مغرفة من العجينة.\nحركي المقلاة بشكل دائري لتشكيل العجينة واتركيها حتى تنضج وتتحمر ثم اقلبيها للجهة الأخرى.\nكرري العملية حتى نفاذ الكمية.\nفي مقلاة أخرى\nحمّي ملعقتان من الزيت على نار متوسطة وضعي الشيش طاووق قلبيه حتى يتبدل لونه.\nأضيفي البصل وقلبيه مع الشيش طاووق حتى ينضج.\nأضيفي الفلفل وقلبيه مع باقي المكونات حتى يذبل.\nوزعي كمية من خليط الشيش طاووق على خبز الكريب وقدميه ساخنا.",
        video: "https://www.youtube.com/watch?v=Dd5qSRtd4x8",
        categortType: 7,

    },
    {
        Image: require("../img/4df924d6215941ec344097c77d8d409f_w750_h500.jpg"),
        name: "كبسة خضار سريعة",
        view: true,
        time: " 60 min",
        Elta7der: '15 min',
        Eltahy: "45 min",
        Elsouba: "30",
        components: '- أرز بسمتي : 2 كوب\nمرق دجاج : 4 اكواب\nملح : ملعقة صغيرة وثلاثة أرباع الملعقة\nالفلفل الاحمر الحار : نصف ملعقة صغيرة\nبودرة الكاري : ملعقة صغيرة ونصف\nالكمون : ملعقة صغيرة ونصف\nالكركم : ملعقة صغيرة ونصف\nالثوم : نصف ملعقة صغيرة (مهروس)\nطماطم : 1 حبة (مفرومة فرما ناعما)\nالبصل : 1 حبة (مفروم فرما ناعما)\nورق غار : 2 ورقة\nلومي : 2 حبة (مجفف)\nالزعفران : ربع ملعقة صغيرة\nسمن : 3 ملاعق كبيرة',
        Step: "انقعي الأرز بالماء البارد لحوالي 35 دقيقة\nثم اغسليه جيدا حتى تتخلصي من أكبر كمية من النشا من الأرز.سخني السمن في قدر كبير الحجم على نار متوسّطة.\nأضيفي البصل وشوّحي مع السمن حتى يذبل.\nأضيفي الثوم والطماطم\nثم قلّبي لدقيقة.تبلي بجميع البهارات واللومي وورق الغار\nثم قلّبي الخليط لعدة دقائق.\nأضيفي الأرز والمرق\nثم خففي النار\nواتركي القدر حتى ينضج الأرز.\nاسكبي كبسة الخضار في طبق التقديم وقدميها ساخنة.",
        video: "https://www.youtube.com/watch?v=PnoYKPnyxvc",
        categortType: 3,

    },
    {
        Image: require("../img/f213a26ce9152d184baeed39a4076fa2_w750_h500.jpg"),
        name: "روستو دجاج بالبرتقال",
        view: true,
        time: " 55 min",
        Elta7der: '10 min',
        Eltahy: "45 min",
        Elsouba: "60",
        components: '- الدجاج : دجاجة\nالبرتقال : 1 حبة (مقطع)\nعصير البرتقال : كوب\nورق غار : 2 ورقة\nالبصل : 1 حبة (مفروم)\nبرش البرتقال : ملعقة صغيرة\nزعتر مجفف : ربع ملعقة صغيرة\nالزيت النباتي : 2 ملعقة صغيرة\nالزبدة : 2 ملعقة صغيرة\nملح : حسب الرغبة\nفلفل أسود : حسب الرغبة\nالثوم : فصّان\nصلصة طماطم : 2 ملعقة كبيرة',
        Step: "قطعي الدجاجة إلى نصفين طوليا.\nضعي الزيت في قدر على النار\nواقلي الدجاج من جميع الجهات ثم ضعيه جانبا.\nفي القدر نفسه\nحمري البصل المفروم مع الثوم حتى يذبل.\nأضيفي برش برتقال وعصيره\nوصلصة الطماطم\nوورق الغار\nوالزعتر الجاف\nواتركي المقدار يغلي على النار لمدة 5 دقائق.\nأضيفي الدجاج وغطيه حتى ينضج\nثم قدميه وزينيه بقطع البرتقال.",
        video: "https://www.youtube.com/watch?v=jHBpvyElA4k",
        categortType: 1,

    },
    {
        Image: require("../img/202109041239143914.jpg"),
        name: "ارز معمر",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: 'يتم معايرة الأرز بنصف كمية البرام\nلتر حلب\nكريمة لباني\nزبدة\nقشطة\nملح',
        Step: "يتم غسل الأرز جيدا قبل أن يصف\nى قومي بوضع كمية الأرز والتي تكون نصف حجم البرام في الطاجن\nيوضع عليه معلقة كبيرة من الزبدة البقري أو الفلاحي\nعلبة كريمة لباني صغيرة للطبخ قومي بوضعها على الأرز\nيغطى تماما بالحليب المغلي على أن يغمر الأرز به\nثم يوضع عليه الملح فقط حسب الرغبة\nملحوظة: ا يوضع عليه توابل لكي يظهر به طعم القشطة والزبدة في الطاجن فلا يتم وضع أي توابل غير الملح\nثم توضع في الفرن على درجة حرارة متوسطة 180 درجة حتى يصل الأرز بأن يتشرب من الحليب تماما توضع القشطة على وجه الطاجن\nيترك في الفرن حتى يحمر وجه برام الأرز المعمر ويكتمل نضوجه\nيمكن وضع قطع من الحمام مسلوق أو قطع من اللحم البتلو المسلوق أو كبد الدجاج مسلوقة أو صدور فراخ بقلب الطاجن\nيمكنك إضافة جوز الطيب حسب الرغبة",
        video: "https://www.youtube.com/watch?v=IHWqrDccHuA",
        categortType: 4,

    },
    {
        Image: require("../img/12b1ffc4d25e01c114fecc8f82d4693b_w750_h500.jpg"),
        name: "سلطة البطاطس المقلية بالخل والثوم",
        view: true,
        time: " 15 min",
        Elta7der: '5 min',
        Eltahy: "10 min",
        Elsouba: "20",
        components: '- للصوص :\nالطحينية : ربع كوب\nزبادي : 4 ملعقة صغيرة\nالثوم : فصّان (مهروس)\nعصير الليمون : نصف حبة\nالخل : ملعقة صغيرة\nالماء : 2 ملعقة كبيرة\nملح : نصف ملعقة صغيرة\n- خس : كوب ونصف (مقطع)\n- البطاطس : 1 حبة (مقطعة مكعبات ومقلية)\n- طماطم : 1 حبة (مقطعة)',
        Step: "ضعي الخس المقطع\nوالبطاطس المقلية\nوالطماطم في طبق التقديم.\nاخلطي الزبادي مع الماء\nوالطحينية\nوعصير الليمون\nوالخل\nوالملح\nوالثوم جيدا في وعاء صغير.\nوزعي المزيج فوق خليط السلطة وزيني بالبقدونس وقدميها.",
        video: "https://www.youtube.com/watch?v=YEmkiZPEKIM",
        categortType: 3,

    },
    {
        Image: require("../img/20211211164112024.jpg"),
        name: "بط مشوي بدبس الرمان",
        view: true,
        time: " 60 min",
        Elta7der: '10 min',
        Eltahy: "50 min",
        Elsouba: "60",
        components: 'بط\nملح وفلفل اسود\nبابريكا\nكركم\nكاري\nزنجبيل\nصوص حار\nم. ك دبس الرمان\nخل\n2 بصله\n1 فلفل رومي\n1 جزره كبيره\n2 طماطم\n1 مرقه ماجي فورى\nورق لورى وحبهان ومستكه\n1/2 كوب شوربة بط\nسكر\n1 مرقة دجاج',
        Step: "يغسل البط وينقع في خل وملح ثم نضع ماء يغلى وعند الغليان نضع ورق اللورى والحبهان والمستكه ونشطف البط ونفتحه فتحات بالعرض بالسكين لسهوله السوا ونسقطه في الماء.\nنزيل الريم ثم نضع ملح وفلفل وماجى والسكر ونهدئ النار ونغطيه ونتركه حتى قرب السوا لمدة ساعة ونص ساعتين حسب حجم البطه.\nاضرب طماطم وبصلايه وبقية التوابل في الكبه حتى تمام التجانس و ننشل البطه من الشربه ونتبلها بالخلطه دى ونتركها ساعتين في التتبيله.\nنحضر صينيه نقطع فيها البصل والجزر والفلفل والطماطم دوائر ونضع ملح وفلفل اسود ونقلب ونضع البط فوقيها ثم نضع نص كوب الشوربه وندخلها الفرن مدة 15 : 20 دقيقه حتى يحمر الوجه. وبالف هنا وشفا",
        video: "https://www.youtube.com/watch?v=a1BVwmbtHkg",
        categortType: 4,

    },
    {
        Image: require("../img/104-233834-how-sambosk-works-with-cheese-2.png"),
        name: "سمبوسه بالجبنه",
        view: true,
        time: " 20 min",
        Elta7der: '10 min',
        Eltahy: "10 min",
        Elsouba: "50",
        components: '1/2 كيلو سمبوسه\nقطعتين جبنه قريش\n2 فلفل اخضر متقطع\n1 بصله متوسطه متقطعه\nرشة فلفل اسود\nرشة ملح\nرشة كمون\nرشة كزبره\nمعلقه صغيره زيت زيتون او نباتي',
        Step: "هنضيف كل المكونات ع الجبنه ونخلطهم كويس\nهنحشي السمبوسه ع شكل مثلثات\nونسخن الزيت ونحمرها فيها الي ان تأخذ اللون الذهبي",
        video: "https://www.youtube.com/watch?v=tYb2mKyU9kw",
        categortType: 4,

    },
    {
        Image: require("../img/downloadhamam.jpg"),
        name: "حمام محشى",
        view: true,
        time: " 70 min",
        Elta7der: '30 min',
        Eltahy: "40 min",
        Elsouba: "80",
        components: 'جوز حمام\nكوب ارز\nكبد الحمام\nبصل\nnمعلقه ملح وفلفل\nnمعلقه كمون\nnمعلقه بهارات\nرشه نعناع ناشف',
        Step: "نقوم بتنضيف الحمام وغسله جيدا مع فصل جلد البطن عن اللحم حتى يسهل الحشو\nفى حله نضع معلقه كبيره سمنه ثم ننزل بكبد الحمام وبصله متقطعه صغير وملح وفلفل وكمون ونقلبهم شويه ثم ننزل بالارز المغسول ثم رشه النعناع ونضيف ماء مغلى نصف مقدار الارز لكى يستوي نصف سوا فقط ثم نتركه يبرد قليلا ثم نحشو به الحمام بين الجلد والبطن وايضا نحشو قليل من الارز فى داخل الحمام ثم نغلق الحمام (بتكتيف الارجل داخل بعض)\nيسلق فى ماء مغلى به بصله وشريحه جزر وملح وفلفل وحبهان وورق لوري واي مطيبات تفضلينها\nيترك لينضج ثم نخرجه ونحمره في سمنه او ندهنه من الخارج بالسمن وندخله الفرن تحت الشوايه ليحمر ثم يقدم بالف هنا ",
        video: "https://www.youtube.com/watch?v=psZA8rf00NI",
        categortType: 4,

    },
    {
        Image: require("../img/downloadl7maa.jpg"),
        name: "ورقة لحم بالخضروات",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '2 بطاطس كبيرة حلقات\n2 بصل جوليان\n2 فلفل رومي حلقات\nقرن فلفل حامي\n2 جزر حلقات\n3 طماطم حلقات\nم صلصة\n5 فص ثوم حلقات\n3 م زيت\n2 مكعب زبدة\nم ص ملح\n1/2 م ص بهار لحم\n1/2 م ص فلفل اسود\n1/2 كيلو لحم بفتيك مدقوق',
        Step: "تتيل اللحم بملح وفلفل وبهار وتشوح في الزيت والزبدة\nندعك البصل والفلفل الحامي مع ملح وفلفل وبهار باليد\nتجهز الخضروات وتخلط جميعها\nنفرش ورقتين فويل عكس بعض في صينية وفوقها ورقتين زبدة عكس بعض ونضع جزء من اللحم ثم نص الخضار ثم نرص اللحم ثم باقي الخضار\nتغلق الورق جيدا عليها\nتدخل فرن مسخن اعلى حرارة ربع ساعة ثم نهدا النار ١٨٠ ساعة ثم تقلب وتشق على شكل زائد",
        video: "https://www.youtube.com/watch?v=n0LriJQbzok",
        categortType: 5,

    },
    {
        Image: require("../img/downloadsopet.jpg"),
        name: "سبيط مقلي",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "50",
        components: 'ك سبيط (حبار) مقطع\n5 فصوص ثوم\n2 قرن فلفل\nمعلقة ملح\nمعلقة شطة\nمعلقة كمون\nمعلقة كزبرة\n½كوبية دقيق\nمعلقة ثوم بودرة وبصل بودرة\nكوبية زيت\n2قرن فلفل حامي\nمعلقة خل وليمون',
        Step: "هنجيب الكبة نحط الثوم والتوابل والملح والثوم والبصل والفلفل\nوالليمون والخل ونضربهم\nبعد كدة نقطع السبيط قطع ونغسلة ونحطة في الخلطة ساعة\nبعد كدة نحطة في الدقيق\nونقلي السبيط والفلفل",
        video: "https://www.youtube.com/watch?v=vBsiEA0Cg24",
        categortType: 6,

    },
    {
        Image: require("../img/saidaya.jpg"),
        name: "رز صياديه",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '1/2 كيلو رز\nبصل مفروم\nملح\nكمون\nمكعب مرقه دجاج',
        Step: "نقوم بتحمير البصل للون البنى\nثم نضع الرز عليه ونقلب ثم نضع الملح والكمون ومكعب المرقه ونقلب جيدا\nثم نضع المياه السخنه ونتركه على نار متوسطه ثم نهدى النار ونتركه للتسويه",
        video: "https://www.youtube.com/watch?v=I_mdyPAQW18",
        categortType: 4,

    },
    {
        Image: require("../img/20171120020043043.jpg"),
        name: "النجرسكو",
        view: true,
        time: " 80 min",
        Elta7der: '20 min',
        Eltahy: "60 min",
        Elsouba: "60",
        components: 'مكرونة شرايط مسلوقة.\nنصف كيلو صدور دجاج مقطعة ومسلوقة.\nمشروم طازج مقطع شرائح (اختياري).\n1 ملعقة زيت.\n3 ملاعق كبيرة دقيق.\n7 ملاعق كبيرة لبن بودرة خالي الدسم.\n1 لتر مرقة منزوعة الدسم.\nجبنة موزاريلا مبشورة للوجه.\nجوزة الطيب.\nبودرة ثوم أو بصل.\nملح وفلفل.',
        Step: "تسلق المكرونة في ماء مغلي مملح بدون إضافة زيت\nويراعى سلقها 3/4 سلقة.\nلعمل البشاميل نضع 1 ملعقة دقيق مع ملعقة الزبدة والزيت حتى يصل إلى اللون الذهبي الفاتح\nثم تضاف المرقة بالتدريج مع التقليب المستمر\nويذاب اللبن البودرة والدقيق مع باقي المرقة وتكون باردة.\nويصب خليط المرقة على الدقيق والزبدة\nمع التقليب المستمر\nثم يضاف الملح والفلفل وجوزة الطيب والثوم البودرة\nويترك على النار حتى القوام المظبوط.\nبعد ذلك يضاف المشروم للبشاميل ويقلب\nثم يضاف الدجاج ويقلب في الصوص\nويضاف قليل من الجبنة للصوص.\nبودرة الثوم رائحتها اقوى من بودرة البصل\nلذا كميتها بتكون أقل ويمكن إضافة بصلة مبشورة ويتم تحميرها مع الحشوة\nولكن بيكون القوام مرملا أكثر.\nلإنهاء وصفة النجرسكو اللايت\nندهن وعاء بايركس الفرن بالزيت\nوتوضع المكرونة المسلوقة (ومقلبة في ملعقة زيت)\nثم تضاف الحشوة مع الصوص\nثم تضاف القليل من الجبنة الموزاريلا على الوجه.\nونضعها في الفرن على 200 درجة حتى تصل إلى اللون الذهبي.",
        video: "https://www.youtube.com/watch?v=DWBJcbSAf9Q",
        categortType: 2,

    },
    {
        Image: require("../img/images.jpg"),
        name: 'فتة باللحمة المفرومة',
        view: true,
        time: " 25 min",
        Elta7der: '5 min',
        Eltahy: "20 min",
        Elsouba: "30",
        components: 'لحمة مفرومة\nبصل\nطماطم\nثوم\nفلفل أحمر\nكمون\nفلفل أسود\nملح',
        Step: "'يُقلى البصل والثوم في زيت حتى يذبلان ثم يُضاف إليهم اللحمة المفرومة ويُقلى الكل. تُضاف الطماطم المقطعة إلى الخليط ويُترك لمدة 5 دقائق حتى تنضج ثم يُتبل بالكمون والفلفل الأسود والملح.'",
        video: "https://www.youtube.com/watch?v=zhPV1SI7ukc",
        categortType: 4,

    },
    {
        Image: require("../img/15489737431619515555.jpg"),
        name: "كفتة",
        view: true,
        time: " 30 min",
        Elta7der: '10 min',
        Eltahy: "20 min",
        Elsouba: "50",
        components: 'لحمة مفرومة\nبصل\nثوم\nبقدونس\nكمون\nفلفل\nملح\nطحين\nزيت',
        Step: 'تُخلط اللحمة المفرومة مع البصل المفروم والثوم والبقدونس والكمون والفلفل والملح والطحين. تُشكل الخليط إلى كفتة وتُقلى في الزيت حتى تنضج.',
        video: "https://www.youtube.com/watch?v=0l9HiHwM5Vc",
        categortType: 4,

    },
    {
        Image: require("../img/download(1).jpg"),
        name: "طاجن مكرونة بالكبدة",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '½ ك كبدة مقطعة ومحمره\nمعلقة سمنة\nمعلقة ملح شطة بهارات\nبصلة مقطعة\n2 قرن فلفل مقطع\n½ مكرونة مقطعة\n2 معلقة صلصة',
        Step: "هنجيب حلة ونحط السمنة ونحط البصل ونقلب\nبعد كدة نحط الصلصة والطماطم\nوالتوابل والبهارات ونسيبة تسبك\nهنجيب الطاجن ونحط الكبدة ونحط المكرونة ونحط الفلفل\nونحط التسبيك وندخلة الفرن",
        video: "https://www.youtube.com/watch?v=_Mn_V9atVCM",
        categortType: 2,

    }
    ,
    {
        Image: require("../img/kepdaaaa.jpg"),
        name: "كبده اسكندراني",
        view: true,
        time: " 30 min",
        Elta7der: '10 min',
        Eltahy: "20 min",
        Elsouba: "30",
        components: 'كبده بلد\nيثوم مفروم\nعصير ليمون\n2 معلقه خل\nملح وفلفل\nكمون\nشطه',
        Step: "حطيت كل التوابل مع بعض وسبتها لحد ما حضرت الكبده\nمقطعة الكبده وضيفتهم سبتهم حوالي ربع ساعة وفي طاسه تيفال فيها حوالي 2 ملعقة كبيره زيت سخن نزل بالكبده وسبتها على النار 10 دقائق ونزلت عليها بالفلفل الاخضر وقلبتها وقفلت النار",
        video: "https://www.youtube.com/watch?v=J84l8JxnTW0",
        categortType: 4,

    }
    ,
    {
        Image: require("../img/okra-1400x788.jpg"),
        name: "البامية",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "60",
        components: '2 ملعقة كبيرة زيت زيتون\n1 حبة بصل مفرومة\n2 فص ثوم مهروس\n200 غرام بامية\nرشة ملح\nرشة فلفل حار\nرشة فلفل أسود\nرشة بابريكا\n1 ملعقة كبيرة معجون طماطم\n½ كوب ماء\n¼ كوب عصير ليمون حامض\nكزبرة خضراء للزينة',
        Step: "سخني الزيت في قدر على نار متوسطة. أضيفي البصل وحمريه لمدة 10 دقائق حتى يصبح لونه ذهبيا.أضيفي الثوم وحمريه لمدة دقيقة ثم أضيفي البامية وحركيها باستمرار.\nامزجي معجون الطماطم مع نصف كوب ماء\nوقلّبي المزيج جيدا.\nأضيفي الملح\nالفلفل الحار\nالفلفل والبابريكا إلى الصلصة وقلّبي المزيج.\nأضيفي مزيج الصلصة إلى القدر.\nغطّي القدر واتركيه على نار هادئة لمدة 30 دقيقة مع التقليب كل 5 دقائق",
        video: "https://www.youtube.com/watch?v=ls1nodywhuA",
        categortType: 4,

    }
    ,
    {
        Image: require("../img/kkkk.jpg"),
        name: "فطيرة الدجاج",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "70",
        components: 'زيت الزيتون للقلي\n1 بصل مقطع شرائح\n2 فص ثوم مفروم\n3 كوب صدر دجاج مطبوخ ومقطع شرائح\n1 كوب معجون طماطم\nملح حسب الذوق\nفلفل أسود حسب الذوق\nبقدونس مفروم حسب الذوق\n2 كوب حليب\n1 كوب زيت\n2 ملعقة كبيرة زبدة\n5 بيضات\n2 بطاطس مطهية\nمهروسة\n2 كوب دقيق قمح\n1 ملعقة كبيرة بايكينج باودر\n1 كوب جبن كريمي برازيلي\n½ 1 كوب جبن موزاريلا',
        Step: "في مقلاة\nحمري البصل والثوم\nثم أضيفي الدجاج واطهيه حتى يصبح ذهبي اللون.\nأضيفي معجون الطماطم ثم تبليه بالملح\nالفلفل والبقدونس المفروم. اتركي المزيج جانبا.\nفي الخلاط\nاخفقي الحليب مع الزيت\nالزبدة\nالبيض والبطاطس المهروسة. انقلي الخليط إلى وعاء ثم أضيفي دقيق القمح والبايكينج باودر مع رشة من الملح.\nاسكبي نصف العجين في صحن فرن مدهون بالزبدة\nثم وزعي خليط الدجاج فوقه بالتساوي باستخدام ملعقة\nثم أضيفي الجبن الكريمي وجبن الموزاريلا.\nغطي الحشو بالعجين المتبقي ثم اخبزي الفطيرة في فرن مسخّن مسبقا بدرجة حرارة 350 درجة فهرنهايت لمدة 30 دقيقة.",
        video: "https://www.youtube.com/watch?v=QptPLrcVXcM",
        categortType: 1,

    }
    ,
    {
        Image: require("../img/download(2).jpg"),
        name: " كفتة الارز",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '¾ كوب لحم عجل مفروم\n¾ كوب أرز مطحون\n2 بندورة\n1 بصل\n2 بطاطس\n1 ملعقة كبيرة بقدونس\n2 ملعقة كبيرة رب بندورة (معجون طماطم)\n¾ كوب زيت نباتي\n1 ملعقة صغيرة قرفة\n1 ملعقة صغيرة بهار حلو\n1 ملعقة صغيرة جوزة الطيب\n1 ملعقة صغيرة كمون\n1 ملعقة صغيرة ملح\n6 فص ثوم\n1 مكعب مرق دجاج\n½1 كوب ماء',
        Step: "قطّعي المكونات.ضعي ½ كمية كل من (البصل\nالبقدونس\nالثوم) وعليهم أضيفي الطحين\nالتوابل ثم قومي بالخلط.\nشكّلي اللحم على شكل أصابع وضعيهم بصحن مدهون بالزيت.\nفي مقلاة سخّني الزيت ثم قلي أصابع الكفتة من كل الجهات.\nارفعيهم من على النار.\nفي وعاء سخّني ملعقتين زيت ثم أضيفي باقي البصل والثوم وقومي بالتقليب.\nأضيفي الطماطم وبعد أن تنهرس الطماطم أضيفي مكعبات البطاطس ومعجون الطماطم مع الماء\nمرق الدجاج والكفتة اتركيهم حتى تنضج البطاطس بالكامل.\nارفعي الوعاء من النار وزيّني الصحن بالبقدونس عند التقديم",
        video: "https://www.youtube.com/watch?v=t2xL-EKSiQU",
        categortType: 4,

    }
    ,
    {
        Image: require("../img/0kabsayemen.jpg"),
        name: "الكبسة اليمني",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "60",
        components: '1 كيلو غرام لحم مع العظام\n4 كوب أرز بسمتي منقوع بالماء لمدة ساعة قبل الطهي\n1 معلقة كبيرة خل\n1 معلقة كبيرة بهارات مشكلة\n1 كوب ماء\n1 ملعقة كبيرة ملح\n4 حبات هيل\n4 عود قرفة\n4 كبش قرنفل\n3 حبة بصل كبيرة مقطعة حلقات\n200 غرام زبادي\n1 ملعقة صغيرة زعفران\nمنقوع فى قليل من الماء\n1 معلقة كبيرة زنجبيل',
        Step: "فى قدر الضغط على النار\nأضيفي جميع المكونات عدا الأرز و الزعفران.\nقلبي المزيج ثم غطى القدر واتركيه على النار حتى ينضج اللحم تماما.\nفى هذه الأثناء\nاسلقى الارز حتى يصبح نصف ناضجا.\nبعد نضج اللحم\nانقلي محتويات قدر الضغط إلى قدر عادى عميق.\nأضيفى الأرز فوق خليط اللحم\nثم سخني القدر على النار.\nأضيفى الزعفران على الوجه\nثم غطي القدر واتركيه على النار\nحتى ينضج الأرز تماما.\nقدمي الكبسة ساخنة",
        video: "https://www.youtube.com/watch?v=k0GCjA_TohI",
        categortType: 3,

    }
    ,
    {
        Image: require("../img/0Hawawshi.jpg"),
        name: "الحواوشي",
        view: true,
        time: " 40 min",
        Elta7der: '10 min',
        Eltahy: "30 min",
        Elsouba: "30",
        components: '½ كيلو لحم مفروم\n250 غ دهن خروف\nبصلة وسط مفرومة ناعم\n2 فلفل اخضر\nرشة ملح\nرشة كمون\nرشة فلفل اسود\n2 حبهان\n¼ كوب زيت\n2 فلفل اخضر\n5 أرغفة خبز',
        Step: "افرمي البصل ناعما جدا و اتركيه جانبا فى وعاء عميق\nقطعى الفلفل قصطع صغيرة و ضيفيه بالوعاء على البصل\nضيفى الملح و الكمون و الحبهان و الفلفل\nضيفى اللحم المفروم و قومى برش قطعة من دهن الخروف على الخليط\nقومى بالتقليب و الخلط جيدا لتمتزج كل المكونات معا\nدخلى الوعاء الثلاجة لمدة ساعة\nاحضرى الخبز بعد مرور الساعة و اصنعى فى كل خبز من الجانب فتحة صغيرة ادخلى من خلالها الحشو و افرديه داخل الرغيف\nكررى الامر مع كل الارغفة الحشو .\nادهنى الخبز من اعلى و من اسفل بالزيت\nسخنى الفرن جيدا على نار متوسطة\nرصى الخبز فى صينية و ادخليها الفرن على الشبكة و اتركيه حتى تمام النضج (من ربع لتلت ساعة) .\nيقدم الحواوشي ساخنا ",
        video: "https://www.youtube.com/watch?v=iT0BPY3H-A0",
        categortType: 1,

    }
    ,
    {
        Image: require("../img/3eeegga.jpg"),
        name: "عجة البيض",
        view: true,
        time: " 20 min",
        Elta7der: '5 min',
        Eltahy: "15 min",
        Elsouba: "20",
        components: '4 بيضات\nرشة ملح\nرشة بقدونس5 ملعقة كبيرة زيت أو زبدة\n1 مكعب مرق دجاج\n1 ملعقة صغيرة فلفل أسود\nرشة نعناع\n¼ كوب بصل أخضر مفروم فرما ناعما\n2 حبة فلفل حلو مفرومة فرما ناعما',
        Step: "فى مقلاة غير لاصقة على النار\nذوبى الزبدة ثم أضيفى الخضار بعد تقطيعه ومكعب مرق الدجاج\nقلبي المزيج.\nأضيفي الفلفل الاسود وقومي بتغطية المقلاة\nاستمري في الطهي على نار هادئة لمدة 5-10 دقائق مع التحريك من حين لآخر حتى تنضج الخضروات على البخار.",
        video: "https://www.youtube.com/watch?v=rPQN7xjy7Yw",
        categortType: 4,

    }
    ,
    {
        Image: require("../img/download(3).jpg"),
        name: "فطيرة مشلتت",
        view: true,
        time: " 50 min",
        Elta7der: '30 min',
        Eltahy: "20 min",
        Elsouba: "70",
        components: '1 كيلو دقيق\n1 كوب سكر\n1 كوب ماء\n½ كيلو زبدة\n1 ملعقة صغيرة بايكينج باودر',
        Step: "احضري وعاء وضعي السكر\nالدقيق معا.قطّعي الزبدة قطع صغيرة واضيفيها إلى خليط الدقيق واعجنيهم بأطراف أصابعك حتى تتكون عجينة يابسة.\nضعي العجينة في مكان مرشوش بالدقيق وافرديها بالنشابة حتى تصبح بعرض ½ سم\nرشّيها بالماء بين الحين والآخر حتى لا تلتصق بالسطح.\nقطّعي العجينة لعدة قطع متساوية\nافردي كل قطعة حتى تصبح رقيقة جدا.\nكرّري العملية حتى نفاذ القطع.\nاحضري صينية دائرية مدهونة بالزبدة وضعي قطعة من العجين المفرود في الصينية ثم ادهنيها بالزبدة ثم ضعي قطعة اخرى وادهنيها بالزبدة\nوهكذا حتى تنتهي الكمية.\nاخبزيها في الفرن على درجة حرارة 180 درجة حتى يحمر ثم قدميه ساخنا.",
        video: "https://www.youtube.com/watch?v=a4sBaw0Xrbo",
        categortType: 7,

    }
    ,
    {
        Image: require("../img/kapapshamii.jpg"),
        name: "كباب شامي",
        view: true,
        time: " 45 min",
        Elta7der: '25 min',
        Eltahy: "20 min",
        Elsouba: "30",
        components: 'حبة بصل مبروشة\n300 غ لحمة مفرومة\n½ كوب كزبرة\n½ ملعقة صغيرة بهار كاري\n½ ملعقة صغيرة قرفة\nبيضة\n½ كوب طحين\nبهار أسود حسب الرغبة\nملح حسب الرغبة\nزيت نباتي\n⅔ كوب عصير ليمون حامض\n2 فص ثوم',
        Step: "1.في صحن ضعي كل المقادير (ماعدا الزيت\nالثوم\nوعصير الليمون) وقومي بالخلط.\n2.شكّلي الخليط كما بالفيديو وضعيهم بصحن.\n3.أدخلي الصحن الثلاجة لمدة 20 دقيقة.\n4.في مقلاة على النار سخّني الزيت ثم قلّي الكباب.\n5.في مقلاة أخرى ضعي عصير الليمون الحامض والثوم وقومي التقليب.\n6.أضيفي الكباب بالمقلاة وقومي بالتحريك.",
        video: "https://www.youtube.com/watch?v=pUadgLI9tb0",
        categortType: 5,

    }
    ,
    {
        Image: require("../img/0Garlic.lemon.steak.jpg"),
        name: " اللحم بالثوم والليمون",
        view: true,
        time: " 70 min",
        Elta7der: '30 min',
        Eltahy: "40 min",
        Elsouba: "70",
        components: '400 غ لحم مقطع\n½ ملعقة صغيرة بهار أسود\n½ ملعقة صغيرة زنجبيل\n½ ملعقة صغيرة بودرة ثوم\n½ ملعقة صغيرة بهار تشيلي\nرشة ملح\nملعقة كبيرة زيت زيتون\n3 ملاعق كبيرة طحين\n2 فص ثوم\nملعقة كبيرة خل التفاح\nكوب مرق اللحم\n3 ملاعق كبيرة عصير ليمون حامض\n3 ملاعق كبيرة بقدونس\nحبة بصل مقطعة',
        Step: "1.ضعي اللحم بصحن غويط.\n2.تبّليه بالبهار الأسود\nبهار تشيلي\nزنجبيل\nبودرة الثوم\nالملح\nوزيت الزيتون ثم قومي بالتقليب.\n3.أضيفي الطحين\nوقومي بإعادة التقليب.\n4.في مقلاة على النار ضعي زيت الزيتون.\n5.أضيفي اللحم وقومي بالتقليب حتى يتغير لونه.\n6.أضيفي الثوم وقومي بالتحريك.\n7.أضيفي خل التفاح\nمرق اللحم\nعصير الليمون الحامض واستمري بالتحريك.\n8.أضيفي البقدونس وقومي بالتقليب.\n9.ارفعي المقلاة من على النار بعد تمام نضج اللحم.\n10.في مقلاة أخرى على النار سخّني الزيت ثم ضعي البصل وقومي بالتقليب حتى يتغير لونه.\n11.زيّني وجه اللحم بشرائح البصل التي حضرتيها.\n12.قدميها ساخنة.",
        video: "https://www.youtube.com/watch?v=EFu7QZG-luI",
        categortType: 5,

    }
    ,
    {
        Image: require("../img/maxresdefault-1-22.jpg"),
        name: "كبة اللحم بالبرغل",
        view: true,
        time: " 80 min",
        Elta7der: '30 min',
        Eltahy: "50 min",
        Elsouba: "70",
        components: '1 كيلو لحم مفروم\n1 بصلة مفرومة\n1 ملعقة بهارات\n1 ملعقة ملح\n1 ملعقة فلفل\n2 كوب برغل ناعم\n1 ملعقة كمون\n2 ملعقة معجون فلفل أحمر\n2 ملعقة صنوبر مطحون\nزيت للقلي',
        Step: "احضري وعاء واخلطي البرغل مع اللحم\nالملح\nالفلفل\nالبهارات\nالبصل\nالكمون\nالصنوبر ومعجون الفلفل الأحمر.\nشكّلي الخليط على شكل كرات ثم قلّيها في الزيت حتى تصبح بنية اللون.\nقدميها ساخنة.",
        video: "https://www.youtube.com/watch?v=gZx3iqpAbN8",
        categortType: 5,

    },
      // {
      //   Image: require("../img/"),
      //   name: "",
      //   view: true,
      //   time: " 40 min",
      //   Elta7der: '10 min',
      //   Eltahy: "30 min",
      //   Elsouba: "30",
      //   components: '',
      //   Step: "",
      //   video: "",
      //   categortType: 1,

      // }
    ])

  const [Category, SetCategory] = useState(
    [
      {
        id: 1,
        name: "الدجاج",
        img: require("../img/pngwing.png"),//حط صور صح
        choose: false,

      }
      ,
      {
        id: 2,
        name: "مكرونات",
        img: require("../img/Pasta-PNG-File-Download-Free.png"),
        choose: false,


      }
      ,
      {
        id: 3,
        name: "اطباق عربيه",
        img: require("../img/catarab.png"),
        choose: false,


      }
      ,
      {
        id: 4,
        name: "اطباق مصريه",
        img: require("../img/catEgy.png"),
        choose: false,


      }
      ,
      {
        id: 5,
        name: "لحوم",
        img: require("../img/kindpng_4344308.png"),
        choose: false,
      }
      ,
      {
        id: 6,
        name: "أسماك",
        img: require("../img/pngwingfish.png"),
        choose: false,
      },
      {
        id: 7,
        name: "ٌفطائر ومعجنات",
        img: require("../img/djfdthremovebg.png"),
        choose: false,
      }
    ]
  )
  const [IconSearch, setIconSearch] = useState(true)
  const [search, setsearch] = useState("")




  const ref = React.useRef(null)
  const [animationDisplay, setanimationDisplay] = useState(false)

  const makesearch = (searchText) => {
    let list = Food
    let count = 0

    for (let i = 0; i < list.length; i++) {
      if (((list[i].name).toUpperCase()).includes(searchText.toUpperCase())) {
        list[i].view = true
      }
      else {
        list[i].view = false
        count++

      }
    }
    if (count == list.length) {
      setanimationDisplay(true)
    }

    // 
    if (count != list.length) {
      setanimationDisplay(false)

    }
    setFood(list)
    count = 0
  }


  const [CategoryReturn, setCategoryReturn] = useState([])
  const [showView, setshowView] = useState(true)
  const [indexName, setindexName] = useState()

  const chooseCategory = (index) => {
    let list = Category
    let arr = Food
    if (list[index].choose == true) {
      setshowView(true)
      list[index].choose = false

    }
    else {

      for (let i = 0; i < list.length; i++) {
        list[i].choose = false
      }
      list[index].choose = true
      setshowView(false)
      var ret = []
      for (let i = 0; i < arr.length; i++) {
        if (list[index].id == arr[i].categortType) {
          //  let newObj={
          //   Image: arr[i].Image,
          //   name: arr[i].name,
          //   view: arr[i].view,
          //   time: arr[i].time,
          //   Elta7der: arr[i].Elta7der,
          //   Eltahy: arr[i].Eltahy,
          //   Elsouba: arr[i].Elsouba,
          //   components: arr[i].components,
          //   Step: arr[i].Step,

          //   }
          //   ret.push(newObj)
          ret.push(arr[i])
        }

      }
      // console.log(ret)
      setCategoryReturn(ret)
      // ret = []
    }
    setCategoryReturn(ret)
    SetCategory(list)
    setindexName(index)

  }

  const navigation = useNavigation();

  return (
    <>
      <View style={{ backgroundColor: COLORS.pramary, flex: 1 }}>
        <ScrollView>
          <View style={styles.Header}>
            <View>
              <View></View>
              {IconSearch ? (
                <>
                  <Animatable.View
                    animation='slideInLeft' >
                    <TouchableOpacity
                      onPress={() => {

                        setIconSearch(false);
                      }}>
                      <Ionicons name='ios-search-circle' size={60} color={COLORS.orange} />
                    </TouchableOpacity>

                  </Animatable.View>
                </>
              ) : (
                <Animatable.View style={styles.SearchTextView}
                  animation='flipInY' >
                  <TextInput style={styles.SearchTextInput}
                    placeholder={'البحث عن الأكلات...'}
                    placeholderTextColor={COLORS.grayFont}
                    onChangeText={(value) => {
                      makesearch(value)

                      setsearch(value)
                    }}


                    value={search} />
                  <TouchableOpacity onPress={() => {
                    setIconSearch(true);
                  }}>

                    <Ionicons name='search' size={ICONSSIZE.xlIcon} color={COLORS.pramary} />
                  </TouchableOpacity>

                </Animatable.View>
              )}
            </View>

            <View style={styles.category_View}>
              <ScrollView horizontal>
                {Category.map((Category, index) =>
                  <TouchableOpacity style={Category.choose ? styles.category_chosen_Box : styles.category_Box}
                    onPress={() =>
                      chooseCategory(index)

                    }
                  >
                    <Image source={Category.img} style={{ width: width / 5, height: height / 12, resizeMode: "contain" }} />
                  </TouchableOpacity>
                )}
              </ScrollView>
            </View>
            {showView ? (
              <View style={styles.food_View}>
                <View style={styles.Headerstarred}>
                  <Text style={styles.textHeaderstarred}>
                    الوصفات
                  </Text>
                  {/* <Text style={styles.textHeaderstarred2}>
رؤية الكل
</Text> */}
                </View>
                {animationDisplay ?
                  (
                    <>
                      <View style={{ alignItems: "center", justifyContent: "center", alignSelf: "center", width: width, height: height / 1.8 }}>
                        <LottieView
                          ref={this.ref}
                          source={require("../lottie/search_empty.json")}
                          loop={true}
                          autoPlay={true}
                          speed={1.5}
                        // style={{ alignSelf: "center" }}
                        />
                      </View>
                    </>
                  ) : (
                    <>
                      {Food.map((item, index) =>
                        item.view ? (
                          <View style={styles.meal_View}>
                            <Image source={item.Image} style={styles.meal_image}
                              resizeMode={"cover"} />
                            <View style={{ width: width / 2.4, height: height / 12, alignItems: "center", justifyContent: "center" }}>
                              <Text style={styles.meal_name}>
                                {item.name}
                              </Text>
                            </View>
                            <View style={styles.view_time}>
                              <Text style={styles.text_time}>
                                {item.time}
                              </Text>
                              <Ionicons name='md-time' style={{ alignSelf: "center" }} size={ICONSSIZE.smIcon} color={COLORS.ButtonWhite} />
                            </View>
                            <View style={styles.option_view}>
                              <TouchableOpacity
                                onPress={() => {
                                  navigation.navigate("Photo_page", {
                                    name: item
                                  })
                                }
                                }
                                style={styles.button_option}>
                                <Text style={styles.button_text}>
                                  الطريقة
                                </Text>
                              </TouchableOpacity>
                              <TouchableOpacity onPress={() => {
                                navigation.navigate("WbeView", {
                                  name: item
                                })
                              }
                              }
                                style={styles.button_option}>
                                <Text style={styles.button_text}>
                                  الفيديو
                                </Text>
                              </TouchableOpacity>

                            </View>


                          </View>

                        ) : (
                          null
                        )



                      )}
                    </>
                  )}



              </View>
            ) : (
              <View style={styles.food_View}>
                <View style={styles.Headerstarred}>
                  <Text style={styles.textHeaderstarred}>
                    {Category[indexName].name}
                  </Text>
                  {/* <Text style={styles.textHeaderstarred2}>
                  رؤية الكل
                </Text> */}
                </View>
                {CategoryReturn.map((items, index) =>
                  <View style={styles.meal_View}>
                    <Image source={items.Image} style={styles.meal_image}
                      resizeMode={"cover"} />
                    <View style={{ width: width / 2.4, height: height / 12, alignItems: "center", justifyContent: "center" }}>
                      <Text style={styles.meal_name}>
                        {items.name}
                      </Text>
                    </View>
                    <View style={styles.view_time}>
                      <Text style={styles.text_time}>
                        {items.time}
                      </Text>
                      <Ionicons name='md-time' style={{ alignSelf: "center" }} size={ICONSSIZE.smIcon} color={COLORS.ButtonWhite} />
                    </View>
                    <View style={styles.option_view}>
                      <TouchableOpacity
                        onPress={() => {
                          navigation.navigate("Photo_page", {
                            name: items
                          })
                        }
                        }
                        style={styles.button_option}>
                        <Text style={styles.button_text}>
                          الطريقة
                        </Text>
                      </TouchableOpacity>
                      <TouchableOpacity onPress={() => {
                        navigation.navigate("WbeView", {
                          name: items
                        })
                      }
                      } style={styles.button_option}>
                        <Text style={styles.button_text}>
                          الفيديو
                        </Text>
                      </TouchableOpacity>

                    </View>


                  </View>





                )}
              </View>
            )}

          </View>
          <View style={{ height: 55 }}></View>
        </ScrollView>
      </View>


    </>
  )

}


const styles = StyleSheet.create({
  Header: {
    backgroundColor: COLORS.pramary,
    alignItems: "center",
    flex: 1,

  },

  SearchTextView: {
    backgroundColor: COLORS.white,
    width: width / 1.1,
    // height: height / 15,
    alignItems: "center",
    justifyContent: "center",
    borderRadius: RADIUS.smRadius,
    marginVertical: MARGIN.xxsMargin,

    // borderWidth: 1,
    // borderColor: COLORS.orange,
    // paddingHorizontal: PADDING.xsPadding,
    // fontSize: FONTS.h,
    flexDirection: "row"

  },
  SearchTextInput: {
    // backgroundColor: COLORS.white,
    width: width / 1.4,
    // height: height / 17,
    alignItems: "center",
    alignSelf: "center",
    // backgroundColor:COLORS.black,
    color: COLORS.black,
    justifyContent: "flex-end",
    fontFamily: "Generator Black",
    // borderRadius: RADIUS.lgRadius,
    // borderWidth: 2,
    // borderColor: COLORS.orange,
    paddingHorizontal: PADDING.smPadding,
    fontSize: FONTS.h4
    // marginVertical: MARGIN.xsMargin

  },
  category_View: {
    height: height / 10,
    // width: width / 2,
    alignItems: "center",
    alignSelf: "flex-start",
    // backgroundColor:"#000",
    flexDirection: "row",
    marginTop: MARGIN.xxsMargin
  },
  category_Box: {
    width: width / 4.5,
    height: height / 11,
    padding: PADDING.xsPadding,
    alignItems: "center",
    justifyContent: "center",
    backgroundColor: COLORS.pramary50,
    marginLeft: 5,
    borderRadius: RADIUS.xsRadius
  },
  category_chosen_Box: {
    width: width / 4.5,
    height: height / 11,
    padding: PADDING.xsPadding,
    alignItems: "center",
    justifyContent: "center",
    backgroundColor: COLORS.warning,
    marginLeft: 5,
    borderRadius: RADIUS.xsRadius
  }
  ,
  food_View: {
    width: width,
    backgroundColor: COLORS.pramary,
    flexDirection: "row",
    flexWrap: "wrap",
    padding: PADDING.xsPadding,
    alignItems: "center",
    justifyContent: "space-around",
    marginTop: MARGIN.xxsMargin
  }
  ,
  Headerstarred: {
    width: width / 1.05,
    flexDirection: "row",
    justifyContent: "space-between",
    alignItems: "center",
    alignSelf: "center"
  },
  textHeaderstarred: {
    fontSize: FONTS.h1,
    color: COLORS.ButtonWhite,
    // fontWeight: "bold",
    fontFamily: "Generator Black"
  },
  textHeaderstarred2: {
    fontSize: FONTS.h5,
    color: COLORS.gray,
    // fontWeight: "bold",
    fontFamily: "Generator Black"
  },
  meal_View: {
    width: width / 2.1,
    // height:height/2.5,
    alignItems: "center",
    marginVertical: MARGIN.xxsMargin,
    padding: PADDING.lgPadding,
    borderRadius: RADIUS.xxsRadius,
    backgroundColor: COLORS.pramary50
  },
  meal_image: {
    width: width / 2.4,
    height: height / 5,
    borderRadius: RADIUS.xxsRadius,
  },
  meal_name: {
    fontSize: FONTS.h4,
    color: COLORS.white,
    fontFamily: "Generator Black",
    textAlign: "left"
  }
  ,
  view_time: {
    width: width / 2.4,
    alignItems: "center",
    flexDirection: "row",
  },
  text_time: {
    fontSize: FONTS.h4,
    color: COLORS.white,
    fontFamily: "Generator Black",
    alignSelf: "center",
    marginHorizontal: 2
  }
  ,
  option_view: {
    width: width / 2.4,
    alignItems: "center",
    justifyContent: "space-around",
    flexDirection: "row",

  },
  button_option: {
    width: width / 6,
    backgroundColor: COLORS.orange,
    borderRadius: RADIUS.smRadius,
    alignItems: "center",
    justifyContent: "center",
  },
  button_text: {
    fontSize: FONTS.h5,
    color: COLORS.white,
    fontFamily: "Generator Black",
    alignSelf: "center",
    marginHorizontal: 2
  }
});
