import React, { useState } from 'react';
import {
    StyleSheet,
    View,
    Text,
    Image,
    StatusBar,
    TouchableOpacity,
    ImageBackground,
    Dimensions,
    TextInput,
    ScrollView,
} from 'react-native';
import { RFPercentage, RFValue } from 'react-native-responsive-fontsize';
import { COLORS, PADDING, MARGIN, RADIUS, FONTS, ICONSSIZE } from '../constants/Constants'
import Ionicons from 'react-native-vector-icons/Ionicons'
import Octicons from 'react-native-vector-icons/Octicons'
const { width, height } = Dimensions.get('window');
import * as Animatable from 'react-native-animatable';
import Photo_page from '../screen/Photo_page'
import { useNavigation, NavigationContainer } from '@react-navigation/native';
import { createNativeStackNavigator } from '@react-navigation/native-stack';
import LottieView from 'lottie-react-native';


export default function Food() {
    const [Common, setCommon] = useState(
        [
            {
                Image: require("../img/download.jpg"),
                name: "الملوخية ",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: '1 باقة ملوخية طازجة أو مجمدة\n1 كيلو لحم بقري مقطع إلى مكعبات صغيرة\n2 بصلة متوسطة الحجم مفرومة\n4 فصوص ثوم مفرومة\n1/2 كوب كزبرة مفرومة\n1/2 كوب بقدونس مفروم\n1 ملعقة صغيرة بهارات مشكلة\n1 ملعقة صغيرة كركم\n1 ملعقة صغيرة فلفل أسود\n1 ليمونة مقطعة إلى شرائح\nملح حسب الذوق\n2 لتر ماء\nزيت نباتي للطهي',
                Step: "يغسل اللحم ويترك جانبا.\nتقشر البصلة وتفرم جيدا ويضاف إليها الثوم وتخلط معا.\nتسخن الزيت في قدر كبير ويضاف البصل والثوم ويقلب حتى يصبح لونهما ذهبيا.\nيضاف اللحم وتقلب جيدا حتى يصبح لونه بنيا.\nيضاف الملوخية ويقلب جيدا لمدة 5 دقائق.\nيضاف الماء والتوابل ويترك المزيج يغلي.\nيقلب المزيج جيدا ويترك ليطهى لمدة ساعة تقريبا أو حتى يصبح اللحم طريا والملوخية مطهوة.\nيضاف الكزبرة والبقدونس ويترك المزيج لمدة 5 دقائق ثم يزال من النار.\nيقدم المزيج الساخن مع الأرز وشرائح الليمون.",
                video: "https://www.youtube.com/watch?v=bFMVOZFjCmM",


            },
            {
                Image: require("../img/download1.jpg"),
                name: "طاجن مكرونة بشاميل ",
                view: true,
                time: " 50 min",
                Elta7der: '10 min',
                Eltahy: "40 min",
                Elsouba: "30",
                components: '½ كيلو مكرونة بنة او اقلام\nماء للغلى\nملح\nالحشو :\n¼ كيلو لحمة مفرومة\nملح\nفلفل اسمر\nبصلة مفرومة او مقطعة صغير\nالبشاميل :\n4 معالق دقيق\nلتر لبن\nمعلقتين سمن\nمكعب مرق\nملح\nفلفل\nجبن رومى او موتزريلا',
                Step: "فى حلة يغلى الماء ثم يضاف المكرونة والملح وتترك لتستوى ثم تصفى ولا تغسل\nفى طاسة يوضع البصل والسمن حتى تصبح البصل ذهبى اللون يضاف اللحمة ويقلب ثم يضاف الملح والفلفل\nفى حلة يضاف السمن والدقيق ويقلب ثم يضاف اللبن والملح والفلفل والمكعب المرق ويقلب حتى يتقل القوام\nتحضر البرامات الصغيرة او الطواجن الصغيرة تدهن بمادة دهنية\nيضاف قليل من البشاميل الى المكرونة ويقلب ثم توضع طبقة من المكرونة فى البرام ثم يضاف اللحمة ثم توضع الطبقة الثاتية\nيغطى الوجه بالبشاميل و الجبن وتدخل فرن ساخن لمدة 20 دقيقة ",
                video: "https://www.youtube.com/watch?v=jzr_0t74aJA",


            },
            {
                Image: require("../img/makronabldggag.jpg"),
                name: "مكرونة كريمية بالدجاج ",
                view: true,
                time: " 60 min",
                Elta7der: '10 min',
                Eltahy: "50 min",
                Elsouba: "50",
                components: 'تتبيلة الدجاج:\n2 صدور دجاج 4 ملاعق كبيرة زيت نباتي\n1 ملعقة كبيرة توابل كيچن\n1 ملعقة صغيرة بودرة بصل\n1 ملعقة صغيرة بودرة ثوم\n1 ملعقة صغيرة بقدونس مجفّف\n1 ملعقة صغيرة بهارات دجاج\n1/2 ملعقة صغيرة بابريكا المكرونة:\n500 جرام مكرونة أقلام\n1 كوب كريمة طبخ\n1 كوب مرقة دجاج\n1/2 كوب "115 جرام" جبنة كريمية\n1 حبّة بصل مفروم\n1 حبّة طماطم مقطّعة مكعبات\n1 حبّة فلفل رومي مقطّع مكعبات\n1 ملعقة كبيرة زبدة\n1 ملعقة صغيرة بودرة مرقة دجاج\n1 ملعقة صغيرة توابل كيچن\n1/2 ملعقة صغيرة ثوم مهروسة\nملح - فلفل أسود',
                Step: "نسلق المكرونة بالطريقة المعتادة ثم نصفّيها ونتركها جانبا ونبدأ أولا بتجهيز الدجاج\nإذا كانت الصدور سميكة نضعهم بين طبقتين من الورق الشفاف ونَدُقّهم وهذا حتى ينضجوا تماما من الداخل ثم ندهنهم بملعقة كبيرة من الزيت\nهذه بهارات الكيچن التي استخدمتها بالوصفة وهي تُضفي نكهة مميزة ولذيذة جدا للطبق\nنخلط كل مكونات التتبيلة معا بطبق صغير ونغلّف بهم صدور الدجاج\nوبمقلاة عميقة وغير لاصقة نسخّن حوالي 3 ملاعق كبيرة من الزيت ونشوِّح به الدجاج لمدة 10 دقائق تقريبا مع التقليب المستمر على كل الجوانب حتى ينضجوا تماما ثم نُخرجهم جانبا ونتركهم لتهدأ حرارتهم قليلا\nبنفس المقلاة نُذيب الزبدة ونشوِّح بها البصل والثوم حتى يلين قوام البصل ثم نُضيف مكعبات الفلفل والطماطم وعندما يلين قوام الخضروات نضع الكريما ومرقة الدجاج ثم الجبنة الكريمية ونقلّب جيدا حتى تتجانس المكونات ثم نُضيف بودرة مرقة الدجاج وبهارات الكيچن ونتبّل بالملح والفلفل الأسود\nوعندما يبدأ الخليط بالغليان نُضيف المكرونة المسلوقة مع التقليب الجيد حتى تختلط بها كل المكونات ثم نقطّع صدور الدجاج إلى شرائح ونقلّبهم مع المكرونة ونترك بعض الشرائح جانبا لوضعهم على الوجه عند التقديم النهائي\nنرفع المكرونة عن النار وتوضع بأطباق التقديم ونرُش الوجه بالقليل من الجبنة المبشورة أو نزيّن حسب الرغبة\nوأخيرا تُقدَّم مكرونة الدجاج والكيچن ساخنة",
                video: "https://www.youtube.com/watch?v=rFOASDE9kgs",
            },
            {
                Image: require("../img/15489737431619515555.jpg"),
                name: "كفتة",
                view: true,
                time: " 30 min",
                Elta7der: '10 min',
                Eltahy: "20 min",
                Elsouba: "50",
                components: 'لحمة مفرومة\nبصل\nثوم\nبقدونس\nكمون\nفلفل\nملح\nطحين\nزيت',
                Step: 'تُخلط اللحمة المفرومة مع البصل المفروم والثوم والبقدونس والكمون والفلفل والملح والطحين. تُشكل الخليط إلى كفتة وتُقلى في الزيت حتى تنضج.',
                video: "https://www.youtube.com/watch?v=0l9HiHwM5Vc",
            },
            {
                Image: require("../img/download(1).jpg"),
                name: "طاجن مكرونة بالكبدة",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: '½ ك كبدة مقطعة ومحمره\nمعلقة سمنة\nمعلقة ملح شطة بهارات\nبصلة مقطعة\n2 قرن فلفل مقطع\n½ مكرونة مقطعة\n2 معلقة صلصة',
                Step: "هنجيب حلة ونحط السمنة ونحط البصل ونقلب\nبعد كدة نحط الصلصة والطماطم\nوالتوابل والبهارات ونسيبة تسبك\nهنجيب الطاجن ونحط الكبدة ونحط المكرونة ونحط الفلفل\nونحط التسبيك وندخلة الفرن",
                video: "https://www.youtube.com/watch?v=_Mn_V9atVCM",
            }
            ,
            {
                Image: require("../img/733.jpg"),
                name: "صينية بطاطس باللحمة",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "40",
                components: '1 كيلو لحمة مسلوقة\n1 كيلو بطاطس\n3 كوب عصير طماطم\n1 كوب ماء بصلة حلقات\n1 ملعقة صغيرة ثوم مفروم\n1 ملعقة كبيرة سمنة\nفلفل حار  حسب الرغبة\nملح\nفلفل أسود ',
                Step: "شوحي البصل في زيت مخصص للطهى على النار مع إضافة ذرة ملح له حتى تذبل ثم تضاف قطع اللحمة وتحمر قليلا ثم يضاف عصير الطماطم والثوم ويقلب الخليط بشكل جيد\nضعي شرائح البطاطس في صينية مع الفلفل الحار حسب الرغبة و يضاف خليط الطماطم والطماطم إلى البطاطس و يضاف الماء والملح والفلفل الأسود\nتوضع الصينية على النار لتغلي ثم توضع في الفرن وانتظري حتى تمام النضج ",
                video: "https://www.youtube.com/watch?v=QaGmEgUaODc",

            },
            {
                Image: require("../img/flafel.jpg"),
                name: "فلافل بيتي بالخلاط",
                view: true,
                time: " 40 min",
                Elta7der: '35 min',
                Eltahy: "5 min",
                Elsouba: "30",
                components: '1/2 ك فول مدشوش\n1 بصلة كبيرة\n3 حزم كرات\n2 حزمة بقدونس\n1 راس ثوم',
                Step: "يبل الفول ف الماء قبلها بيوم\nيقطع الكرات والبقدونس ويغسل\nيقطع البصل مكعبات ويقشر الثوم\nف كبة الخلاط نضع الخليط ونضرب الي أن تصير ناعمه\nتحفظ ف اكياس ف الثلاجة وعند الاستخدام نضيف على العجين ملح وشطة وكمون وكزبرة حصي ونص ملعقة صغيرة بيكنج بودر\nيشكل العجين لاقراص وتتبل ف السمسم الابيض وتقلي بالزيت",
                video: "https://www.youtube.com/watch?v=3qn7YG4vTdw",


            },
            {
                Image: require("../img/484.jpg"),
                name: "جلاش باللحمة المفرومة",
                view: true,
                time: " 30 min",
                Elta7der: '10 min',
                Eltahy: "20 min",
                Elsouba: "30",
                components: '½ كيلو لحمة معصجة\nلفة جلاش\nبيضتين\nكوب لبن\n¼ معلقه صغيره فلفل اسود\n¼ معلقه صغيره ملح\nمعلقتين كبار سمن',
                Step: "هنحضر اللحمة ونخليها على جمب لينك الوصفة فالمكونات\nهندهن صينيه كبيره بالسمن وهنفتح الجلاش هناخد ورقتين ونرص نصهم فالصينيه ونصم برا\nوناخذ ورقتين تاني ونرصهم نصهم في الصينيه ونصهم برا وبين كل راق والتاني هنضيف مسحة من السمن هنضيف اللحمة ونطبق ورق الجلاش الي برا على الحشو\nوبين كل تطبيقه والتانيه هنضيف مسحة سمنه لما تقفل خالص وعلى الوش هنضيف ورقه كاملة وبعدين نقطعها حسب الرغبة يامربعات يامثلثات ومسحة سمن عالوش\nفي طبق صغير هنضيف اللبن والبيض والملح والفلفل الأسود ونربهم مع بعض حلو اوي ونوزعه على وش الجلاش وندخلها الفرن تستوي على درجة حرارة ١٨٠ وتتحمر من الوش تتقدم سخنة وبالهنا ",
                video: "https://www.youtube.com/watch?v=me3ZoOCpb6U",
                categortType: 4,

            },
            {
                Image: require("../img/m5zn_12528406b9a94fc.jpg"),
                name: "الفراخ المشوية بالبقدونس والجزر",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "50",
                components: '6 افخاذ دجاج\nالتتبيلة\nمعلقه ونص كبار ملح\n4 معالق كبار عسل اسود\n½ معلقة صغيره فلفل اسود\n½ معلقة صغيره كاري\nمعلقه صغيره زعتر\n4 معالق كبار خل\nبصله كبيره مبشورة\n½ كوب جزر مبشور\nمعلقتين كبار بقدونس متقطع\nمعلقه صغيرة توم مفروم',
                Step: "هنغسل الفراخ وتتقطع ونخليها تتصفي خالص من الميه\nفي بولة غويطة هنضيف مكونات التتبيلة كلها ونقلبها مع بعض حلو اوي\nفي بولة غويطة هنضيف مكونات التتبيلة كلها ونقلبها مع بعض حلو اوي\nهنرصها فالصينيه وندخلها الفرن تتشوي على درجة حرارة ٢٢٠ وتتقدم سخنة مع المكرونة او الأرز وبالهنا ",
                video: "https://www.youtube.com/watch?v=INcw74ZiYnY",
                categortType: 1,
            },
            {
                Image: require("../img/4647824981584556199.jpg"),
                name: "بطاطس محشية باللحمة المفرومة",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: 'كيلو بطاطس صغيره\n½ كيلو لحمه مفرومه\nبصل\nم ص ملح وفلفل\nم ص بهارات\n2 م ك صلصه\nم ص توم مفروم\nم ص بابريكا',
                Step: "تقشر البطاطس وتقور ثم تغسل بالماء ثم تحمر فى زيت غزير\nنقوم بتعصيج اللحمه بوضع معلقه سمنه فى وعاء مناسب ثم ننزل بالبصل يدبل ثم اللحمه ونتبلها ونتركها تنضج\nنقوم بحشو اللحمه داخل البطاطس ثم نرصها فى صينيه\nفى طاسه صغيره ننزل بمعلقه زيت ثم التوم والصلصه والتوابل ثم نسقى بها البطاطس ثم ندخلها الفرن تحمر ونخرجها نقدمها بالف هنا",
                video: "https://www.youtube.com/watch?v=Bybn0UwkOrU",
                categortType: 4,


            },

            {
                Image: require("../img/rokak.jpg"),
                name: "رقاق طري باللحمة المفرومة",
                view: true,
                time: "40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: ' لفه رقاق طري.\nنصف كيلو لحم مفروم.\nبصلة كبيرة مبشورة.\nطماطم مبشورة.\nمعلقة صلصة كبيرة.\nمرقة دجاج.\nتوابل لحم.\nفلفل أسود.\nفلفل أخضر مقطع.\nملح.\nلبن.\nشوربة لحم أو فراخ.\nسمن.',
                Step: "نحضر صينية متوسطة مدهونة بالسمن\nثم نضع ورقة واحدة من الرقاق ونمسح بالسمن\nونكمل بهذه الطريقة حتى نكمل نصف الكمية الموجودة من الرقاق.\nنضع اللحم المفروم المعصج في المنتصف ونكمل باقي الأوراق بهذه الطريقة.\nنضع الشوربه من فوقها وتدخل الفرن على درجة حرارة متوسطة حتى يحمر الوجه ويقدم ساخنا. ",
                video: "https://www.youtube.com/watch?v=Op3UgTR3ujE",
                categortType: 4,


            },

            {
                Image: require("../img/54423-55.jpg"),
                name: "طاجن بطاطس باللحمة",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: 'ك بطاطس مقطع\nك لحمة مقطع\nك طماطم معصور\n3 فص ثوم مقطع\nبصلة مقطعة\n2 معلقة ملح فلفل\nملعقة كزبرة\nمعلقة بهارات على جوزة الطيب\nورقة لوري على حبهان',
                Step: "هنجيب حلة ونحط فية طماطم وبصلة ولوري وحبها\nونسيبة تغلى نحط للحمة\nاول متخش في السوية نحط ملعقة ملح وفلفل\nبعد كدة هنجيب الطاجن الطاجن ونحط البطاطس واللحمة والبصل والملح\nونحط التوابل والبهارات ونقلبهم في بعض\nونحط الطماطم ومعلقة سمنة\nونغطية بفويل وندخلة الفرن\nلاحد السوية\nهنشيل الغط ونحطة تحت الشوية",
                video: "https://www.youtube.com/watch?v=UiPWYbzN0-U",
                categortType: 6,


            },

            {
                Image: require("../img/meatWithfrek.jpg"),
                name: "طاجن لحمة بالفريك",
                view: true,
                time: " 50 min",
                Elta7der: '10 min',
                Eltahy: "40 min",
                Elsouba: "60",
                components: '¼ ك فريك مغسول ومنقوع\n½ ك لحمة مقطع\nمعلقة سمنة\n2 معلقة زيت\nملعقة صلصة\nبصلة مقطعة\n2 معلقة ملح وفلفل\nمعلقة\nجوزة الطيب',
                Step: "هنجيب حلة ونحط السمنة ونحط اللحمة ونشوحة لاحد ميتغر اللون\nهنحط مياه ساخنة ونحط بصلة وطماطمة ونسيبة تخش في السوية\nنحط ملعقة ملح وفلفل\nهنجيب حلة ونحط ملعقة سمنة ونحط بصلة ونقلب ونحط الصلصة\nونحط ٢كوبية شوربة ونسيبة\nتغلى نحط الفريك ونحط التوابل والبهارات والملح ونسيبة يشرب\nهنجيب الطاجن ونحط الفريك واللحمة وندخلة الفرن",
                video: "https://www.youtube.com/watch?v=dQNoYn_7bA0",
                categortType: 6,

            },
            {
                Image: require("../img/1613190183_node.png"),
                name: "كشري مصري",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: 'معكرونة : 1 كيلو (مشكلة)\nالأرز المصريّ : نصف كيلو\nالعدس : نصف كيلو\nطماطم : 1 كيلو\nالثوم : 10 فصوص\nشعيرية : ربع كيلو\nالبصل : 3 حبات\nالخل : حسب الحاجة\nملح : حسب الرغبة\nالشطة : حسب الحاجة\nالكمون : حسب الرغبة\nحمص : ربع كيلو\nعصير الليمون : حسب الرغبة\nالزيت : حسب الحاجة\nالكزبرة : ربع ملعقة صغيرة',
                Step: "حمري 5 فصوص ثوم جيدا وأضيفي الطماطم بعد تصفيتها وضعي نصف ملعقة فلفل أسود وملعقة ونصف ملح و٤ ملعقة خل واتركيهم يغلوا جيدا حوالي نصف ساعة مع تزويد الماء ونتركها حتى تستوي. اغسلي نصف كيلو العدس جيدا ونغطيه بالماء ونزود ونضيف الثوم والبصل ونصف ملعقة كبيرة ملح ويترك على النار.\nضعي في قدر 4 ملعقة زيت ونضيف الشعيرية ونحمرها جيدا ونغسل الأرز وينزل به على الشعيرية مع ملعقة من الملح والماء وتترك المكونات نصف ساعة حتى يستوي الأرز.\nفي قدر آخر نضع الحمص حتى ينسلق مع نصف ملعقة صغيرة ملح.\nلتحضير الدقة: افرمي الثوم وضع كوب من الخل وكوب ماء ثم نصف ملعقة ملح ونصف ملعقة كمون وربع ملعقة كزبرة مطحونة.\nلتحضير الشطة: اضربي الطماطم في الخلاط وضعيهم في قدر وأضيفي 5 ملعقة من صلصة الكشري وعصير الليمون وملعقة كبيرة خل و5 ملعقة صغيرة شطة وملعقة ملح صغيرة وكوب من الماء ويترك ليغلي 5 دقائق.\nاسلقي المكرونة في الماء والزيت والملح وتصفى ونضيف 3 ملعقة زيت ونقلبها.\nحمري البصل الشرائح المغطى بالدقيق في الزيت الغزير حتى يتحمر.\nضعي المكرونة في طبق التقديم\nوأضيفي الأرز مع العدس والحمص وعليهم الصلصة والبصل المقرمش وضعي الدقة والشطة بأطباق جانبية.",
                video: "https://www.youtube.com/watch?v=RX6k_VjkM1M",
                categortType: 4,

            },
            {
                Image: require("../img/46188.jpg"),
                name: "ورق عنب",
                view: true,
                time: " 60 min",
                Elta7der: '20 min',
                Eltahy: "40 min",
                Elsouba: "90",
                components: 'نصف كيلو ورق عنب مسلوق.\n2كوب كبير من عصير الطماطم.\nحزمه بقدونس.\nبصل مفروم.\nملعقة كبيرة سمن بلدي أو نباتي.\nملح وبهارات محشي.\n2 كوب مرقه دجاج أو لحم.\n2 كوب أرز ابيض مغسول ومصفي جيدا من الماء.',
                Step: "تحضير وعاء مناسب وإضافة السمن مع البصل ويقلب جيدا لمدة دقيقتين ثم إضافة عصير الطماطم و الملح وبهارات المحشي  ويترك الطماطم على النار حتى يصبح خليطه سميك ثم إضافة البقدونس المفروم والأرز مع التقليب جيدا في وعاء مع إضافة شرائح من البصل والطماطم ثم حشو ورق العنب بخلطة الأرز ورصه بطريقه منظمه ومرتبة وبعد الانتهاء تضاف المرقة مع معلقة كبيرة من السمن ويطهي ورق العنب على نار عالية لمدة 10 دقائق ثم تهدئة النار ويطهي لمدة 40 دقيقة ويقدم ورق العنب ساخن مع الدجاج أو اللحم أو البط.",
                video: "https://www.youtube.com/watch?v=ELp9zkImO_8",
                categortType: 4,

            },

            {
                Image: require("../img/0fde4266664dbd6a75ef98da2fd8bb01_w750_h500.jpg"),
                name: "باذنجان محشي",
                view: true,
                time: " 50 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "50",
                components: '- الأرز المصريّ : كيلو\n- البصل : 3 حبات (مفروم)\n- عصير الطماطم : 4 اكواب\n- مرق دجاج : 4 اكواب\n- الشبت : نصف كوب\n- بقدونس : نصف كوب\n- كزبرة خضراء : نصف كوب\n- صلصة طماطم : ملعقة كبيرة\n- الزيت : ملعقة كبيرة\n- القرفة : نصف ملعقة صغيرة\n- نعناع ناشف : ملعقة صغيرة\n- بهارات مشكلة : ملعقة كبيرة\n- فلفل أسود : ملعقة\n- جوزة الطيب : ربع ملعقة صغيرة\n- الشطة : نصف ملعقة صغيرة\n- ملح : حسب الرغبة',
                Step: "على نار متوسطة سخني الزيت ثم أضيفي البصل وقلبيه حتى يذبل ثم أضيفي صلصة الطماطم و3 أكواب من عصير الطماطم وقلبي ثم اتركيها حتى تغلي. أضيفي مكعب المرق وقلبي لمدة 5 دقائق وفي وعاء كبير ضعي الأرز والكزبرة والشبت والبقدونس وخليط البصل والطماطم والنعناع والقرفة والبهارات وجوزة الطيب والفلفل الأسود والملح والفلفل الحار وقلبي جيدا.\nاحشي الباذنجان بالأرز واتركي مقدار عقلة اصبع حتى تسمحي للأرز بالتمدد أثناء النضج وعلى نار متوسطة ضعي باقي عصير الطماطم والمرق واتركيه حتى يغلي.\nرصي الباذنجان في القدر ثم صبي المرق في داخل كل ثمرة باذنجان ثم صبي باقي المرق في قاع القدر حتى يصل إلى منتصف الباذنجان ثم غطي القدر واتركيه على نار متوسطة حتى يغلي المرق.\nأخفضي النار لتصبح هادئة واتركيه لمدة 60 دقيقة حتى ينضج وقدميه ساخنا.",
                video: "https://www.youtube.com/watch?v=QvLdDdt_XoI",

            },
            {
                Image: require("../img/f3e6936fc09d00be1c90bec714625521_w750_h500.jpg"),
                name: "كفته داوود باشا",
                view: true,
                time: " 60 min",
                Elta7der: '20 min',
                Eltahy: "40 min",
                Elsouba: "60",
                components: '- مقادير الصلصة :\nالبصل : 1 حبة (مفروم)\nالثوم : فصّان (مهروس)\nصلصة طماطم : 2 كوب\nمعجون الطماطم : 2 ملعقة صغيرة\nالزيت النباتي : 2 ملعقة كبيرة\nالماء : ربع كوب\n- لحم مفروم : 500 غراما\n- البصل : 1 حبة (مفروم)\n- كزبرة خضراء : ربع كوب (مفرومة)\n- بقدونس : نصف كوب (مفروم)\n- الزيت النباتي : ربع كوب\n- فلفل رومي : 1 حبة (مفروم)\n- الثوم : فصّان (مهروس)\n- فلفل أسود : نصف ملعقة صغيرة\n- كزبرة يابسة : ملعقة صغيرة\n- بهارات مشكلة : ملعقة صغيرة',
                Step: "في وعاء للخلط\nضعي اللحم\nوالكزبرة\nوالبصل\nوالبقدونس\nوالثوم\nوالفلفل الأسود\nوالبهارات\nوالفلفل الرومي\nوالكزبرة الجافة\nاخلطي المكونات حتى تتداخل.\nحمّي الزيت في مقلاة على نار متوسطة\nوشكلي كرات متساوية الحجم من خليط اللحم\nوضعيه في المقلاة\nوقلبي حتى يتغير لونها وتنضج\nثم ارفعيها من المقلاة وضعيها في طبق جانبي.\nفي مقلاة على النار\nسخني الزيت\nثم أضيفي البصل والثوم وقلبي حتى يذبلا.\nأضيفي معجون الطماطم\nوصلصة الطماطم\nوالملح\nوالبهارات المشكلة\nوالماء وحركي المكونات حتى تتداخل.\nعند الغليان خففي النار\nوأضيفي كرات اللحم\nثم غطي المقلاة\nواطبخي المكونات حتى تنضج وتكثف الصلصة.\nيقدم ساخنا بجانب الأرز الأبيض.",
                video: "https://www.youtube.com/watch?v=hcRuAVoOIQI",

            },
            {
                Image: require("../img/b370dcb6a455f9e136588beaec699d2d_w750_h500.jpg"),
                name: "محشي الكوسا والباذنجان ",
                view: true,
                time: " 65 min",
                Elta7der: '25 min',
                Eltahy: "40 min",
                Elsouba: "70",
                components: '- الباذنجان : نصف كيلو\n- الكوسا : نصف كيلو\n- الأرز : 2 كوب (مغسول ومصفى)\n- البصل : 1 حبة (مفروم)\n- بقدونس : نصف كوب (مفروم)\n- طماطم : 2 حبة (مقطعة)\n- الثوم : 3 فصوص\n- لحم مفروم : ربع كيلو\n- زيت الزيتون : نصف كوب\n- مرق دجاج : مكعب\n- نعناع ناشف : ملعقة صغيرة\n- ملح : حسب الرغبة\n- فلفل أسود : حسب الرغبة\n- البطاطس : 2 حبة (مقطعة شرائح)\n- ماء ساخن : حسب الحاجة',
                Step: "احفري الكوسا والباذنجان أزيلي اللبّ من الداخل\nثم اغسلي الخضار جيدا وصفيها.\nحضري وعاء\nواخلطي اللحم المفروم\nوالطماطم\nوالبصل\nوالبقدونس\nوالأرز المغسول.\nأضيفي الملح\nوالفلفل الأسود حسب الرغبة\nوالثوم\nوالنعناع الجاف\nوزيت الزيتون\nوقلبي المكونات جيدا حتى تمتزج تماما.\nاحشي الكوسا والباذنجان بالخليط دون ملئها.\nحضري قدر\nوضعي به القليل من الزيت ويتم رص شرائح البطاطس به.\nضعي الكوسا والباذنجان فوق البطاطس\nوأضيفي الماء المغلي مع مرق الدجاج والملح.\nضعي القدر على النار مع تغطيه\nواتركيه حتى الغليان\nثم خففي النار\nواتركيه حتى تنضج الخضار.\nقبل الإستواء ضعي الثوم المهروس مع ملعقة كبيرة نعناع جاف واتركيه لعشر دقائق إضافية.\nاسكبي المحشي في طبق التقديم وقدميه ساخنا.",
                video: "https://www.youtube.com/watch?v=5El4aaTrCVg",

            },
            {
                Image: require("../img/202109041239143914.jpg"),
                name: "ارز معمر",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: 'يتم معايرة الأرز بنصف كمية البرام\nلتر حلب\nكريمة لباني\nزبدة\nقشطة\nملح',
                Step: "يتم غسل الأرز جيدا قبل أن يصف\nى قومي بوضع كمية الأرز والتي تكون نصف حجم البرام في الطاجن\nيوضع عليه معلقة كبيرة من الزبدة البقري أو الفلاحي\nعلبة كريمة لباني صغيرة للطبخ قومي بوضعها على الأرز\nيغطى تماما بالحليب المغلي على أن يغمر الأرز به\nثم يوضع عليه الملح فقط حسب الرغبة\nملحوظة: ا يوضع عليه توابل لكي يظهر به طعم القشطة والزبدة في الطاجن فلا يتم وضع أي توابل غير الملح\nثم توضع في الفرن على درجة حرارة متوسطة 180 درجة حتى يصل الأرز بأن يتشرب من الحليب تماما توضع القشطة على وجه الطاجن\nيترك في الفرن حتى يحمر وجه برام الأرز المعمر ويكتمل نضوجه\nيمكن وضع قطع من الحمام مسلوق أو قطع من اللحم البتلو المسلوق أو كبد الدجاج مسلوقة أو صدور فراخ بقلب الطاجن\nيمكنك إضافة جوز الطيب حسب الرغبة",
                video: "https://www.youtube.com/watch?v=IHWqrDccHuA",

            },
            {
                Image: require("../img/104-233834-how-sambosk-works-with-cheese-2.png"),
                name: "سمبوسه بالجبنه",
                view: true,
                time: " 20 min",
                Elta7der: '10 min',
                Eltahy: "10 min",
                Elsouba: "50",
                components: '1/2 كيلو سمبوسه\nقطعتين جبنه قريش\n2 فلفل اخضر متقطع\n1 بصله متوسطه متقطعه\nرشة فلفل اسود\nرشة ملح\nرشة كمون\nرشة كزبره\nمعلقه صغيره زيت زيتون او نباتي',
                Step: "هنضيف كل المكونات ع الجبنه ونخلطهم كويس\nهنحشي السمبوسه ع شكل مثلثات\nونسخن الزيت ونحمرها فيها الي ان تأخذ اللون الذهبي",
                video: "https://www.youtube.com/watch?v=tYb2mKyU9kw",

            },

        ])
    const [IconSearch, setIconSearch] = useState(true)
    const [search, setsearch] = useState("")

    const [star, setstar] = useState(
        [
            {
                Image: require("../img/kkkk.jpg"),
                name: "فطيرة الدجاج",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "70",
                components: 'زيت الزيتون للقلي\n1 بصل مقطع شرائح\n2 فص ثوم مفروم\n3 كوب صدر دجاج مطبوخ ومقطع شرائح\n1 كوب معجون طماطم\nملح حسب الذوق\nفلفل أسود حسب الذوق\nبقدونس مفروم حسب الذوق\n2 كوب حليب\n1 كوب زيت\n2 ملعقة كبيرة زبدة\n5 بيضات\n2 بطاطس مطهية\nمهروسة\n2 كوب دقيق قمح\n1 ملعقة كبيرة بايكينج باودر\n1 كوب جبن كريمي برازيلي\n½ 1 كوب جبن موزاريلا',
                Step: "في مقلاة\nحمري البصل والثوم\nثم أضيفي الدجاج واطهيه حتى يصبح ذهبي اللون.\nأضيفي معجون الطماطم ثم تبليه بالملح\nالفلفل والبقدونس المفروم. اتركي المزيج جانبا.\nفي الخلاط\nاخفقي الحليب مع الزيت\nالزبدة\nالبيض والبطاطس المهروسة. انقلي الخليط إلى وعاء ثم أضيفي دقيق القمح والبايكينج باودر مع رشة من الملح.\nاسكبي نصف العجين في صحن فرن مدهون بالزبدة\nثم وزعي خليط الدجاج فوقه بالتساوي باستخدام ملعقة\nثم أضيفي الجبن الكريمي وجبن الموزاريلا.\nغطي الحشو بالعجين المتبقي ثم اخبزي الفطيرة في فرن مسخّن مسبقا بدرجة حرارة 350 درجة فهرنهايت لمدة 30 دقيقة.",
                video: "https://www.youtube.com/watch?v=QptPLrcVXcM",

            }
            ,
            {

                Image: require("../img/downloadhamam.jpg"),
                name: "حمام محشى",
                view: true,
                time: " 70 min",
                Elta7der: '30 min',
                Eltahy: "40 min",
                Elsouba: "80",
                components: 'جوز حمام\nكوب ارز\nكبد الحمام\nبصل\nnمعلقه ملح وفلفل\nnمعلقه كمون\nnمعلقه بهارات\nرشه نعناع ناشف',
                Step: "نقوم بتنضيف الحمام وغسله جيدا مع فصل جلد البطن عن اللحم حتى يسهل الحشو\nفى حله نضع معلقه كبيره سمنه ثم ننزل بكبد الحمام وبصله متقطعه صغير وملح وفلفل وكمون ونقلبهم شويه ثم ننزل بالارز المغسول ثم رشه النعناع ونضيف ماء مغلى نصف مقدار الارز لكى يستوي نصف سوا فقط ثم نتركه يبرد قليلا ثم نحشو به الحمام بين الجلد والبطن وايضا نحشو قليل من الارز فى داخل الحمام ثم نغلق الحمام (بتكتيف الارجل داخل بعض)\nيسلق فى ماء مغلى به بصله وشريحه جزر وملح وفلفل وحبهان وورق لوري واي مطيبات تفضلينها\nيترك لينضج ثم نخرجه ونحمره في سمنه او ندهنه من الخارج بالسمن وندخله الفرن تحت الشوايه ليحمر ثم يقدم بالف هنا ",
                video: "https://www.youtube.com/watch?v=psZA8rf00NI",

            },

            {
                Image: require("../img/downloadsopet.jpg"),
                name: "سبيط مقلي",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "50",
                components: 'ك سبيط (حبار) مقط\nع5 فصوص ثوم\n2 قرن فلفل\nمعلقة ملح\nمعلقة شطة\nمعلقة كمون\nمعلقة كزبرة\n½كوبية دقيق\nمعلقة ثوم بودرة وبصل بودرة\nكوبية زيت\n2قرن فلفل حامي\nمعلقة خل وليمون',
                Step: "هنجيب الكبة نحط الثوم والتوابل والملح والثوم والبصل والفلفل\nوالليمون والخل ونضربهم\nبعد كدة نقطع السبيط قطع ونغسلة ونحطة في الخلطة ساعة\nبعد كدة نحطة في الدقيق\nونقلي السبيط والفلفل",
                video: "https://www.youtube.com/watch?v=vBsiEA0Cg24",
                categortType: 6,

            },
            {
                Image: require("../img/saidaya.jpg"),
                name: "رز صياديه",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: '1/2 كيلو ر\nزبصل مفروم\nملح\nكمون\nمكعب مرقه دجاج',
                Step: "نقوم بتحمير البصل للون البنى\nثم نضع الرز عليه ونقلب ثم نضع الملح والكمون ومكعب المرقه ونقلب جيدا\nثم نضع المياه السخنه ونتركه على نار متوسطه ثم نهدى النار ونتركه للتسويه",
                video: "https://www.youtube.com/watch?v=I_mdyPAQW18",
                categortType: 4,

            },
            {
                Image: require("../img/20171120020043043.jpg"),
                name: "النجرسكو",
                view: true,
                time: " 80 min",
                Elta7der: '20 min',
                Eltahy: "60 min",
                Elsouba: "60",
                components: 'مكرونة شرايط مسلوقة.\nنصف كيلو صدور دجاج مقطعة ومسلوقة.\nمشروم طازج مقطع شرائح (اختياري).\n1 ملعقة زيت.\n3 ملاعق كبيرة دقيق.\n7 ملاعق كبيرة لبن بودرة خالي الدسم.\n1 لتر مرقة منزوعة الدسم.\nجبنة موزاريلا مبشورة للوجه.\nجوزة الطيب.\nبودرة ثوم أو بصل.\nملح وفلفل.',
                Step: "تسلق المكرونة في ماء مغلي مملح بدون إضافة زيت\nويراعى سلقها 3/4 سلقة.\nلعمل البشاميل نضع 1 ملعقة دقيق مع ملعقة الزبدة والزيت حتى يصل إلى اللون الذهبي الفاتح\nثم تضاف المرقة بالتدريج مع التقليب المستمر\nويذاب اللبن البودرة والدقيق مع باقي المرقة وتكون باردة.\nويصب خليط المرقة على الدقيق والزبدة\nمع التقليب المستمر\nثم يضاف الملح والفلفل وجوزة الطيب والثوم البودرة\nويترك على النار حتى القوام المظبوط.\nبعد ذلك يضاف المشروم للبشاميل ويقلب\nثم يضاف الدجاج ويقلب في الصوص\nويضاف قليل من الجبنة للصوص.\nبودرة الثوم رائحتها اقوى من بودرة البصل\nلذا كميتها بتكون أقل ويمكن إضافة بصلة مبشورة ويتم تحميرها مع الحشوة\nولكن بيكون القوام مرملا أكثر.\nلإنهاء وصفة النجرسكو اللايت\nندهن وعاء بايركس الفرن بالزيت\nوتوضع المكرونة المسلوقة (ومقلبة في ملعقة زيت)\nثم تضاف الحشوة مع الصوص\nثم تضاف القليل من الجبنة الموزاريلا على الوجه.\nونضعها في الفرن على 200 درجة حتى تصل إلى اللون الذهبي.",
                video: "https://www.youtube.com/watch?v=DWBJcbSAf9Q",

            },
            {
                Image: require("../img/download(1).jpg"),
                name: "طاجن مكرونة بالكبدة",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: '½ ك كبدة مقطعة ومحمره\nمعلقة سمنة\nمعلقة ملح شطة بهارات\nبصلة مقطعة\n2 قرن فلفل مقطع\n½ مكرونة مقطعة\n2 معلقة صلصة',
                Step: "هنجيب حلة ونحط السمنة ونحط البصل ونقلب\nبعد كدة نحط الصلصة والطماطم\nوالتوابل والبهارات ونسيبة تسبك\nهنجيب الطاجن ونحط الكبدة ونحط المكرونة ونحط الفلفل\nونحط التسبيك وندخلة الفرن",
                video: "https://www.youtube.com/watch?v=_Mn_V9atVCM",
            }
        ])

    // constructor(props) {
    //     super(props); {
    //         this.state = {
    //             Common:
    //                 [
    //                     {
    //                         Image: require("../img/pizza.png"),
    //                         name: "Pizza",
    //                         view: true,
    //                         time: "30 min"
    //                     },
    //                     {
    //                         Image: require("../img/burger.png"),
    //                         name: "Burger",
    //                         view: true,
    //                         time: "30 min"
    //                     },
    //                     {
    //                         Image: require("../img/food.jpg"),
    //                         name: "Cop",
    //                         view: true,
    //                         time: "30 min"
    //                     },
    //                     {
    //                         Image: require("../img/food2.jpg"),
    //                         name: "ايس كريم",
    //                         view: true,
    //                         time: "30 min"
    //                     },
    //                     {
    //                         Image: require("../img/food3.jpg"),
    //                         name: "ايس كريم",
    //                         view: true,
    //                         time: "30 min"
    //                     },
    //                     {
    //                         Image: require("../img/food4.jpg"),
    //                         name: "ايس كريم",
    //                         view: true,
    //                         time: "30 min"
    //                     },
    //                     {
    //                         Image: require("../img/steak_food.png"),
    //                         name: "ايس كريم",
    //                         view: true,
    //                         time: "30 min"
    //                     },
    //                     {
    //                         Image: require("../img/food.jpg"),
    //                         name: "Cop",
    //                         view: true,
    //                         time: "30 min"
    //                     },

    //                 ],

    //         }
    //     }
    // }

    const ref = React.useRef(null)
    const [animationDisplay, setanimationDisplay] = useState(false)

    const makesearch = (searchText) => {
        let list = Common
        let count = 0
        for (let i = 0; i < list.length; i++) {
            if (((list[i].name).toUpperCase()).includes(searchText.toUpperCase())) {
                list[i].view = true
            }
            else {
                list[i].view = false
                count++
            }

        }
        if (count == list.length) {
            setanimationDisplay(true)
        }

        // 
        if (count != list.length) {
            setanimationDisplay(false)

        }
        setCommon(list)
        count = 0

    }
    // Delete() {
    //     let list = this.state.Common
    //     list.view=!list.view
    //     if (list.view==false) {
    //         this.setState({ Common: list })
    //     }
    // }
    //   function  GoToButton({ screenName }) {
    const navigation = useNavigation();

    //     return (
    //         <Button
    //             title={`Go to ${'Photo_page'}`}
    //             onPress={() => navigation.navigate('Photo_page')}
    //         />
    //     );
    // }

    return (
        <>
            <View style={{ backgroundColor: COLORS.pramary, flex: 1 }}>
                <ScrollView>
                    <View style={styles.Header}>
                        <View>
                            <View style={{}}>
                            </View>

                            {IconSearch ? (
                                <>
                                    <Animatable.View
                                        animation='slideInLeft' >
                                        <TouchableOpacity
                                            onPress={() => {
                                                // this.setState({ IconSearch: false })
                                                // this.fadeOut
                                                setIconSearch(false);
                                            }}>
                                            <Ionicons name='ios-search-circle' size={60} color={COLORS.orange} />
                                        </TouchableOpacity>

                                    </Animatable.View>
                                </>
                            ) : (
                                <Animatable.View style={styles.SearchTextView}
                                    animation='flipInY' >
                                    <TextInput style={styles.SearchTextInput}
                                        placeholder={'البحث عن الأكلات...'}
                                        placeholderTextColor={COLORS.grayFont}
                                        onChangeText={(value) => {
                                            makesearch(value)

                                            setsearch(value)
                                        }}
                                        // onChangeText={value => {
                                        //     setPhone(value);
                                        //     if (onChangephone(value)) {
                                        //       setPhoneError('');
                                        //     }
                                        //   }}

                                        value={search} />
                                    <TouchableOpacity onPress={() => {
                                        setIconSearch(true);
                                        //    this.setState({ IconSearch: true })
                                    }}>

                                        <Ionicons name='search' size={ICONSSIZE.xlIcon} color={COLORS.pramary} />
                                    </TouchableOpacity>

                                </Animatable.View>
                            )}
                        </View>

                        <View style={styles.BoxView}>
                            <View style={styles.Headerstarred}>
                                <Text style={styles.textHeaderstarred}>
                                    الوصفات
                                </Text>
                                <TouchableOpacity
                                    onPress={() => {
                                        navigation.navigate("All", {
                                            name: Common
                                        })
                                    }
                                    }>
                                    <Text style={styles.textHeaderstarred2}>
                                        رؤية الكل
                                    </Text>
                                </TouchableOpacity>
                            </View>
                            <View style={{ flexDirection: "row", width: width, }}>
                                <ScrollView horizontal={true}>
                                    {animationDisplay ? (
                                        <>
                                            <View style={{ alignItems: "center", justifyContent: "center", alignSelf: "center", width: width, height: height / 1.8 }}>
                                                <LottieView
                                                    ref={this.ref}
                                                    source={require("../lottie/search_empty.json")}
                                                    loop={true}
                                                    autoPlay={true}
                                                    speed={1.5}
                                                // style={{ alignSelf: "center" }}
                                                />
                                            </View>
                                        </>
                                    ) : (
                                        <>
                                            {Common.map((item, index) => (
                                                item.view ? (
                                                    // <View style={styles.BoxView}>

                                                    <View style={styles.Box}>
                                                        <Image source={item.Image} style={styles.ImageTabs2}
                                                        />
                                                        <View style={styles.TextViewBox}>
                                                            <Text style={styles.TextBox}>
                                                                {item.name}
                                                            </Text>
                                                        </View>
                                                        <View style={styles.TextTimeBox}>
                                                            <Text style={styles.TimeBox}>
                                                                {item.time}
                                                            </Text>
                                                            <Ionicons name='md-time' style={{ alignSelf: "center" }} size={ICONSSIZE.smIcon} color={COLORS.ButtonWhite} />
                                                        </View>
                                                        <View style={styles.OptionBox}>
                                                            <TouchableOpacity
                                                                onPress={() => {
                                                                    navigation.navigate("Photo_page", {
                                                                        name: item
                                                                    })
                                                                }
                                                                }
                                                                style={styles.OptionButtonBox}>
                                                                <Text style={styles.OptionTimeBox}>
                                                                    الطريقة
                                                                </Text>
                                                            </TouchableOpacity>
                                                            <TouchableOpacity
                                                                onPress={() => {
                                                                    navigation.navigate("WbeView", {
                                                                        name: item
                                                                    })
                                                                }
                                                                } style={styles.OptionButtonBox}>
                                                                <Text style={styles.OptionTimeBox}>
                                                                    الفيديو
                                                                </Text>
                                                            </TouchableOpacity>

                                                        </View>


                                                    </View>
                                                    // </View>
                                                ) : (null)

                                            ))}
                                        </>
                                    )}

                                </ScrollView>
                            </View>

                        </View>
                        <View style={styles.starred}>
                            <View style={styles.Headerstarred}>
                                <Text style={styles.textHeaderstarred}>
                                    المميزة
                                </Text>
                                {/* <Text style={styles.textHeaderstarred2}>
                                    رؤية الكل
                                </Text> */}
                            </View>
                            {star.map((item, index) => (
                                <View style={styles.Boxstarred}>
                                    <View style={styles.ViewImage}>
                                        <Image source={item.Image} style={styles.Imagestarred} />
                                    </View>
                                    <View style={styles.BoxTextStarred}>
                                        <Text style={[styles.textHeaderstarred, { fontSize: FONTS.h2 }]}>
                                            {item.name}
                                        </Text>
                                        <View style={[styles.TextTimeBox, { justifyContent: "center" }]}>
                                            <Text style={styles.TimeBox}>
                                                {item.time}
                                            </Text>
                                            <Ionicons name='md-time' style={{ alignSelf: "center" }} size={ICONSSIZE.smIcon} color={COLORS.ButtonWhite} />
                                        </View>
                                        <View style={styles.OptionBox}>
                                            <TouchableOpacity
                                                onPress={() => {
                                                    navigation.navigate("Photo_page", {
                                                        name: item
                                                    })
                                                }
                                                }
                                                style={styles.OptionButtonBox}>
                                                <Text style={styles.OptionTimeBox}>
                                                    الطريقة
                                                </Text>
                                            </TouchableOpacity>
                                            <TouchableOpacity onPress={() => {
                                                navigation.navigate("WbeView", {
                                                    name: item
                                                })
                                            }
                                            } style={styles.OptionButtonBox}>
                                                <Text style={styles.OptionTimeBox}>
                                                    الفيديو
                                                </Text>
                                            </TouchableOpacity>

                                        </View>

                                    </View>
                                </View>
                            ))}

                        </View>
                    </View>
                    <View style={{ height: 55 }}></View>

                </ScrollView>
            </View>
        </>
    );
}

const styles = StyleSheet.create({
    Header: {
        backgroundColor: COLORS.pramary,
        // marginTop: MARGIN.xxsMargin,
        alignItems: "center",
        flex: 1,
    },
    nameStackView: {
        // backgroundColor: COLORS.white,
        width: width / 1.05,
        height: height / 12,
        alignItems: "flex-start",
        justifyContent: "flex-end",
        marginVertical: MARGIN.xsMargin
    },
    textnameStackView: {
        fontSize: FONTS.h3,
        color: COLORS.orange,
        // fontWeight: "bold",
        fontFamily: "Vazirmatn-VariableFont_wght"
    },
    SearchView: {
        // backgroundColor: COLORS.orange50,
        width: width / 1.05,
        height: height / 9,
        alignItems: "center",
        justifyContent: "space-between",
        marginVertical: MARGIN.xsMargin
    },
    SearchTextheader: {
        fontSize: FONTS.h3,
        color: COLORS.orange,
        alignSelf: "flex-start"
    },
    SearchTextView: {
        backgroundColor: COLORS.white,
        width: width / 1.1,
        // height: height / 15,
        alignItems: "center",
        justifyContent: "center",
        borderRadius: RADIUS.smRadius,
        marginVertical: MARGIN.xxsMargin,

        // borderWidth: 1,
        // borderColor: COLORS.orange,
        // paddingHorizontal: PADDING.xsPadding,
        // fontSize: FONTS.h,
        flexDirection: "row"

    },
    SearchTextInput: {
        // backgroundColor: COLORS.white,
        width: width / 1.4,
        // height: height / 17,
        alignItems: "center",
        alignSelf: "center",
        // backgroundColor:COLORS.black,
        color: COLORS.black,
        justifyContent: "flex-end",
        fontFamily: "Generator Black",
        // borderRadius: RADIUS.lgRadius,
        // borderWidth: 2,
        // borderColor: COLORS.orange,
        paddingHorizontal: PADDING.smPadding,
        fontSize: FONTS.h4
        // marginVertical: MARGIN.xsMargin

    },
    BoxView: {
        width: width,
        // height:height/12,

        backgroundColor: COLORS.pramary,
        flexDirection: "row",
        flexWrap: "wrap",
        padding: PADDING.xsPadding,
        alignItems: "center",
        justifyContent: "space-around",
    },
    Box: {
        width: width / 2.1,
        alignItems: "center",
        // height: height / 15,
        justifyContent: "space-around",

        margin: MARGIN.xsMargin,
        padding: PADDING.lgPadding,
        borderRadius: RADIUS.xxsRadius,
        backgroundColor: COLORS.pramary50

    },
    starred: {
        width: width,
        // backgroundColor: COLORS.black
    },
    Headerstarred: {
        width: width / 1.05,
        flexDirection: "row",
        justifyContent: "space-between",
        alignItems: "center",
        alignSelf: "center",
    },
    textHeaderstarred: {
        fontSize: FONTS.h1,
        color: COLORS.ButtonWhite,
        // fontWeight: "bold",
        fontFamily: "Generator Black"
    },
    textHeaderstarred2: {
        fontSize: FONTS.h5,
        color: COLORS.gray,
        // fontWeight: "bold",
        fontFamily: "Generator Black"
    },
    Boxstarred: {
        width: width / 1.05,
        // height: height / 5,
        alignSelf: "center",
        borderRadius: RADIUS.smRadius,
        backgroundColor: COLORS.pramary50,
        flexDirection: "row",
        marginVertical: MARGIN.xsMargin
    },
    ViewImage: {
        width: width / 2.5,
        height: height / 5,
        alignItems: "center",
        justifyContent: "center",
        // backgroundColor: "#000",
        borderRadius: RADIUS.xxsRadius
    },
    Imagestarred: {
        width: width / 3,
        height: height / 6,
        borderRadius: RADIUS.xxsRadius

    },
    BoxTextStarred: {
        width: width / 1.9,
        height: height / 6,
        alignSelf: "center",
        alignItems: "center",
        justifyContent: "space-between",
        borderRadius: RADIUS.smRadius,
        // backgroundColor: COLORS.black,
        // paddingVertical:54

    },
    textDetelsstarred: {
        fontSize: FONTS.h5,
        color: COLORS.grayICon,
        // fontWeight: "bold",
        fontFamily: "Generator Black"
    },
    Dessercommon: {
        height: height / 2.2,
        width: width / 1.05,
        // backgroundColor: COLORS.red
    },
    DessercommonHeader: {
        flexDirection: "row",
        justifyContent: "space-between",
        // backgroundColor:"#000"
    },
    TextCommon: {
        fontSize: FONTS.h3,
        color: COLORS.orange,
        alignSelf: "flex-start"
    },
    Image: {
        width: 35,
        height: 35
    },
    Dessercommon2: {
        width: width / 2,
        // backgroundColor:COLORS.background,
        alignItems: "flex-end"
    },
    DessertCommon: {
        height: height / 2.4,
        width: width,
        // backgroundColor: COLORS.red,
        justifyContent: "center"
    },
    ButtonTabs: {
        width: width / 2,
        height: height / 2.5,
        backgroundColor: COLORS.orange50,
        borderColor: COLORS.ButtonWhite,
        borderEndWidth: 5,
        borderRadius: RADIUS.xlRadius,
        // justifyContent: "space-evenly",
        alignItems: "center",
        marginHorizontal: MARGIN.xsMargin,
    },
    ImageTabs: {
        width: width / 2.1,
        height: height / 5,
        borderTopRightRadius: RADIUS.xlRadius,
        borderTopLeftRadius: RADIUS.xlRadius,
    },
    TextTabs: {
        fontSize: FONTS.h4,
        color: COLORS.white,
    },
    TabsofTabs: {
        width: width / 2,
        height: height / 6,
        // backgroundColor: COLORS.gray,
        // flexDirection: "row",
        justifyContent: "space-evenly",
        alignItems: "center",
        borderRadius: RADIUS.x5lRadius,
        // marginTop:5,backgroundColor:"#000",

    },
    the_Two_button: {
        backgroundColor: COLORS.orange,
        borderRadius: RADIUS.xsRadius,
        flexDirection: "row",
        // width: width/5,
        padding: PADDING.xsPadding,
        // height: height/16,
        alignItems: 'center',
        justifyContent: "center",
    },
    ViewBoth: {
        flexDirection: "row",
        justifyContent: "space-around",
        alignItems: "center",
        width: width / 2,
    },
    Dessert: {
        width: width / 1.05,
        // height: height,
        // backgroundColor: COLORS.gray,
        alignItems: "center",
    },
    DessercommonHeader1: {
        flexDirection: "row",
        justifyContent: "space-between",
        width: width / 1.05

    },
    DessertMain: {
        margin: MARGIN.xsMargin,
        width: width / 2.4,
        height: height / 2.5,
        backgroundColor: COLORS.grayFont,
        justifyContent: "flex-start",
        alignItems: "center",
        borderRadius: RADIUS.lgRadius,
    },
    ImageTabs2: {
        width: width / 2.4,
        height: height / 5,
        borderRadius: RADIUS.xxsRadius,
    },
    TextViewBox: {
        // backgroundColor: "#000",
        width: width / 2.4,
        alignItems: "flex-start"
    },
    TextBox: {
        fontSize: FONTS.h4,
        color: COLORS.white,
        fontFamily: "Generator Black",
        textAlign: "left"
    },
    TextTimeBox: {
        width: width / 2.4,
        alignItems: "center",
        flexDirection: "row",
        // alignItems:"center",
    },
    TimeBox: {
        fontSize: FONTS.h4,
        color: COLORS.white,
        fontFamily: "Generator Black",
        alignSelf: "center",
        marginHorizontal: 2
    },
    OptionBox: {
        width: width / 2.4,
        alignItems: "center",
        justifyContent: "space-around",
        flexDirection: "row",

    },
    OptionButtonBox: {
        width: width / 6,
        backgroundColor: COLORS.orange,
        borderRadius: RADIUS.smRadius,
        alignItems: "center",
        justifyContent: "center",
    },
    OptionTimeBox: {
        fontSize: FONTS.h5,
        color: COLORS.white,
        fontFamily: "Generator Black",
        alignSelf: "center",
        marginHorizontal: 2
    },
    TextTabs2: {
        fontSize: FONTS.h6,
        color: COLORS.white,
    },
    TabsofTabs2: {
        width: width / 2.6,
        height: height / 7.5,
        backgroundColor: COLORS.gray,
        // flexDirection: "row",
        justifyContent: "center",
        alignItems: "center",
        borderRadius: RADIUS.xlRadius,
    },
    the_Two_button2: {
        backgroundColor: COLORS.orange,
        borderRadius: RADIUS.xlRadius,
        flexDirection: "row",
        width: width / 6,
        height: height / 18,
        alignItems: 'center',
        justifyContent: "center",
    },
    ViewBoth2: {
        flexDirection: "row",
        justifyContent: "space-around",
        alignItems: "center",
        width: width / 2.6,
    },

});
