import React, { useState } from 'react';
import {
    StyleSheet,
    View,
    Text,
    Image,
    StatusBar,
    TouchableOpacity,
    ImageBackground,
    Dimensions,
    TextInput,
    ScrollView,
} from 'react-native';
import { RFPercentage, RFValue } from 'react-native-responsive-fontsize';
import { COLORS, PADDING, MARGIN, RADIUS, FONTS, ICONSSIZE } from '../constants/Constants'
import Ionicons from 'react-native-vector-icons/Ionicons'
import Octicons from 'react-native-vector-icons/Octicons'
const { width, height } = Dimensions.get('window');
import * as Animatable from 'react-native-animatable';
import Photo_page from '../screen/Photo_page'
import { useNavigation, NavigationContainer } from '@react-navigation/native';
import { createNativeStackNavigator } from '@react-navigation/native-stack';
import LottieView from 'lottie-react-native';


export default function Food() {
    const [Common, setCommon] = useState(
        [
            {
                Image: require("../img/download.jpg"),
                name: "الملوخية ",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: '1 باقة ملوخية طازجة أو مجمد\nة  1 كيلو لحم بقري مقطع إلى مكعبات صغيرة\n  2 بصلة متوسطة الحجم مفرومة\n  4 فصوص ثوم مفرومة\n  1/2 كوب كزبرة مفرومة\n  1/2 كوب بقدونس مفروم\n1 ملعقة صغيرة بهارات مشكلة\n 1 ملعقة صغيرة كركم\n 1 ملعقة صغيرة فلفل أسود\n  1 ليمونة مقطعة إلى شرائح\n ملح حسب الذوق\n 2 لتر ماء\n زيت نباتي للطهي\n ',
                Step: "يغسل اللحم ويترك جانباً.\n تقشر البصلة وتفرم جيداً ويضاف إليها الثوم وتخلط معاً.\n تسخن الزيت في قدر كبير ويضاف البصل والثوم ويقلب حتى يصبح لونهما ذهبياً.\n يضاف اللحم وتقلب جيداً حتى يصبح لونه بنياً.\n يضاف الملوخية ويقلب جيداً لمدة 5 دقائق.\n يضاف الماء والتوابل ويترك المزيج يغلي.\n يقلب المزيج جيداً ويترك ليطهى لمدة ساعة تقريباً أو حتى يصبح اللحم طرياً والملوخية مطهوة.\n يضاف الكزبرة والبقدونس ويترك المزيج لمدة 5 دقائق ثم يزال من النار.\n يقدم المزيج الساخن مع الأرز وشرائح الليمون. ",
                video: "https://www.youtube.com/watch?v=bFMVOZFjCmM",
                categortType: 4,
        
        
              },
              {
                Image: require("../img/download1.jpg"),
                name: "طاجن مكرونة بشاميل ",
                view: true,
                time: " 50 min",
                Elta7der: '10 min',
                Eltahy: "40 min",
                Elsouba: "30",
                components: '½ كيلو مكرونة بنة او اقلا\nم ماء للغلى\n ملح\n الحشو:\n ¼ كيلو لحمة مفرومة\n ملح\n فلفل اسمر\n بصلة مفرومة او مقطعة صغير\n البشاميل:\n 4 معالق دقيق\n  لتر لبن\n معلقتين سمن\n مكعب مرق\n ملح\n فلفل\n جبن رومى او موتزريلا',
                Step: "فى حلة يغلى الماء ثم يضاف المكرونة والملح وتترك لتستوى ثم تصفى ولا تغسل \nفى طاسة يوضع البصل والسمن حتى تصبح البصل ذهبى اللون يضاف اللحمة ويقلب ثم يضاف الملح والفلفل\nفى حلة يضاف السمن والدقيق ويقلب ثم يضاف اللبن والملح والفلفل والمكعب المرق ويقلب حتى يتقل القوام\nتحضر البرامات الصغيرة او الطواجن الصغيرة تدهن بمادة دهنية\nيضاف قليل من البشاميل الى المكرونة ويقلب ثم توضع طبقة من المكرونة فى البرام ثم يضاف اللحمة ثم توضع الطبقة الثاتية\n يغطى الوجه بالبشاميل و الجبن وتدخل فرن ساخن لمدة 20 دقيقة ",
                video: "https://www.youtube.com/watch?v=jzr_0t74aJA",
                categortType: 2,
        
        
              },
              {
                Image: require("../img/makronabldggag.jpg"),
                name: "مكرونة كريمية بالدجاج ",
                view: true,
                time: " 60 min",
                Elta7der: '10 min',
                Eltahy: "50 min",
                Elsouba: "50",
                components: 'تتبيلة الدجاج:\n2 صدور دجاج 4 ملاعق كبيرة زيت نباتي\n 1 ملعقة كبيرة توابل كيچن \n 1 ملعقة صغيرة بودرة بصل\n 1 ملعقة صغيرة بودرة ثوم\n  1 ملعقة صغيرة بقدونس مجفّف\n 1 ملعقة صغيرة بهارات دجاج\n 1/2 ملعقة صغيرة بابريكا المكرونة:\n 500 جرام مكرونة أقلام \n1 كوب كريمة طبخ\n1 كوب مرقة دجاج\n1/2 كوب "115 جرام" جبنة كريمية\n1 حبّة بصل مفروم\n1 حبّة طماطم مقطّعة مكعبات\n1 حبّة فلفل رومي مقطّع مكعبات\n1 ملعقة كبيرة زبدة\n1 ملعقة صغيرة بودرة مرقة دجاج\n1 ملعقة صغيرة توابل كيچن\n1/2 ملعقة صغيرة ثوم مهروس\nملح - فلفل أسود\nة ',
                Step: "نسلق المكرونة بالطريقة المعتادة ثم نصفّيها ونتركها جانباً ونبدأ أولاً بتجهيز الدجاج، إذا كانت الصدور سميكة نضعهم بين طبقتين من الورق الشفاف ونَدُقّهم وهذا حتى ينضجوا تماماً من الداخل ثم ندهنهم بملعقة كبيرة من الزيت\nهذه بهارات الكيچن التي استخدمتها بالوصفة وهي تُضفي نكهة مميزة ولذيذة جداً للطبق، نخلط كل مكونات التتبيلة معاً بطبق صغير ونغلّف بهم صدور الدجاج\nوبمقلاة عميقة وغير لاصقة نسخّن حوالي 3 ملاعق كبيرة من الزيت ونشوِّح به الدجاج لمدة 10 دقائق تقريباً مع التقليب المستمر على كل الجوانب حتى ينضجوا تماماً ثم نُخرجهم جانباً ونتركهم لتهدأ حرارتهم قليلاً\n بنفس المقلاة نُذيب الزبدة ونشوِّح بها البصل والثوم حتى يلين قوام البصل ثم نُضيف مكعبات الفلفل والطماطم وعندما يلين قوام الخضروات نضع الكريما ومرقة الدجاج ثم الجبنة الكريمية ونقلّب جيداً حتى تتجانس المكونات ثم نُضيف بودرة مرقة الدجاج وبهارات الكيچن ونتبّل بالملح والفلفل الأسود\nوعندما يبدأ الخليط بالغليان نُضيف المكرونة المسلوقة مع التقليب الجيد حتى تختلط بها كل المكونات ثم نقطّع صدور الدجاج إلى شرائح ونقلّبهم مع المكرونة ونترك بعض الشرائح جانباً لوضعهم على الوجه عند التقديم النهائي\nنرفع المكرونة عن النار وتوضع بأطباق التقديم ونرُش الوجه بالقليل من الجبنة المبشورة أو نزيّن حسب الرغبة\nوأخيراً تُقدَّم مكرونة الدجاج والكيچن ساخنة",
                video: "https://www.youtube.com/watch?v=rFOASDE9kgs",
                categortType: 1,
        
        
              },
              {
                Image: require("../img/15489737431619515555.jpg"),
                name: "كفتة",
                view: true,
                time: " 30 min",
                Elta7der: '10 min',
                Eltahy: "20 min",
                Elsouba: "50",
                components: 'لحمة مفرومة، بصل، ثوم، بقدونس، كمون، فلفل، ملح، طحين، زيت',
                Step: 'تُخلط اللحمة المفرومة مع البصل المفروم والثوم والبقدونس والكمون والفلفل والملح والطحين. تُشكل الخليط إلى كفتة وتُقلى في الزيت حتى تنضج.',
                video: "https://www.youtube.com/watch?v=0l9HiHwM5Vc",
                categortType: 4,
        
              },
              {
                Image: require("../img/download(1).jpg"),
                name: "طاجن مكرونة بالكبدة",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: '½ ك كبدة مقطعة ومحمره\nمعلقة سمن\nةمعلقة ملح شطة بهارات\n بصلة مقطعة\n 2 قرن فلفل مقطع\n½ مكرونة مقطعة\n2 معلقة صلصة',
                Step: "هنجيب حلة ونحط السمنة ونحط البصل ونقلب\nبعد كدة نحط الصلصة والطماطم\nوالتوابل والبهارات ونسيبة تسبك\nهنجيب الطاجن ونحط الكبدة ونحط المكرونة ونحط الفلفل\nونحط التسبيك وندخلة الفرن",
                video: "https://www.youtube.com/watch?v=_Mn_V9atVCM",
                categortType: 2,
        
              }
              ,
              {
                Image: require("../img/733.jpg"),
                name: "صينية بطاطس باللحمة",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "40",
                components: '1 كيلو لحمة مسلوقة \n 1 كيلو بطاطس \n  3 كوب عصير طماطم\n 1 كوب ماء بصلة حلقات \n 1 ملعقة صغيرة ثوم مفروم  \n1 ملعقة كبيرة سمنة \n فلفل حار  حسب الرغبة\n  ملح  \n فلفل أسود ',
                Step: "شوحي البصل في زيت مخصص للطهى على النار مع إضافة ذرة ملح له حتى تذبل ثم تضاف قطع اللحمة وتحمر قليلا ثم يضاف عصير الطماطم والثوم ويقلب الخليط بشكل جيد\n ضعي شرائح البطاطس في صينية مع الفلفل الحار حسب الرغبة و يضاف خليط الطماطم والطماطم إلى البطاطس و يضاف الماء والملح والفلفل الأسود\n توضع الصينية على النار لتغلي ثم توضع في الفرن وانتظري حتى تمام النضج ",
                video: "https://www.youtube.com/watch?v=QaGmEgUaODc",
                categortType: 5,
        
        
              },
              {
                Image: require("../img/flafel.jpg"),
                name: "فلافل بيتي بالخلاط",
                view: true,
                time: " 40 min",
                Elta7der: '35 min',
                Eltahy: "5 min",
                Elsouba: "30",
                components: '1/2 ك فول مدشو\nش 1 بصلة كبيرة\n3 حزم كرات\n  2 حزمة بقدونس\n 1 راس ثوم',
                Step: "يبل الفول ف الماء قبلها بيوم\nيقطع الكرات والبقدونس ويغسل\nيقطع البصل مكعبات ويقشر الثوم\nف كبة الخلاط نضع الخليط ونضرب الي أن تصير ناعمه\nتحفظ ف اكياس ف الثلاجة وعند الاستخدام نضيف على العجين ملح وشطة وكمون وكزبرة حصي ونص ملعقة صغيرة بيكنج بودر\nيشكل العجين لاقراص وتتبل ف السمسم الابيض وتقلي بالزيت",
                video: "https://www.youtube.com/watch?v=3qn7YG4vTdw",
                categortType: 4,
        
        
              },
              {
                Image: require("../img/484.jpg"),
                name: "جلاش باللحمة المفرومة",
                view: true,
                time: " 30 min",
                Elta7der: '10 min',
                Eltahy: "20 min",
                Elsouba: "30",
                components: '½ كيلو لحمة معصج\nة لفة جلاش\n بيضتين\n كوب لبن\n ¼ معلقه صغيره فلفل اسود\n ¼ معلقه صغيره ملح\n معلقتين كبار سمن \n  ',
                Step: "هنحضر اللحمة ونخليها على جمب لينك الوصفة فالمكونات \nهندهن صينيه كبيره بالسمن وهنفتح الجلاش هناخد ورقتين ونرص نصهم فالصينيه ونصم برا\nوناخذ ورقتين تاني ونرصهم نصهم في الصينيه ونصهم برا وبين كل راق والتاني هنضيف مسحة من السمن هنضيف اللحمة ونطبق ورق الجلاش الي برا على الحشو\nوبين كل تطبيقه والتانيه هنضيف مسحة سمنه لما تقفل خالص وعلى الوش هنضيف ورقه كاملة وبعدين نقطعها حسب الرغبة يامربعات يامثلثات ومسحة سمن عالوش\nفي طبق صغير هنضيف اللبن والبيض والملح والفلفل الأسود ونربهم مع بعض حلو اوي ونوزعه على وش الجلاش وندخلها الفرن تستوي على درجة حرارة ١٨٠ وتتحمر من الوش تتقدم سخنة وبالهنا ",
                video: "https://www.youtube.com/watch?v=me3ZoOCpb6U",
                categortType: 4,
        
              },
              {
                Image: require("../img/m5zn_12528406b9a94fc.jpg"),
                name: "الفراخ المشوية بالبقدونس والجزر",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "50",
                components: '6 افخاذ دجا\nج التتبيلة، معلقه ونص كبار ملح\n4 معالق كبار عسل اسود\n½ معلقة صغيره فلفل اسود\n½ معلقة صغيره كاري\n معلقه صغيره زعتر\n 4 معالق كبار خل\n بصله كبيره مبشورة\n ½ كوب جزر مبشور\n معلقتين كبار بقدونس متقطع\n معلقه صغيرة توم مفروم',
                Step: "هنغسل الفراخ وتتقطع ونخليها تتصفي خالص من الميه\nفي بولة غويطة هنضيف مكونات التتبيلة كلها ونقلبها مع بعض حلو اوي\nفي بولة غويطة هنضيف مكونات التتبيلة كلها ونقلبها مع بعض حلو اوي\nهنرصها فالصينيه وندخلها الفرن تتشوي على درجة حرارة ٢٢٠ وتتقدم سخنة مع المكرونة او الأرز وبالهنا ",
                video: "https://www.youtube.com/watch?v=INcw74ZiYnY",
                categortType: 1,
              },
              {
                Image: require("../img/4647824981584556199.jpg"),
                name: "بطاطس محشية باللحمة المفرومة",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: 'كيلو بطاطس صغير\nه½ كيلو لحمه مفرومه\nبصل\nم ص ملح وفلفل\nم ص بهارات\n2 م ك صلصه\nم ص توم مفروم\nم ص بابريكا',
                Step: "تقشر البطاطس وتقور ثم تغسل بالماء ثم تحمر فى زيت غزير\nنقوم بتعصيج اللحمه بوضع معلقه سمنه فى وعاء مناسب ثم ننزل بالبصل يدبل ثم اللحمه ونتبلها ونتركها تنضج\nنقوم بحشو اللحمه داخل البطاطس ثم نرصها فى صينيه\nفى طاسه صغيره ننزل بمعلقه زيت ثم التوم والصلصه والتوابل ثم نسقى بها البطاطس ثم ندخلها الفرن تحمر ونخرجها نقدمها بالف هنا",
                video: "https://www.youtube.com/watch?v=Bybn0UwkOrU",
                categortType: 4,
        
        
              },
        
              {
                Image: require("../img/rokak.jpg"),
                name: "رقاق طري باللحمة المفرومة",
                view: true,
                time: "40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: ' لفه رقاق طري.\n نصف كيلو لحم مفروم.\n بصلة كبيرة مبشورة.\n طماطم مبشورة.\n معلقة صلصة كبيرة.\n مرقة دجاج.\n توابل لحم.\n فلفل أسود.\n فلفل أخضر مقطع.\n ملح.\n لبن.\n شوربة لحم أو فراخ.\n سمن.',
                Step: "نحضر صينية متوسطة مدهونة بالسمن، ثم نضع ورقة واحدة من الرقاق ونمسح بالسمن، ونكمل بهذه الطريقة حتى نكمل نصف الكمية الموجودة من الرقاق.\nنضع اللحم المفروم المعصج في المنتصف ونكمل باقي الأوراق بهذه الطريقة. \nنضع الشوربه من فوقها وتدخل الفرن على درجة حرارة متوسطة حتى يحمر الوجه ويقدم ساخنا. ",
                video: "https://www.youtube.com/watch?v=Op3UgTR3ujE",
                categortType: 4,
        
        
              },
        
              {
                Image: require("../img/54423-55.jpg"),
                name: "طاجن بطاطس باللحمة",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: 'ك بطاطس مقط\nعك لحمة مقطع\n ك طماطم معصور\n3 فص ثوم مقطع\n بصلة مقطعة\n2 معلقة ملح فلفل\n ملعقة كزبرة\n معلقة بهارات على جوزة الطيب\n ورقة لوري على حبهان',
                Step: "هنجيب حلة ونحط فية طماطم وبصلة ولوري وحبها\nونسيبة تغلى نحط للحمة\nاول متخش في السوية نحط ملعقة ملح وفلفل\nبعد كدة هنجيب الطاجن الطاجن ونحط البطاطس واللحمة والبصل والملح\nونحط التوابل والبهارات ونقلبهم في بعض\nونحط الطماطم ومعلقة سمنة\nونغطية بفويل وندخلة الفرن\nلاحد السوية\nهنشيل الغط ونحطة تحت الشوية",
                video: "https://www.youtube.com/watch?v=UiPWYbzN0-U",
                categortType: 6,
        
        
              },
        
              {
                Image: require("../img/meatWithfrek.jpg"),
                name: "طاجن لحمة بالفريك",
                view: true,
                time: " 50 min",
                Elta7der: '10 min',
                Eltahy: "40 min",
                Elsouba: "60",
                components: '¼ ك فريك مغسول ومنقوع\n ½ ك لحمة مقطع\n معلقة سمنة\n2 معلقة زيت\n ملعقة صلصة\n بصلة مقطعة\n2 معلقة ملح وفلفل\n معلقة \n جوزة الطيب',
                Step: "هنجيب حلة ونحط السمنة ونحط اللحمة ونشوحة لاحد ميتغر اللون\nهنحط مياه ساخنة ونحط بصلة وطماطمة ونسيبة تخش في السوية\nنحط ملعقة ملح وفلفل\nهنجيب حلة ونحط ملعقة سمنة ونحط بصلة ونقلب ونحط الصلصة\nونحط ٢كوبية شوربة ونسيبة\nتغلى نحط الفريك ونحط التوابل والبهارات والملح ونسيبة يشرب\nهنجيب الطاجن ونحط الفريك واللحمة وندخلة الفرن\n",
                video: "https://www.youtube.com/watch?v=dQNoYn_7bA0",
                categortType: 6,
        
              },
              {
                Image: require("../img/1613190183_node.png"),
                name: "كشري مصري",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: 'معكرونة : 1 كيلو (مشكلة)\n  الأرز المصريّ : نصف كيل\nو العدس : نصف كيلو\n طماطم : 1 كيلو\n الثوم : 10 فصوص\n شعيرية : ربع كيلو\n البصل : 3 حبات\n الخل : حسب الحاجة\n ملح : حسب الرغبة\n الشطة : حسب الحاجة\n الكمون : حسب الرغبة\n حمص : ربع كيلو\n عصير الليمون : حسب الرغبة\n الزيت : حسب الحاجة\n الكزبرة : ربع ملعقة صغيرة',
                Step: "حمري 5 فصوص ثوم جيداً وأضيفي الطماطم بعد تصفيتها وضعي نصف ملعقة فلفل أسود وملعقة ونصف ملح و٤ ملعقة خل واتركيهم يغلوا جيداً حوالي نصف ساعة مع تزويد الماء ونتركها حتى تستوي. اغسلي نصف كيلو العدس جيداً ونغطيه بالماء ونزود ونضيف الثوم والبصل ونصف ملعقة كبيرة ملح ويترك على النار.\n ضعي في قدر 4 ملعقة زيت ونضيف الشعيرية ونحمرها جيداً ونغسل الأرز وينزل به على الشعيرية مع ملعقة من الملح والماء وتترك المكونات نصف ساعة حتى يستوي الأرز.\n في قدر آخر نضع الحمص حتى ينسلق مع نصف ملعقة صغيرة ملح.\n لتحضير الدقة: افرمي الثوم وضع كوب من الخل وكوب ماء ثم نصف ملعقة ملح ونصف ملعقة كمون وربع ملعقة كزبرة مطحونة.\n لتحضير الشطة: اضربي الطماطم في الخلاط وضعيهم في قدر وأضيفي 5 ملعقة من صلصة الكشري وعصير الليمون وملعقة كبيرة خل و5 ملعقة صغيرة شطة وملعقة ملح صغيرة وكوب من الماء ويترك ليغلي 5 دقائق.\n اسلقي المكرونة في الماء والزيت والملح وتصفى ونضيف 3 ملعقة زيت ونقلبها.\n حمري البصل الشرائح المغطى بالدقيق في الزيت الغزير حتى يتحمر.\n ضعي المكرونة في طبق التقديم، وأضيفي الأرز مع العدس والحمص وعليهم الصلصة والبصل المقرمش وضعي الدقة والشطة بأطباق جانبية.",
                video: "https://www.youtube.com/watch?v=RX6k_VjkM1M",
                categortType: 4,
        
              },
              {
                Image: require("../img/46188.jpg"),
                name: "ورق عنب",
                view: true,
                time: " 60 min",
                Elta7der: '20 min',
                Eltahy: "40 min",
                Elsouba: "90",
                components: 'نصف كيلو ورق عنب مسلوق.\n 2كوب كبير من عصير الطماطم.\n حزمه بقدونس.\n بصل مفروم.\n  ملعقة كبيرة سمن بلدي أو نباتي.\n ملح وبهارات محشي.\n 2 كوب مرقه دجاج أو لحم.\n 2 كوب أرز ابيض مغسول ومصفي جيداً من الماء.',
                Step: "تحضير وعاء مناسب وإضافة السمن مع البصل ويقلب جيداً لمدة دقيقتين ثم إضافة عصير الطماطم و الملح وبهارات المحشي  ويترك الطماطم على النار حتى يصبح خليطه سميك ثم إضافة البقدونس المفروم والأرز مع التقليب جيداً في وعاء مع إضافة شرائح من البصل والطماطم ثم حشو ورق العنب بخلطة الأرز ورصه بطريقه منظمه ومرتبة وبعد الانتهاء تضاف المرقة مع معلقة كبيرة من السمن ويطهي ورق العنب على نار عالية لمدة 10 دقائق ثم تهدئة النار ويطهي لمدة 40 دقيقة ويقدم ورق العنب ساخن مع الدجاج أو اللحم أو البط.",
                video: "https://www.youtube.com/watch?v=ELp9zkImO_8",
                categortType: 4,
        
              },

              {
                Image: require("../img/0fde4266664dbd6a75ef98da2fd8bb01_w750_h500.jpg"),
                name: "باذنجان محشي  ",
                view: true,
                time: " 50 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "50",
                components: '- الأرز المصريّ : كيل\nو- البصل : 3 حبات (مفروم)\n  - عصير الطماطم : 4 اكواب\n  - مرق دجاج : 4 اكواب\n  - الشبت : نصف كوب\n - بقدونس : نصف كوب\n  - كزبرة خضراء : نصف كوب\n - صلصة طماطم : ملعقة كبيرة\n  - الزيت : ملعقة كبيرة\n - القرفة : نصف ملعقة صغيرة\n - نعناع ناشف : ملعقة صغيرة\n - بهارات مشكلة : ملعقة كبيرة\n  - فلفل أسود : ملعقة \n - جوزة الطيب : ربع ملعقة صغيرة\n  - الشطة : نصف ملعقة صغيرة\n - ملح : حسب الرغبة',
                Step: "على نار متوسطة سخني الزيت ثم أضيفي البصل وقلبيه حتى يذبل ثم أضيفي صلصة الطماطم و3 أكواب من عصير الطماطم وقلبي ثم اتركيها حتى تغلي. أضيفي مكعب المرق وقلبي لمدة 5 دقائق وفي وعاء كبير ضعي الأرز والكزبرة والشبت والبقدونس وخليط البصل والطماطم والنعناع والقرفة والبهارات وجوزة الطيب والفلفل الأسود والملح والفلفل الحار وقلبي جيداً.\n  احشي الباذنجان بالأرز واتركي مقدار عقلة اصبع حتى تسمحي للأرز بالتمدد أثناء النضج وعلى نار متوسطة ضعي باقي عصير الطماطم والمرق واتركيه حتى يغلي.\n رصي الباذنجان في القدر ثم صبي المرق في داخل كل ثمرة باذنجان ثم صبي باقي المرق في قاع القدر حتى يصل إلى منتصف الباذنجان ثم غطي القدر واتركيه على نار متوسطة حتى يغلي المرق.\n أخفضي النار لتصبح هادئة واتركيه لمدة 60 دقيقة حتى ينضج وقدميه ساخناً.",
                video: "https://www.youtube.com/watch?v=QvLdDdt_XoI",
                categortType: 4,
        
              },
              {
                Image: require("../img/f3e6936fc09d00be1c90bec714625521_w750_h500.jpg"),
                name: "كفته داوود باشا",
                view: true,
                time: " 60 min",
                Elta7der: '20 min',
                Eltahy: "40 min",
                Elsouba: "60",
                components: '- مقادير الصلصة :\n البصل : 1 حبة (مفروم)\n الثوم : فصّان (مهروس)\n صلصة طماطم : 2 كوب\n معجون الطماطم : 2 ملعقة صغير\nة الزيت النباتي : 2 ملعقة كبيرة\n الماء : ربع كوب\n - لحم مفروم : 500 غراماً\n - البصل : 1 حبة (مفروم)\n - كزبرة خضراء : ربع كوب (مفرومة)\n - بقدونس : نصف كوب (مفروم)\n - الزيت النباتي : ربع كوب\n - فلفل رومي : 1 حبة (مفروم)\n  - الثوم : فصّان (مهروس)\n - فلفل أسود : نصف ملعقة صغيرة\n - كزبرة يابسة : ملعقة صغيرة\n - بهارات مشكلة : ملعقة صغيرة',
                Step: "في وعاء للخلط، ضعي اللحم، والكزبرة، والبصل، والبقدونس، والثوم، والفلفل الأسود، والبهارات، والفلفل الرومي، والكزبرة الجافة، اخلطي المكونات حتى تتداخل.\n حمّي الزيت في مقلاة على نار متوسطة، وشكلي كرات متساوية الحجم من خليط اللحم، وضعيه في المقلاة، وقلبي حتى يتغير لونها وتنضج، ثم ارفعيها من المقلاة وضعيها في طبق جانبي.\n في مقلاة على النار، سخني الزيت، ثم أضيفي البصل والثوم وقلبي حتى يذبلا.\n أضيفي معجون الطماطم، وصلصة الطماطم، والملح، والبهارات المشكلة، والماء وحركي المكونات حتى تتداخل.\n عند الغليان خففي النار، وأضيفي كرات اللحم، ثم غطي المقلاة، واطبخي المكونات حتى تنضج وتكثف الصلصة.\n يقدم ساخناً بجانب الأرز الأبيض.",
                video: "https://www.youtube.com/watch?v=hcRuAVoOIQI",
                categortType: 4,
        
              },
              {
                Image: require("../img/b370dcb6a455f9e136588beaec699d2d_w750_h500.jpg"),
                name: "محشي الكوسا والباذنجان ",
                view: true,
                time: " 65 min",
                Elta7der: '25 min',
                Eltahy: "40 min",
                Elsouba: "70",
                components: '- الباذنجان : نصف كيل\nو- الكوسا : نصف كيلو\n- الأرز : 2 كوب (مغسول ومصفى)\n- البصل : 1 حبة (مفروم)\n- بقدونس : نصف كوب (مفروم)\n- طماطم : 2 حبة (مقطعة)\n- الثوم : 3 فصوص\n- لحم مفروم : ربع كيلو\n- زيت الزيتون : نصف كوب\n- مرق دجاج : مكعب\n- نعناع ناشف : ملعقة صغيرة\n- ملح : حسب الرغبة\n- فلفل أسود : حسب الرغبة\n- البطاطس : 2 حبة (مقطعة شرائح)\n- ماء ساخن : حسب الحاجة',
                Step: "احفري الكوسا والباذنجان أزيلي اللبّ من الداخل، ثم اغسلي الخضار جيداً وصفيها.\nحضري وعاء، واخلطي اللحم المفروم، والطماطم، والبصل، والبقدونس، والأرز المغسول.\nأضيفي الملح، والفلفل الأسود حسب الرغبة، والثوم، والنعناع الجاف، وزيت الزيتون، وقلبي المكونات جيداً حتى تمتزج تماماً.\nاحشي الكوسا والباذنجان بالخليط دون ملئها.\nحضري قدر، وضعي به القليل من الزيت ويتم رص شرائح البطاطس به.\nضعي الكوسا والباذنجان فوق البطاطس، وأضيفي الماء المغلي مع مرق الدجاج والملح.\nضعي القدر على النار مع تغطيه، واتركيه حتى الغليان، ثم خففي النار، واتركيه حتى تنضج الخضار.\nقبل الإستواء ضعي الثوم المهروس مع ملعقة كبيرة نعناع جاف واتركيه لعشر دقائق إضافية.\n اسكبي المحشي في طبق التقديم وقدميه ساخناً.",
                video: "https://www.youtube.com/watch?v=5El4aaTrCVg",
                categortType: 4,
        
              },
              {
                Image: require("../img/202109041239143914.jpg"),
                name: "ارز معمر",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: 'يتم معايرة الأرز بنصف كمية البرا\nم لتر حلب\n كريمة لباني\nزبدة\n  قشطة\n ملح',
                Step: "يتم غسل الأرز جيداً قبل أن يصف\nى قومي بوضع كمية الأرز والتي تكون نصف حجم البرام في الطاجن\n يوضع عليه معلقة كبيرة من الزبدة البقري أو الفلاحي\n علبة كريمة لباني صغيرة للطبخ قومي بوضعها على الأرز\n يغطى تماماً بالحليب المغلي على أن يغمر الأرز به\n ثم يوضع عليه الملح فقط حسب الرغبة\n ملحوظة: ا يوضع عليه توابل لكي يظهر به طعم القشطة والزبدة في الطاجن فلا يتم وضع أي توابل غير الملح\n ثم توضع في الفرن على درجة حرارة متوسطة 180 درجة حتى يصل الأرز بأن يتشرب من الحليب تماماً توضع القشطة على وجه الطاجن\n يترك في الفرن حتى يحمر وجه برام الأرز المعمر ويكتمل نضوجه\n يمكن وضع قطع من الحمام مسلوق أو قطع من اللحم البتلو المسلوق أو كبد الدجاج مسلوقة أو صدور فراخ بقلب الطاجن\n يمكنك إضافة جوز الطيب حسب الرغبة",
                video: "https://www.youtube.com/watch?v=IHWqrDccHuA",
                categortType: 4,
        
              },
              {
                Image: require("../img/104-233834-how-sambosk-works-with-cheese-2.png"),
                name: "سمبوسه بالجبنه",
                view: true,
                time: " 20 min",
                Elta7der: '10 min',
                Eltahy: "10 min",
                Elsouba: "50",
                components: '1/2 كيلو سمبوس\nهقطعتين جبنه قريش\n2 فلفل اخضر متقطع\n1 بصله متوسطه متقطعه\nرشة فلفل اسود\nرشة ملح\nرشة كمون\nرشة كزبره\nمعلقه صغيره زيت زيتون او نباتي',
                Step: "هنضيف كل المكونات ع الجبنه ونخلطهم كويس\nهنحشي السمبوسه ع شكل مثلثات\nونسخن الزيت ونحمرها فيها الي ان تأخذ اللون الذهبي",
                video: "https://www.youtube.com/watch?v=tYb2mKyU9kw",
                categortType: 4,
        
              },

        ])
    const [IconSearch, setIconSearch] = useState(true)
    const [search, setsearch] = useState("")

    const [star, setstar] = useState(
        [
            {
                Image: require("../img/kkkk.jpg"),
                name: "فطيرة الدجاج",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "70",
                components: 'زيت الزيتون للقل\nي1 بصل مقطع شرائح\n2 فص ثوم مفروم\n3 كوب صدر دجاج ، مطبوخ ومقطع شرائح\n1 كوب معجون طماطم\nملح حسب الذوق\nفلفل أسود حسب الذوق\nبقدونس مفروم حسب الذوق\n2 كوب حليب\n1 كوب زيت\n2 ملعقة كبيرة زبدة\n5 بيضات\n2 بطاطس مطهية، مهروسة\n2 كوب دقيق قمح\n1 ملعقة كبيرة بايكينج باودر\n1 كوب جبن كريمي برازيلي\n½ 1 كوب جبن موزاريلا',
                Step: "في مقلاة، حمري البصل والثوم، ثم أضيفي الدجاج واطهيه حتى يصبح ذهبي اللون.\nأضيفي معجون الطماطم ثم تبليه بالملح، الفلفل والبقدونس المفروم. اتركي المزيج جانباً.\nفي الخلاط، اخفقي الحليب مع الزيت، الزبدة، البيض والبطاطس المهروسة. انقلي الخليط إلى وعاء ثم أضيفي دقيق القمح والبايكينج باودر مع رشة من الملح.\nاسكبي نصف العجين في صحن فرن مدهون بالزبدة، ثم وزعي خليط الدجاج فوقه بالتساوي باستخدام ملعقة، ثم أضيفي الجبن الكريمي وجبن الموزاريلا.\nغطي الحشو بالعجين المتبقي ثم اخبزي الفطيرة في فرن مسخّن مسبقاً بدرجة حرارة 350 درجة فهرنهايت لمدة 30 دقيقة.",
                video: "https://www.youtube.com/watch?v=QptPLrcVXcM",
                categortType: 1,
        
              }
              ,
              {
                Image: require("../img/0kabsayemen.jpg"),
                name: "الكبسة اليمني",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "60",
                components: '1 كيلو غرام لحم مع العظا\nم4 كوب أرز بسمتي، منقوع بالماء لمدة ساعة قبل الطهي\n1 معلقة كبيرة خل\n1 معلقة كبيرة بهارات مشكلة\n1 كوب ماء\n1 ملعقة كبيرة ملح\n4 حبات هيل\n4 عود قرفة\n4 كبش قرنفل\n3 حبة بصل كبيرة، مقطعة حلقات\n200 غرام زبادي\n1 ملعقة صغيرة زعفران، منقوع فى قليل من الماء\n1 معلقة كبيرة زنجبيل',
                Step: "فى قدر الضغط على النار، أضيفي جميع المكونات عدا الأرز و الزعفران.\nقلبي المزيج ثم غطى القدر واتركيه على النار حتى ينضج اللحم تماماً.\nفى هذه الأثناء، اسلقى الارز حتى يصبح نصف ناضجاً.\nبعد نضج اللحم، انقلي محتويات قدر الضغط إلى قدر عادى عميق.\nأضيفى الأرز فوق خليط اللحم، ثم سخني القدر على النار.\nأضيفى الزعفران على الوجه، ثم غطي القدر واتركيه على النار، حتى ينضج الأرز تماماً.\nقدمي الكبسة ساخنة",
                video: "https://www.youtube.com/watch?v=k0GCjA_TohI",
                categortType: 3,
        
              }
              ,

            {

                Image: require("../img/downloadhamam.jpg"),
                name: "حمام محشى",
                view: true,
                time: " 70 min",
                Elta7der: '30 min',
                Eltahy: "40 min",
                Elsouba: "80",
                components: 'جوز حمام\nكوب ارز\nكبد الحمام\nبصل\nم ك ملح وفلفل\nم ك كمون\nم ك بهارات\nرشه نعناع ناشف',
                Step: "نقوم بتنضيف الحمام وغسله جيدا مع فصل جلد البطن عن اللحم حتى يسهل الحشو\nفى حله نضع معلقه كبيره سمنه ثم ننزل بكبد الحمام وبصله متقطعه صغير وملح وفلفل وكمون ونقلبهم شويه ثم ننزل بالارز المغسول ثم رشه النعناع ونضيف ماء مغلى نصف مقدار الارز لكى يستوي نصف سوا فقط ثم نتركه يبرد قليلا ثم نحشو به الحمام بين الجلد والبطن وايضا نحشو قليل من الارز فى داخل الحمام ثم نغلق الحمام (بتكتيف الارجل داخل بعض)\nيسلق فى ماء مغلى به بصله وشريحه جزر وملح وفلفل وحبهان وورق لوري واي مطيبات تفضلينها\n يترك لينضج ثم نخرجه ونحمره في سمنه او ندهنه من الخارج بالسمن وندخله الفرن تحت الشوايه ليحمر ثم يقدم بالف هنا ",
                video: "https://www.youtube.com/watch?v=psZA8rf00NI",
                categortType: 4,
        
              },
              {
                Image: require("../img/downloadl7maa.jpg"),
                name: "ورقة لحم بالخضروات",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: '2 بطاطس كبيرة حلقا\nت2 بصل جوليان\n2 فلفل رومي حلقات\nقرن فلفل حامي\n2 جزر حلقات\n3 طماطم حلقات\nم صلصة\n5 فص ثوم حلقات\n3 م زيت\n2 مكعب زبدة\nم ص ملح\n1/2 م ص بهار لحم\n1/2 م ص فلفل اسود\n1/2 كيلو لحم بفتيك مدقوق',
                Step: "تتيل اللحم بملح وفلفل وبهار وتشوح في الزيت والزبدة\nندعك البصل والفلفل الحامي مع ملح وفلفل وبهار باليد\nتجهز الخضروات وتخلط جميعها\nنفرش ورقتين فويل عكس بعض في صينية وفوقها ورقتين زبدة عكس بعض ونضع جزء من اللحم ثم نص الخضار ثم نرص اللحم ثم باقي الخضار\nتغلق الورق جيداً عليها\nتدخل فرن مسخن اعلى حرارة ربع ساعة ثم نهدا النار ١٨٠ ساعة ثم تقلب وتشق على شكل زائد",
                video: "https://www.youtube.com/watch?v=n0LriJQbzok",
                categortType: 5,
        
              },
              {
                Image: require("../img/downloadsopet.jpg"),
                name: "سبيط مقلي",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "50",
                components: 'ك سبيط (حبار) مقط\nع5 فصوص ثوم\n2 قرن فلفل\nمعلقة ملح\nمعلقة شطة\nمعلقة كمون\nمعلقة كزبرة\n½كوبية دقيق\nمعلقة ثوم بودرة وبصل بودرة\nكوبية زيت\n2قرن فلفل حامي\nمعلقة خل وليمون',
                Step: "هنجيب الكبة نحط الثوم والتوابل والملح والثوم والبصل والفلفل\nوالليمون والخل ونضربهم\nبعد كدة نقطع السبيط قطع ونغسلة ونحطة في الخلطة ساعة\nبعد كدة نحطة في الدقيق\nونقلي السبيط والفلفل",
                video: "https://www.youtube.com/watch?v=vBsiEA0Cg24",
                categortType: 6,
        
              },
              {
                Image: require("../img/saidaya.jpg"),
                name: "رز صياديه",
                view: true,
                time: " 40 min",
                Elta7der: '10 min',
                Eltahy: "30 min",
                Elsouba: "30",
                components: '1/2 كيلو ر\nزبصل مفروم\nملح\nكمون\nمكعب مرقه دجاج',
                Step: "نقوم بتحمير البصل للون البنى\nثم نضع الرز عليه ونقلب ثم نضع الملح والكمون ومكعب المرقه ونقلب جيدا\nثم نضع المياه السخنه ونتركه على نار متوسطه ثم نهدى النار ونتركه للتسويه",
                video: "https://www.youtube.com/watch?v=I_mdyPAQW18",
                categortType: 4,
        
              },
              {
                Image: require("../img/20171120020043043.jpg"),
                name: "النجرسكو",
                view: true,
                time: " 80 min",
                Elta7der: '20 min',
                Eltahy: "60 min",
                Elsouba: "60",
                components: 'مكرونة شرايط مسلوقة.\n نصف كيلو صدور دجاج مقطعة ومسلوقة.\n مشروم طازج مقطع شرائح (اختياري).\n 1 ملعقة زيت.\n3 ملاعق كبيرة دقيق.\n 7 ملاعق كبيرة لبن بودرة خالي الدسم.\n 1 لتر مرقة منزوعة الدسم.\n  جبنة موزاريلا مبشورة للوجه.\n جوزة الطيب.\n بودرة ثوم أو بصل.\nملح وفلفل.',
                Step: "تسلق المكرونة في ماء مغلي مملح بدون إضافة زيت، ويراعى سلقها 3/4 سلقة.\n لعمل البشاميل نضع 1 ملعقة دقيق مع ملعقة الزبدة والزيت حتى يصل إلى اللون الذهبي الفاتح، ثم تضاف المرقة بالتدريج مع التقليب المستمر، ويذاب اللبن البودرة والدقيق مع باقي المرقة وتكون باردة.\n ويصب خليط المرقة على الدقيق والزبدة، مع التقليب المستمر، ثم يضاف الملح والفلفل وجوزة الطيب والثوم البودرة، ويترك على النار حتى القوام المظبوط.\n بعد ذلك يضاف المشروم للبشاميل ويقلب، ثم يضاف الدجاج ويقلب في الصوص، ويضاف قليل من الجبنة للصوص.\n بودرة الثوم رائحتها اقوى من بودرة البصل، لذا كميتها بتكون أقل ويمكن إضافة بصلة مبشورة ويتم تحميرها مع الحشوة، ولكن بيكون القوام مرملاً أكثر.\n لإنهاء وصفة النجرسكو اللايت، ندهن وعاء بايركس الفرن بالزيت، وتوضع المكرونة المسلوقة (ومقلبة في ملعقة زيت)، ثم تضاف الحشوة مع الصوص، ثم تضاف القليل من الجبنة الموزاريلا على الوجه. \nونضعها في الفرن على 200 درجة حتى تصل إلى اللون الذهبي.",
                video: "https://www.youtube.com/watch?v=DWBJcbSAf9Q",
                categortType: 2,
        
              },
        ])

    // constructor(props) {
    //     super(props); {
    //         this.state = {
    //             Common:
    //                 [
    //                     {
    //                         Image: require("../img/pizza.png"),
    //                         name: "Pizza",
    //                         view: true,
    //                         time: "30 min"
    //                     },
    //                     {
    //                         Image: require("../img/burger.png"),
    //                         name: "Burger",
    //                         view: true,
    //                         time: "30 min"
    //                     },
    //                     {
    //                         Image: require("../img/food.jpg"),
    //                         name: "Cop",
    //                         view: true,
    //                         time: "30 min"
    //                     },
    //                     {
    //                         Image: require("../img/food2.jpg"),
    //                         name: "ايس كريم",
    //                         view: true,
    //                         time: "30 min"
    //                     },
    //                     {
    //                         Image: require("../img/food3.jpg"),
    //                         name: "ايس كريم",
    //                         view: true,
    //                         time: "30 min"
    //                     },
    //                     {
    //                         Image: require("../img/food4.jpg"),
    //                         name: "ايس كريم",
    //                         view: true,
    //                         time: "30 min"
    //                     },
    //                     {
    //                         Image: require("../img/steak_food.png"),
    //                         name: "ايس كريم",
    //                         view: true,
    //                         time: "30 min"
    //                     },
    //                     {
    //                         Image: require("../img/food.jpg"),
    //                         name: "Cop",
    //                         view: true,
    //                         time: "30 min"
    //                     },

    //                 ],

    //         }
    //     }
    // }

    const ref = React.useRef(null)
    const [animationDisplay, setanimationDisplay] = useState(false)

    const makesearch = (searchText) => {
        let list = Common
        let count = 0
        for (let i = 0; i < list.length; i++) {
            if (((list[i].name).toUpperCase()).includes(searchText.toUpperCase())) {
                list[i].view = true
            }
            else {
                list[i].view = false
                count++
            }

        }
        if (count == list.length) {
            setanimationDisplay(true)
        }

        // 
        if (count != list.length) {
            setanimationDisplay(false)

        }
        setCommon(list)
        count = 0

    }
    // Delete() {
    //     let list = this.state.Common
    //     list.view=!list.view
    //     if (list.view==false) {
    //         this.setState({ Common: list })
    //     }
    // }
    //   function  GoToButton({ screenName }) {
    const navigation = useNavigation();

    //     return (
    //         <Button
    //             title={`Go to ${'Photo_page'}`}
    //             onPress={() => navigation.navigate('Photo_page')}
    //         />
    //     );
    // }

    return (
        <>
            <View style={{ backgroundColor: COLORS.pramary, flex: 1 }}>
                <ScrollView>
                    <View style={styles.Header}>
                        <View>
                            <View style={{}}>
                            </View>

                            {IconSearch ? (
                                <>
                                    <Animatable.View
                                        animation='slideInLeft' >
                                        <TouchableOpacity
                                            onPress={() => {
                                                // this.setState({ IconSearch: false })
                                                // this.fadeOut
                                                setIconSearch(false);
                                            }}>
                                            <Ionicons name='ios-search-circle' size={60} color={COLORS.orange} />
                                        </TouchableOpacity>

                                    </Animatable.View>
                                </>
                            ) : (
                                <Animatable.View style={styles.SearchTextView}
                                    animation='flipInY' >
                                    <TextInput style={styles.SearchTextInput}
                                        placeholder={'البحث عن الأكلات...'}
                                        placeholderTextColor={COLORS.grayFont}
                                        onChangeText={(value) => {
                                            makesearch(value)

                                            setsearch(value)
                                        }}
                                        // onChangeText={value => {
                                        //     setPhone(value);
                                        //     if (onChangephone(value)) {
                                        //       setPhoneError('');
                                        //     }
                                        //   }}

                                        value={search} />
                                    <TouchableOpacity onPress={() => {
                                        setIconSearch(true);
                                        //    this.setState({ IconSearch: true })
                                    }}>

                                        <Ionicons name='search' size={ICONSSIZE.xlIcon} color={COLORS.pramary} />
                                    </TouchableOpacity>

                                </Animatable.View>
                            )}
                        </View>

                        <View style={styles.BoxView}>
                            <View style={styles.Headerstarred}>
                                <Text style={styles.textHeaderstarred}>
                                    الوصفات
                                </Text>
                                <TouchableOpacity
                                onPress={() => {
                                    navigation.navigate("All", {
                                        name: Common
                                    })
                                }
                                }>
                                <Text style={styles.textHeaderstarred2}>
                                    رؤية الكل
                                </Text>
                                </TouchableOpacity>
                            </View>
                            <View style={{ flexDirection: "row",width:width, }}>
                                <ScrollView horizontal={true}>
                                    {animationDisplay ? (
                                        <>
                                            <View style={{ alignItems: "center", justifyContent: "center", alignSelf: "center", width: width, height: height / 1.8 }}>
                                                <LottieView
                                                    ref={this.ref}
                                                    source={require("../lottie/search_empty.json")}
                                                    loop={true}
                                                    autoPlay={true}
                                                    speed={1.5}
                                                // style={{ alignSelf: "center" }}
                                                />
                                            </View>
                                        </>
                                    ) : (
                                        <>
                                            {Common.map((item, index) => (
                                                item.view ? (
                                                    // <View style={styles.BoxView}>

                                                    <View style={styles.Box}>
                                                        <Image source={item.Image} style={styles.ImageTabs2}
                                                             />
                                                        <View style={styles.TextViewBox}>
                                                            <Text style={styles.TextBox}>
                                                                {item.name}
                                                            </Text>
                                                        </View>
                                                        <View style={styles.TextTimeBox}>
                                                            <Text style={styles.TimeBox}>
                                                                {item.time}
                                                            </Text>
                                                            <Ionicons name='md-time' style={{ alignSelf: "center" }} size={ICONSSIZE.smIcon} color={COLORS.ButtonWhite} />
                                                        </View>
                                                        <View style={styles.OptionBox}>
                                                            <TouchableOpacity
                                                                onPress={() => {
                                                                    navigation.navigate("Photo_page", {
                                                                        name: item
                                                                    })
                                                                }
                                                                }
                                                                style={styles.OptionButtonBox}>
                                                                <Text style={styles.OptionTimeBox}>
                                                                    الطريقة
                                                                </Text>
                                                            </TouchableOpacity>
                                                            <TouchableOpacity 
                                                            onPress={() => {
                                                                navigation.navigate("WbeView", {
                                                                    name: item
                                                                })
                                                            }
                                                            }style={styles.OptionButtonBox}>
                                                                <Text style={styles.OptionTimeBox}>
                                                                    الفيديو
                                                                </Text>
                                                            </TouchableOpacity>

                                                        </View>


                                                    </View>
                                                    // </View>
                                                ) : (null)

                                            ))}
                                        </>
                                    )}

                                </ScrollView>
                            </View>

                        </View>
                        <View style={styles.starred}>
                            <View style={styles.Headerstarred}>
                                <Text style={styles.textHeaderstarred}>
                                    المميزة
                                </Text>
                                {/* <Text style={styles.textHeaderstarred2}>
                                    رؤية الكل
                                </Text> */}
                            </View>
                            {star.map((item, index) => (
                                <View style={styles.Boxstarred}>
                                    <View style={styles.ViewImage}>
                                        <Image source={item.Image}  style={styles.Imagestarred} />
                                    </View>
                                    <View style={styles.BoxTextStarred}>
                                        <Text style={[styles.textHeaderstarred, { fontSize: FONTS.h2 }]}>
                                            {item.name}
                                        </Text>
                                        <View style={[styles.TextTimeBox, { justifyContent: "center" }]}>
                                            <Text style={styles.TimeBox}>
                                                {item.time}
                                            </Text>
                                            <Ionicons name='md-time' style={{ alignSelf: "center" }} size={ICONSSIZE.smIcon} color={COLORS.ButtonWhite} />
                                        </View>
                                        <View style={styles.OptionBox}>
                                            <TouchableOpacity
                                                onPress={() => {
                                                    navigation.navigate("Photo_page", {
                                                        name: item
                                                    })
                                                }
                                                }
                                                style={styles.OptionButtonBox}>
                                                <Text style={styles.OptionTimeBox}>
                                                    الطريقة
                                                </Text>
                                            </TouchableOpacity>
                                            <TouchableOpacity onPress={() => {
                                                navigation.navigate("WbeView", {
                                                    name: item
                                                })
                                            }
                                            } style={styles.OptionButtonBox}>
                                                <Text style={styles.OptionTimeBox}>
                                                    الفيديو
                                                </Text>
                                            </TouchableOpacity>

                                        </View>

                                    </View>
                                </View>
                            ))}

                        </View>
                    </View>
                    <View style={{ height: 55 }}></View>

                </ScrollView>
            </View>
        </>
    );
}

const styles = StyleSheet.create({
    Header: {
        backgroundColor: COLORS.pramary,
        // marginTop: MARGIN.xxsMargin,
        alignItems: "center",
        flex: 1,
    },
    nameStackView: {
        // backgroundColor: COLORS.white,
        width: width / 1.05,
        height: height / 12,
        alignItems: "flex-start",
        justifyContent: "flex-end",
        marginVertical: MARGIN.xsMargin
    },
    textnameStackView: {
        fontSize: FONTS.h3,
        color: COLORS.orange,
        // fontWeight: "bold",
        fontFamily: "Vazirmatn-VariableFont_wght"
    },
    SearchView: {
        // backgroundColor: COLORS.orange50,
        width: width / 1.05,
        height: height / 9,
        alignItems: "center",
        justifyContent: "space-between",
        marginVertical: MARGIN.xsMargin
    },
    SearchTextheader: {
        fontSize: FONTS.h3,
        color: COLORS.orange,
        alignSelf: "flex-start"
    },
    SearchTextView: {
        backgroundColor: COLORS.white,
        width: width / 1.1,
        // height: height / 15,
        alignItems: "center",
        justifyContent: "center",
        borderRadius: RADIUS.smRadius,
        marginVertical: MARGIN.xxsMargin,

        // borderWidth: 1,
        // borderColor: COLORS.orange,
        // paddingHorizontal: PADDING.xsPadding,
        // fontSize: FONTS.h,
        flexDirection: "row"

    },
    SearchTextInput: {
        // backgroundColor: COLORS.white,
        width: width / 1.4,
        // height: height / 17,
        alignItems: "center",
        alignSelf: "center",
        // backgroundColor:COLORS.black,
        color: COLORS.black, 
        justifyContent: "flex-end",
        fontFamily: "Generator Black",
        // borderRadius: RADIUS.lgRadius,
        // borderWidth: 2,
        // borderColor: COLORS.orange,
        paddingHorizontal: PADDING.smPadding,
        fontSize: FONTS.h4
        // marginVertical: MARGIN.xsMargin

    },
    BoxView: {
        width: width,
        // height:height/12,

        backgroundColor: COLORS.pramary,
        flexDirection: "row",
        flexWrap: "wrap",
        padding: PADDING.xsPadding,
        alignItems: "center",
        justifyContent: "space-around" ,    
    },
    Box: {
        width: width / 2.1,
        alignItems: "center",
        // height: height / 15,
        margin: MARGIN.xsMargin,
        padding: PADDING.lgPadding,
        borderRadius: RADIUS.xxsRadius,
        backgroundColor: COLORS.pramary50 

    },
    starred: {
        width: width,
        // backgroundColor: COLORS.black
    },
    Headerstarred: {
        width: width / 1.05,
        flexDirection: "row",
        justifyContent: "space-between",
        alignItems: "center",
        alignSelf: "center",
    },
    textHeaderstarred: {
        fontSize: FONTS.h1,
        color: COLORS.ButtonWhite,
        // fontWeight: "bold",
        fontFamily: "Generator Black"
    },
    textHeaderstarred2: {
        fontSize: FONTS.h5,
        color: COLORS.gray,
        // fontWeight: "bold",
        fontFamily: "Generator Black"
    },
    Boxstarred: {
        width: width / 1.05,
        // height: height / 5,
        alignSelf: "center",
        borderRadius: RADIUS.smRadius,
        backgroundColor: COLORS.pramary50,
        flexDirection: "row",
        marginVertical: MARGIN.xsMargin
    },
    ViewImage: {
        width: width / 2.5,
        height: height / 5,
        alignItems: "center",
        justifyContent: "center",
        // backgroundColor: "#000",
        borderRadius: RADIUS.xxsRadius
    },
    Imagestarred: {
        width: width / 3,
        height: height / 6,
        borderRadius: RADIUS.xxsRadius

    },
    BoxTextStarred: {
        width: width / 1.9,
        height: height / 6,
        alignSelf: "center",
        alignItems: "center",
        justifyContent: "space-between",
        borderRadius: RADIUS.smRadius,
        // backgroundColor: COLORS.black,
        // paddingVertical:54

    },
    textDetelsstarred: {
        fontSize: FONTS.h5,
        color: COLORS.grayICon,
        // fontWeight: "bold",
        fontFamily: "Generator Black"
    },
    Dessercommon: {
        height: height / 2.2,
        width: width / 1.05,
        // backgroundColor: COLORS.red
    },
    DessercommonHeader: {
        flexDirection: "row",
        justifyContent: "space-between",
        // backgroundColor:"#000"
    },
    TextCommon: {
        fontSize: FONTS.h3,
        color: COLORS.orange,
        alignSelf: "flex-start"
    },
    Image: {
        width: 35,
        height: 35
    },
    Dessercommon2: {
        width: width / 2,
        // backgroundColor:COLORS.background,
        alignItems: "flex-end"
    },
    DessertCommon: {
        height: height / 2.4,
        width: width,
        // backgroundColor: COLORS.red,
        justifyContent: "center"
    },
    ButtonTabs: {
        width: width / 2,
        height: height / 2.5,
        backgroundColor: COLORS.orange50,
        borderColor: COLORS.ButtonWhite,
        borderEndWidth: 5,
        borderRadius: RADIUS.xlRadius,
        // justifyContent: "space-evenly",
        alignItems: "center",
        marginHorizontal: MARGIN.xsMargin,
    },
    ImageTabs: {
        width: width / 2.1,
        height: height / 5,
        borderTopRightRadius: RADIUS.xlRadius,
        borderTopLeftRadius: RADIUS.xlRadius,
    },
    TextTabs: {
        fontSize: FONTS.h4,
        color: COLORS.white,
    },
    TabsofTabs: {
        width: width / 2,
        height: height / 6,
        // backgroundColor: COLORS.gray,
        // flexDirection: "row",
        justifyContent: "space-evenly",
        alignItems: "center",
        borderRadius: RADIUS.x5lRadius,
        // marginTop:5,backgroundColor:"#000",

    },
    the_Two_button: {
        backgroundColor: COLORS.orange,
        borderRadius: RADIUS.xsRadius,
        flexDirection: "row",
        // width: width/5,
        padding: PADDING.xsPadding,
        // height: height/16,
        alignItems: 'center',
        justifyContent: "center",
    },
    ViewBoth: {
        flexDirection: "row",
        justifyContent: "space-around",
        alignItems: "center",
        width: width / 2,
    },
    Dessert: {
        width: width / 1.05,
        // height: height,
        // backgroundColor: COLORS.gray,
        alignItems: "center",
    },
    DessercommonHeader1: {
        flexDirection: "row",
        justifyContent: "space-between",
        width: width / 1.05

    },
    DessertMain: {
        margin: MARGIN.xsMargin,
        width: width / 2.4,
        height: height / 2.5,
        backgroundColor: COLORS.grayFont,
        justifyContent: "flex-start",
        alignItems: "center",
        borderRadius: RADIUS.lgRadius,
    },
    ImageTabs2: {
        width: width / 2.4,
        height: height / 5,
        borderRadius: RADIUS.xxsRadius,
    },
    TextViewBox: {
        // backgroundColor: "#000",
        width: width / 2.4,
        alignItems: "flex-start"
    },
    TextBox: {
        fontSize: FONTS.h4,
        color: COLORS.white,
        fontFamily: "Generator Black",
        textAlign: "left"
    },
    TextTimeBox: {
        width: width / 2.4,
        alignItems: "center",
        flexDirection: "row",
        // alignItems:"center",
    },
    TimeBox: {
        fontSize: FONTS.h4,
        color: COLORS.white,
        fontFamily: "Generator Black",
        alignSelf: "center",
        marginHorizontal: 2
    },
    OptionBox: {
        width: width / 2.4,
        alignItems: "center",
        justifyContent: "space-around",
        flexDirection: "row",

    },
    OptionButtonBox: {
        width: width / 6,
        backgroundColor: COLORS.orange,
        borderRadius: RADIUS.smRadius,
        alignItems: "center",
        justifyContent: "center",
    },
    OptionTimeBox: {
        fontSize: FONTS.h5,
        color: COLORS.white,
        fontFamily: "Generator Black",
        alignSelf: "center",
        marginHorizontal: 2
    },
    TextTabs2: {
        fontSize: FONTS.h6,
        color: COLORS.white,
    },
    TabsofTabs2: {
        width: width / 2.6,
        height: height / 7.5,
        backgroundColor: COLORS.gray,
        // flexDirection: "row",
        justifyContent: "center",
        alignItems: "center",
        borderRadius: RADIUS.xlRadius,
    },
    the_Two_button2: {
        backgroundColor: COLORS.orange,
        borderRadius: RADIUS.xlRadius,
        flexDirection: "row",
        width: width / 6,
        height: height / 18,
        alignItems: 'center',
        justifyContent: "center",
    },
    ViewBoth2: {
        flexDirection: "row",
        justifyContent: "space-around",
        alignItems: "center",
        width: width / 2.6,
    },

});
