import React from 'react';
import {
    StyleSheet,
    View,
    Text,
    Dimensions,
    Image,
    BackHandler,
    ScrollView,
    TouchableOpacity
} from 'react-native';
import { TextInput } from 'react-native-paper';
import { Colors } from 'react-native/Libraries/NewAppScreen';
import { COLORS, PADDING, MARGIN, RADIUS, FONTS, ICONSSIZE } from '../constants/Constants'
import Ionicons from 'react-native-vector-icons/Ionicons'
import Octicons from 'react-native-vector-icons/Octicons'
import LottieView from 'lottie-react-native';

const { width, height } = Dimensions.get('window');


export default class Search extends React.Component {
    constructor(props) {
        super(props); {
            this.state = {
                All_meal: [

                    {
                        categortType: 3,
                        Image: require("../img/cccth.jpeg"),
                        name: "بسبوسة محشيه",
                        Elta7der: '5 min',
                        Eltahy: "20 min",
                        Elsouba: "40",
                        components: "بيضتين\n1/2 كاس سكر\n1/2 كاس زيت\nعلبة قشطة\nفانيللا\nملعقه كبيره بيكنج باودر\nكاس ونصف سميد\nمكونات المهلبيه ع النار:\nكاسين ماء\n6 ملاعق حليب بودره\n4 ملاعق نشا\n4 حبات جبن كيري\nملعقتين سكر\nظرف دريم ويب + علبة قشطة قيمر",
                        view: true,
                        Step: "نخلط مقادير البسبوسة ونصب ثلث الكمية بصينية الفرن وتدخل حتى الاستواء.\nنخلط جميع مقادير المهلبيه عدا الدريم ويب والقشطة الى ان تثقل ثم نطفئ النار ونضع القشطة والدريم ويب ونخلط حتى يمتزج ثم تصب فوق البسبوسه.\nنضيف حليب سائل الى ماتبقى من خليط البسبوسه حتى يكون شبه سائل ويوزع فوق المهلبيه ويدخل الفرن من الأعلى حتى يشقر وتخرج وتصب شيره او حليب محلى ثم تبرد جيدا وتقدم.",
                        time: "25 min",
                        video: "https://www.youtube.com/watch?v=xUMtd9exdBM"

                    },
                    
                    {
                        categortType: 1,
                        Image: require("../img/54th.jpeg"),
                        name: "ام علي",
                        Elta7der: '10 min',
                        Eltahy: "40 min",
                        Elsouba: "60",
                        components: "8 شرائح بف باستري اي نوع موجود\nخليــط الحليــب\n4 اكواب حليب سايل اي نوع ندى اوالمراعي\n1 علبة قشطة\n1/3 كوب حليب مكثف محلى\nخلــط المكســرات\n1 ملعقة كبيره زبدة\n2 او اكثر لوز مجروش - بندق مجروش\n3 ملاعق جوز هند\nللوجــه (فستق مجروش)\nللتغطيــة\n1 قشطة (لونا او المراعي او اي نوع)\n1 دريب ويب\n2 ملعقه كبيره حليب سائل (ملاحظة) الحيب للتغطيه يسهل عملية دمج القشطة والدريم ويب اذا تبينها ثقيله حطي ملعقتين حليب واذا خفيفه نوعا ما زودي شوي من كمية الحليب )",
                        view: true,
                        Step: "ندخل البف باستري بالفرن على درجة حراره ١٨٠ من تحت حتى تأخذ اللون الذهبي ثم من الاعلى ثم نطلعها ونتركهاا تبرد وبعد ماتبرد نقصصها ااتقطيع صغير (ملاحظة البف يتحمر بسرعه اذا كان الفرن مسبق التشغيل) ثم يتم توزيع البف باستري بصينيه او صواني فخار كميةمتوسطة حتى نضع خليط المكسرات ونضع الباقي من البف باستري\nنأخذ (خليط المكسرات) بقلايه ونذوب الزبدة ونحمر المكسرات عليهاا بعد ماتتحمّر المكسرات مع الزبدة نضيف الجوز الهند بعدهاا اوزع خليط المسكرات على البف اللي وزعته بالصواني ثم نرجع نضع باقي البف باستري\nنخلط الحليب - مع القشطة - وحليب النستله المحلى مع بعض ثم نضعه على النار حتى تغلي ونصبة في على البف باستري الموزع بالتساوي ونسيقه فيه\nنخلط القشطة والدريم ويب والحليب مع بعض الى ان تتجانس ونوزعه على الوجه\nثم نضع الصينية داخل الفرن من الأعلى فقــط للتحمير وتأخذ التغطيه اللون الذهبي ",
                        time: "50 min",
                        video: "https://www.youtube.com/watch?v=PHPZllvsypo"
                    },
                    {
                        Image: require("../img/dgagAndKary.jpg"),
                        name: "دجاج بالكاري",
                        view: true,
                        time: "35 min",
                        Elta7der: '10 min',
                        Eltahy: "25 min",
                        Elsouba: "15",
                        components: " كيلو من قطع الدجاج\nملح وفلفل أسود\n٢ بصلة\n٤ فصوص ثوم\nقطعة جنزبيل صغيرة\nنصف كوب صلصة طماطم\n٢ ل ٣ ملعقة صغيرة من بودرة الكاري\nكوب من الكريمة\nملعقة صغيرة سكر و ملعقة كبيرة خل",
                        Step: "نحمص المكونات على نهار هاديه \nماعدا الدجاج\nنحط المكونات بالخلاط مع الكريمه ونخفقهم لحد ما تنطحن جميع المكونات جيدا\nبنفس المقلاة نقطع الدجاج ونشوحه و نحط فوقه الصوص و نخليه يتسبك معاه لحد ما تنجانس النكهات ويستوي الدجاج\nنرش فوقه كزبره او بقدونس وناكله مع رز او خبز ",
                        categortType: 4,
                        video: "https://www.youtube.com/watch?v=88rOVd-Aipk&t=13s"

                    },
                    {
                        Image: require("../img/5f086849804b5.jpg"),
                        name: "موكا فرابتشينو المثلج",
                        Elta7der: '5 min',
                        Eltahy: "15 min",
                        Elsouba: "25",
                        components: "كوب (200 جم) ثلج\n. ¾ كوب (185 مل) ماء\n. ½ 1 كوب (375 مل) حليب\n. 9 ملاعق كبيرة (112.5 جم) رقائق شوكولاتة (شيبس)\n. 9 ملاعق كبيرة (135 مل) صوص شوكولاتة\n. 3 ملاعق صغيرة (15 جم) قهوة سريعة الذوبان\n. 2 ملعقة صغيرة (10 جم) فانيليا سائلة\n. كريمة مخفوقة للتزيين.",
                        view: true,
                        Step: "أذيبي القهوة في الماء\nثم ضعيها في الخلاط الكهربائي\n. أضيفي الثلج وست ملاعق من صوص الشوكولاتة\nوالحليب\nورقائق الشوكولاتة\nوالفانيليا\nواخفقي لمدة دقيقة\n. زيني أكواب التقديم من الداخل بباقي صوص الشوكولاتة\nثم صبي الفرابتشينو\nوزينيه من الأعلى بالكريمة المخفوقة وصوص الشوكولاتة",
                        time: "20 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=1wW6PS1S9gE"
                    },
                 
                    {
                        Image: require("../img/shesh.jpg"),
                        name: "شيش طاوق",
                        view: true,
                        time: "45 min",
                        Elta7der: '10 min',
                        Eltahy: "35 min",
                        Elsouba: "15",
                        components: "5 ملاعق كبيره زبادي\n1 معلقه كبيره صلصه\n1 ملعقه صغيره بهارات مشكله\n1 معلقه كبيره ثوم مهروس\n1 ملعقه صغيره فلفل اسود\n1 ملعقه صغيره ملح\nحبتين ليمون\nبصل مقطع مربعات\nصدور دجاج حسب الرغبه مقطعه مربعات",
                        Step: "نحط كل المقادير مع الدجاج وخليها ١٢ ساعه في الثلاجة وبعدين نجيب الصيخ ونحط قطعه دجاج وبعدين نحط بصل ونسوي نفس الطريقه الين تخلص كل الكميه وبعدين ندخلها الفرن من فوق وتحت على حرارة ١٧٠ الين تحمر وتستوي تاخذ نص ساعه",
                        video: "https://www.youtube.com/watch?v=fXYtJjiPAOU",
                        categortType: 1,


                    }
                    ,
                   
                    {
                        Image: require("../img/download.jpg"),
                        name: "الملوخية ",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: '1 باقة ملوخية طازجة أو مجمدة\n1 كيلو لحم بقري مقطع إلى مكعبات صغيرة\n2 بصلة متوسطة الحجم مفرومة\n4 فصوص ثوم مفرومة\n1/2 كوب كزبرة مفرومة\n1/2 كوب بقدونس مفروم\n1 ملعقة صغيرة بهارات مشكلة\n1 ملعقة صغيرة كركم\n1 ملعقة صغيرة فلفل أسود\n1 ليمونة مقطعة إلى شرائح\nملح حسب الذوق\n2 لتر ماء\nزيت نباتي للطهي',
                        Step: "يغسل اللحم ويترك جانبا.\nتقشر البصلة وتفرم جيدا ويضاف إليها الثوم وتخلط معا.\nتسخن الزيت في قدر كبير ويضاف البصل والثوم ويقلب حتى يصبح لونهما ذهبيا.\nيضاف اللحم وتقلب جيدا حتى يصبح لونه بنيا.\nيضاف الملوخية ويقلب جيدا لمدة 5 دقائق.\nيضاف الماء والتوابل ويترك المزيج يغلي.\nيقلب المزيج جيدا ويترك ليطهى لمدة ساعة تقريبا أو حتى يصبح اللحم طريا والملوخية مطهوة.\nيضاف الكزبرة والبقدونس ويترك المزيج لمدة 5 دقائق ثم يزال من النار.\nيقدم المزيج الساخن مع الأرز وشرائح الليمون.",
                        video: "https://www.youtube.com/watch?v=bFMVOZFjCmM",
                        categortType: 4,


                    },

                    {
                        Image: require("../img/127-010613-egyptian-basrah-recipe-2.jpg"),
                        name: "بصاره",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: 'ربع كيلو من الفول المقشر بصلة كبيرة.\n5 فص ثوم مفروم.\nملعقة كبيرة من النعناع المجفف.\n2 ملعقة كبيرة من الشبت.\nملعقة كبيرة من الكزبرة الخضراء.\n2 ملعقة كبيرة من البقدونس.\nملعقة صغيرة من الكمون.\nنصف ملعقة صغيرة من الفلفل الأسود.\nالقليل من الملح.',
                        Step: "بعد نقع الفول يتم تصفيته ويوضع في قدر به ماء\nويرفع على النار حتى الغليان.\nيضاف إليه البصل والثوم ويترك على النار لمدة ساعة تقريبا حتى تمام النضج.\nنضع إلى الفول الكزبرة والشبت والبقدونس\nونتبله بالملح والفلفل الأسود والكمون\nوتترك المكونات على النار لمدة 10 دقائق إضافية.\nيرفع القدر من على النار ويترك حتى يبرد قليلا\nويتم خلطه في الخلاط الكهربائي حتى نحصل على قوام ناعم.\nنضع الخليط في القدر مرة أخرى ويرفع على النار الهادئة حتى الغليان.\nفي مقلاة على النار نضع الزيت ويترك حتى يسخن\nونضيف إليه البصل مع التقليب حتى يذبل.\nنضع الثوم ويتم التقليب حتى يحمر لونه.\nتغرف البصارة في طبق التقديم ويرش عليها البصل والثوم المحمر\nويعصر القليل من الليمون\nوتقدم بالهناء والشفاء.",
                        video: "https://www.youtube.com/watch?v=Jo8FeBhebQ4",
                        categortType: 4,


                    },

                    {
                        Image: require("../img/mapkpaka.jpg"),
                        name: "مكرونة مبكبكة ",
                        view: true,
                        time: " 60 min",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "30",
                        components: "ك لحمة مقطعة\nك طماطم معصورة\n1/2 مكرونة\nمعلقة سمنة\nبصلة مقطعة\n2 قرن شطة حامي\nمعلقة فلفل\n2 معلقة ملح\nمعلقة كمون شطة",
                        Step: "هنجيب حلة ونحط فية السمنة ونحط اللحمة ونقلبة\nلحد متشوح هنحط مياة سخنة ونحط بصلة وطماطمة\nولوري وحبهان والشطة ونسيبة تستوي\nهنجيب حلة ونحط معلقة سمنة ونحط البصل ونقلب ونحط الطماطم\nوالتوابل والملح ونسيبة تغلى نحط المكرونة واللحمة ونسيبة لاحد السوية\nبعد كدة نقدمة والف هنا ",
                        video: "https://www.youtube.com/watch?v=OMx_uiTsgII",
                        categortType: 2,


                    },
                    {
                        Image: require("../img/macrona_bl_skoq.jpg"),
                        name: "مكرونة فرن بالسجدق",
                        view: true,
                        time: " 50 min",
                        Elta7der: '10 min',
                        Eltahy: "40 min",
                        Elsouba: "30",
                        components: '½ مكرونة\n½ سجدق\n½ طماطم معصورة\nبصلة مقطعة\n2 قرن فلفل مقطع\n2 فص توم مقطع\nمعلقة ملح فلفل شطة\nرشة بهارات\nمعلقة سمنة\nقرن فلفل حامي مقطع',
                        Step: "هنجيب طاسة ونحط السمنة\nونحط السجدق ونقلبة لاحد ميتغر لونة هنحط البصل ونقلب\nنحط التوم ونقلب\nنحط الفلفل ونقلبة ونحط الطماطم والتوابل والملح والبهارات\nونسيبة لاحد متسبك\nهنجيب الطاجن ويكون كبير هنحط المكرونة ونحط الصلصة بالسجدق مع كوبية مياة سخنة\nونغطي الطاجن ونسيبة لاحد السوية\nبعد كدة نشيل الغط وتحت الشوية والف هنا",
                        video: "https://www.youtube.com/watch?v=52f1YWvX4vU",
                        categortType: 2,


                    },
                    {
                        Image: require("../img/5f086a082e0f1.jpg"),
                        name: "كراميل فرابتشينو المثلج",
                        Elta7der: '5 min',
                        Eltahy: "15 min",
                        Elsouba: "25",
                        components: "كوب (200 جم) ثلج\n. ¾ كوب (180 مل) ماء\n. ¾ كوب (180 مل) حليب مكثف ومحلى\n. ½ 1 كوب (375 مل) حليب\n. 9 ملاعق كبيرة (135 مل) صوص كراميل\n. 2 ملعقة صغيرة (10 جم) قهوة سريعة الذوبان",
                        view: true,
                        Step: "أذيبي القهوة في الماء\nثم ضعيها في الخلاط الكهربائي\n. أضيفي الثلج والحليب المكثف وست ملاعق من الكراميل والحليب\nواخفقي لمدة دقيقة\n. زيني أكواب التقديم من الداخل بباقي صوص الكراميل\nثم صبي الفرابتشينو\nوقدميه",
                        time: "20 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=qi7QxVSwtuw"
                    },
                    {
                        Image: require("../img/download1.jpg"),
                        name: "طاجن مكرونة بشاميل ",
                        view: true,
                        time: " 50 min",
                        Elta7der: '10 min',
                        Eltahy: "40 min",
                        Elsouba: "30",
                        components: '½ كيلو مكرونة بنة او اقلام\nماء للغلى\nملح\nالحشو :\n¼ كيلو لحمة مفرومة\nملح\nفلفل اسمر\nبصلة مفرومة او مقطعة صغير\nالبشاميل :\n4 معالق دقيق\nلتر لبن\nمعلقتين سمن\nمكعب مرق\nملح\nفلفل\nجبن رومى او موتزريلا',
                        Step: "فى حلة يغلى الماء ثم يضاف المكرونة والملح وتترك لتستوى ثم تصفى ولا تغسل\nفى طاسة يوضع البصل والسمن حتى تصبح البصل ذهبى اللون يضاف اللحمة ويقلب ثم يضاف الملح والفلفل\nفى حلة يضاف السمن والدقيق ويقلب ثم يضاف اللبن والملح والفلفل والمكعب المرق ويقلب حتى يتقل القوام\nتحضر البرامات الصغيرة او الطواجن الصغيرة تدهن بمادة دهنية\nيضاف قليل من البشاميل الى المكرونة ويقلب ثم توضع طبقة من المكرونة فى البرام ثم يضاف اللحمة ثم توضع الطبقة الثاتية\nيغطى الوجه بالبشاميل و الجبن وتدخل فرن ساخن لمدة 20 دقيقة ",
                        video: "https://www.youtube.com/watch?v=jzr_0t74aJA",
                        categortType: 2,


                    },
                    {
                        Image: require("../img/Untitled-108.jpg"),
                        name: "مكرونة وايت صوص",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: '400 جرام مكرونة قلم\nكوب حليب 2\n3 ملعقة كبيرة\nملعقة كبيرة زبدة\nملح\nفلفل أسود\nكوب جبن شيدر أو ميكس جبن',
                        Step: "تسلق المكرونة في ماء مغلي مملح حتى تصل إلى درجة النضج المرغوب.\nنضيف الدقيق والزبدة إلى الحليب ونخلطهم جيدا بالمضرب اليدوي معه ثم نرفعهم على النار مع استمرار التقليب حتى يتقل القوام.\nنضيف الملح والفلفل الأسود ونقلب ثم الأجبان ونقلب حتى تذوب\nثم نضيف المكرونة المسلوقة إلى الصوص ونقلب ونتركها حتى يغلي بها ثم ترفع من النار وتقدم وبالهنا. ",
                        video: "https://www.youtube.com/watch?v=rjH9sgsMADE",
                        categortType: 2,


                    },

                    {
                        Image: require("../img/makronawithgampry.jpg"),
                        name: "مكرونة بالجمبري",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: "½ كيلو جمبري متقشر ومتنض\nف لمونة\n½ معلقة صغيرة كمون\n½ معلقة صغيرة فلفل اسود\n½ معلقة صغيرة كسبرة\nمعلقة كبيرة زبدة\nمعلقة صغيرة مليانة توم مفروم\nمعلقة كبيرة دقيق",
                        Step: "بنتبل الجمبري باللمون والكمون والفلفل الاسود والكسبرة\nفي حلة بنشوح التوم وننزل بالجمبري ونقلب لحد مايستوي بعدين نطلعه ونحط مكان الجمبري الزبدة والدقيق ونقلب وبعدين نحط مكعب المرق ونقلب بعدين نحط اللبن والكريمة اللباني ونرجع الجمبري تاني ونقلب ولما يبتدي يتقل نحط المكرونة ونقلب تقلبتين وخلاص ولو حسيتوا ان الصوص تقيل بتزودوا لبن لو مظبوط خلاص  ",
                        video: "https://www.youtube.com/watch?v=bgpUK0nkFkY",
                        categortType: 2,


                    },
                    {
                        Image: require("../img/makronabldggag.jpg"),
                        name: "مكرونة كريمية بالدجاج ",
                        view: true,
                        time: " 60 min",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "50",
                        components: 'تتبيلة الدجاج:\n2 صدور دجاج 4 ملاعق كبيرة زيت نباتي\n1 ملعقة كبيرة توابل كيچن\n1 ملعقة صغيرة بودرة بصل\n1 ملعقة صغيرة بودرة ثوم\n1 ملعقة صغيرة بقدونس مجفّف\n1 ملعقة صغيرة بهارات دجاج\n1/2 ملعقة صغيرة بابريكا المكرونة:\n500 جرام مكرونة أقلام\n1 كوب كريمة طبخ\n1 كوب مرقة دجاج\n1/2 كوب "115 جرام" جبنة كريمية\n1 حبّة بصل مفروم\n1 حبّة طماطم مقطّعة مكعبات\n1 حبّة فلفل رومي مقطّع مكعبات\n1 ملعقة كبيرة زبدة\n1 ملعقة صغيرة بودرة مرقة دجاج\n1 ملعقة صغيرة توابل كيچن\n1/2 ملعقة صغيرة ثوم مهروسة\nملح - فلفل أسود',
                        Step: "نسلق المكرونة بالطريقة المعتادة ثم نصفّيها ونتركها جانبا ونبدأ أولا بتجهيز الدجاج\nإذا كانت الصدور سميكة نضعهم بين طبقتين من الورق الشفاف ونَدُقّهم وهذا حتى ينضجوا تماما من الداخل ثم ندهنهم بملعقة كبيرة من الزيت\nهذه بهارات الكيچن التي استخدمتها بالوصفة وهي تُضفي نكهة مميزة ولذيذة جدا للطبق\nنخلط كل مكونات التتبيلة معا بطبق صغير ونغلّف بهم صدور الدجاج\nوبمقلاة عميقة وغير لاصقة نسخّن حوالي 3 ملاعق كبيرة من الزيت ونشوِّح به الدجاج لمدة 10 دقائق تقريبا مع التقليب المستمر على كل الجوانب حتى ينضجوا تماما ثم نُخرجهم جانبا ونتركهم لتهدأ حرارتهم قليلا\nبنفس المقلاة نُذيب الزبدة ونشوِّح بها البصل والثوم حتى يلين قوام البصل ثم نُضيف مكعبات الفلفل والطماطم وعندما يلين قوام الخضروات نضع الكريما ومرقة الدجاج ثم الجبنة الكريمية ونقلّب جيدا حتى تتجانس المكونات ثم نُضيف بودرة مرقة الدجاج وبهارات الكيچن ونتبّل بالملح والفلفل الأسود\nوعندما يبدأ الخليط بالغليان نُضيف المكرونة المسلوقة مع التقليب الجيد حتى تختلط بها كل المكونات ثم نقطّع صدور الدجاج إلى شرائح ونقلّبهم مع المكرونة ونترك بعض الشرائح جانبا لوضعهم على الوجه عند التقديم النهائي\nنرفع المكرونة عن النار وتوضع بأطباق التقديم ونرُش الوجه بالقليل من الجبنة المبشورة أو نزيّن حسب الرغبة\nوأخيرا تُقدَّم مكرونة الدجاج والكيچن ساخنة",
                        video: "https://www.youtube.com/watch?v=rFOASDE9kgs",
                        categortType: 1,


                    },
                    {
                        Image: require("../img/733.jpg"),
                        name: "صينية بطاطس باللحمة",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "40",
                        components: '1 كيلو لحمة مسلوقة\n1 كيلو بطاطس\n3 كوب عصير طماطم\n1 كوب ماء بصلة حلقات\n1 ملعقة صغيرة ثوم مفروم\n1 ملعقة كبيرة سمنة\nفلفل حار  حسب الرغبة\nملح\nفلفل أسود ',
                        Step: "شوحي البصل في زيت مخصص للطهى على النار مع إضافة ذرة ملح له حتى تذبل ثم تضاف قطع اللحمة وتحمر قليلا ثم يضاف عصير الطماطم والثوم ويقلب الخليط بشكل جيد\nضعي شرائح البطاطس في صينية مع الفلفل الحار حسب الرغبة و يضاف خليط الطماطم والطماطم إلى البطاطس و يضاف الماء والملح والفلفل الأسود\nتوضع الصينية على النار لتغلي ثم توضع في الفرن وانتظري حتى تمام النضج ",
                        video: "https://www.youtube.com/watch?v=QaGmEgUaODc",
                        categortType: 5,


                    },
                    {
                        Image: require("../img/491.jpg"),
                        name: "كفتة الجمبري",
                        view: true,
                        time: " 35 min",
                        Elta7der: '10 min',
                        Eltahy: "25 min",
                        Elsouba: "50",
                        components: 'جمبري مفروم\nسمك فيليه\nبيض\nزنجبيل طازج\nشبت\nفلفل ألوان\nأعشاب\nكاري\nجزر\nكزبرة خضراء\nخلة خشب\nبقسماط\nثوم\nملح\nفلفل\nزيت ذرة ',
                        Step: "افرمي الزنجبيل والثوم والجزر والفلفل الألوان والكاري والأعشاب وملح وفلفل وسمك فيليه وجمبري بشكل جيد\nضعي القليل من البقسماط مع الاستمرار في الفرم\nثم شكلي العحينة اصابع في خلة خشب باستخدام الزيت وضعيها على الشواية حتى تنضج ثم قدميها ",
                        video: "https://www.youtube.com/watch?v=_oMKekApjXg",
                        categortType: 6,


                    },
                    {
                        Image: require("../img/0shrimpsgrilledtomato.jpg"),
                        name: "مكرونة بالجمبري",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "40",
                        components: '300 جرام معكرونه 300 جرام جمبري\n½ معلقه صغيره فلفل اسود\nمعلقه صغيره كاري\nبصلة متوسطة متقطعة\nكوب فلفل رومي متقطع\n5 وحدات طماطم متقطعين\nفصين ثوم\nملح حسب التذوق\nكوب ونص ميه',
                        Step: "حلة كبيرة هنضيف المكونات جمب بعضها ونضيف الماء الساخنة ونغطيها ونشغل النار متوسطة\nاول ماتبدأ تغلى هنقلب كل المكونات مع بعضهم حلو اوي وهنهدي النار ونخليها متغطيها و تكمل تسويه\nبعد حوالي ١٥ دقيقه هنفتح عليها ونقلبها كويس اوي وتتقدم ساخنة ",
                        video: "https://youtube.com/watch?v=Uk58nYk9gnk",
                        categortType: 6,


                    },

                    {
                        Image: require("../img/downloadgggg.jpg"),
                        name: "طاجن سمك فيليه بالخضار",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: '½ كيلو سمك فيليه\n2 فلفل\n2 بصل\n2 طماطم\nثوم مفروم\nتوابل',
                        Step: "تقطيع الخضار قطع صغيرة\nتتبيل الخضار ملح وفلفل وكمون و2معلقة بهار سمك ومعلقة ثوم مفروم\nنحضر صينية بايركس مقاس وسط ونضع نص كمية الخطار ونرص السمك ثم نضع باقي كمية الخضار                ",
                        video: "https://www.youtube.com/watch?v=cqtKgbxeq1c",
                        categortType: 6,


                    },
                    {
                        Image: require("../img/19_2020-637241093415267072-526.jpg"),
                        name: "شوربه سى فوود بالكريمه",
                        view: true,
                        time: " 60 min",
                        Elta7der: '15 min',
                        Eltahy: "45 min",
                        Elsouba: "30",
                        components: '½ كيلو طبق سى فوود\nعلبه كريمه طهى\nملح وفلفل اسود\nكمون/شطه/حبهان\nلتر مايه مغلى\nمعلقتين زبده\n5 فصوص ثوم',
                        Step: "نحط حله عالنار ونحط فيها الزبده\nنغسل السى فوود بالمايه\nنحط السى فوود فالحله ونشوحها فالزبده لمده من 5دقايق ل10دقايق\nوبعدين نحط التوم وطبعا يبقا مهروس ونشوحهم تانى تشويحه بسيطه\nوبعدين نحط المايه المغليه عليهم ونحط جميع البهارات وبعدين نسيبهم يغلو على نار متوسطة الحرارة لمده نص ساعة\nوبعد النصف ساعة نحط الكريمه ونسيبها تغلى لمدة 10دقايق\nوبعدين تقدم بالهنا والعافيه",
                        video: "https://www.youtube.com/watch?v=uAgYzfTctV8",
                        categortType: 6,


                    },
                    {
                        categortType: 1,
                        Image: require("../img/89a3ec2249273fc52325bd98a9e34f46_w750_h500.jpg"),
                        name: "كيكة زبادي بالشربات",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "40",
                        components: "- مقادير الشربات :\nسكر : كوب\nالماء : ثلث كوب\nعصير الليمون : ملعقة صغيرة\nماء الورد : ملعقة صغيرة\n- زبادي : كوب\n- طحين : كوبان ونصف (منخل)\n- البيض : 3 حبات\n- سكر : كوب\n- الفانيليا : ملعقة صغيرة\n- بيكنج بودر : 2 ملعقة صغيرة\n- بيكربونات الصودا : نصف ملعقة صغيرة\n- الزيت : نصف كوب",
                        view: true,
                        Step: "سخني الفرن على درجة حرارة 180 مئوية\nوجهزي قالب الكيك بدهنه بالزيت ورشة طحين أو بالزبدة.\nفي وعاء للخلط: ضعي السكر والبيض والفانيلا واخفقي المكونات باستخدام المضرب الكهربائي حتى الحصول على مزيج متجانس وقوام كريمي.\nأضيفي الزيت واستمري بالخفق.\nفي وعاء آخر اخلطي المكونات الجافة التالية: الطحين\nوالملح\nوبيكربونات الصودا\nوالبيكنج باودر\nوأضيفي المكونات الجافة على السائلة مع إضافة الزبادي حتى تمتزج المكونات مع بعضها البعض جيدا.\nصبي خليط الكيك في القالب وأدخليه إلى الفرن لمدة 40 – 45 دقيقة حتى تمام نضج الكيك.\nأخرجي الكيك من الفرن ويترك حتى يبرد تماما.\nلتحضير الشربات: امزجي السكر والماء في وعاء على النار حتى درجة الغليان\nثم أضيفي ماء الورد وعصير الليمون وقلبي المكونات حتى الحصول على مزيج الشربات المطلوب.\nوزعي الشربات على الكيك حتى يتشرب الكيك الشربات جيدا وزيني الكيك بحسب الرغبة.",
                        time: "1 h",
                        video: "https://www.youtube.com/watch?v=WkV2S_qVEbQ"
                    },
                    {
                        Image: require("../img/flafel.jpg"),
                        name: "فلافل بيتي بالخلاط",
                        view: true,
                        time: " 40 min",
                        Elta7der: '35 min',
                        Eltahy: "5 min",
                        Elsouba: "30",
                        components: '1/2 ك فول مدشوش\n1 بصلة كبيرة\n3 حزم كرات\n2 حزمة بقدونس\n1 راس ثوم',
                        Step: "يبل الفول ف الماء قبلها بيوم\nيقطع الكرات والبقدونس ويغسل\nيقطع البصل مكعبات ويقشر الثوم\nف كبة الخلاط نضع الخليط ونضرب الي أن تصير ناعمه\nتحفظ ف اكياس ف الثلاجة وعند الاستخدام نضيف على العجين ملح وشطة وكمون وكزبرة حصي ونص ملعقة صغيرة بيكنج بودر\nيشكل العجين لاقراص وتتبل ف السمسم الابيض وتقلي بالزيت",
                        video: "https://www.youtube.com/watch?v=3qn7YG4vTdw",
                        categortType: 4,


                    },
                    {
                        Image: require("../img/484.jpg"),
                        name: "جلاش باللحمة المفرومة",
                        view: true,
                        time: " 30 min",
                        Elta7der: '10 min',
                        Eltahy: "20 min",
                        Elsouba: "30",
                        components: '½ كيلو لحمة معصجة\nلفة جلاش\nبيضتين\nكوب لبن\n¼ معلقه صغيره فلفل اسود\n¼ معلقه صغيره ملح\nمعلقتين كبار سمن',
                        Step: "هنحضر اللحمة ونخليها على جمب لينك الوصفة فالمكونات\nهندهن صينيه كبيره بالسمن وهنفتح الجلاش هناخد ورقتين ونرص نصهم فالصينيه ونصم برا\nوناخذ ورقتين تاني ونرصهم نصهم في الصينيه ونصهم برا وبين كل راق والتاني هنضيف مسحة من السمن هنضيف اللحمة ونطبق ورق الجلاش الي برا على الحشو\nوبين كل تطبيقه والتانيه هنضيف مسحة سمنه لما تقفل خالص وعلى الوش هنضيف ورقه كاملة وبعدين نقطعها حسب الرغبة يامربعات يامثلثات ومسحة سمن عالوش\nفي طبق صغير هنضيف اللبن والبيض والملح والفلفل الأسود ونربهم مع بعض حلو اوي ونوزعه على وش الجلاش وندخلها الفرن تستوي على درجة حرارة ١٨٠ وتتحمر من الوش تتقدم سخنة وبالهنا ",
                        video: "https://www.youtube.com/watch?v=me3ZoOCpb6U",
                        categortType: 4,

                    },
                    {
                        Image: require("../img/m5zn_12528406b9a94fc.jpg"),
                        name: "الفراخ المشوية بالبقدونس والجزر",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "50",
                        components: '6 افخاذ دجاج\nالتتبيلة\nمعلقه ونص كبار ملح\n4 معالق كبار عسل اسود\n½ معلقة صغيره فلفل اسود\n½ معلقة صغيره كاري\nمعلقه صغيره زعتر\n4 معالق كبار خل\nبصله كبيره مبشورة\n½ كوب جزر مبشور\nمعلقتين كبار بقدونس متقطع\nمعلقه صغيرة توم مفروم',
                        Step: "هنغسل الفراخ وتتقطع ونخليها تتصفي خالص من الميه\nفي بولة غويطة هنضيف مكونات التتبيلة كلها ونقلبها مع بعض حلو اوي\nفي بولة غويطة هنضيف مكونات التتبيلة كلها ونقلبها مع بعض حلو اوي\nهنرصها فالصينيه وندخلها الفرن تتشوي على درجة حرارة ٢٢٠ وتتقدم سخنة مع المكرونة او الأرز وبالهنا ",
                        video: "https://www.youtube.com/watch?v=INcw74ZiYnY",
                        categortType: 1,
                    },
                    {
                        Image: require("../img/4647824981584556199.jpg"),
                        name: "بطاطس محشية باللحمة المفرومة",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: 'كيلو بطاطس صغيره\n½ كيلو لحمه مفرومه\nبصل\nم ص ملح وفلفل\nم ص بهارات\n2 م ك صلصه\nم ص توم مفروم\nم ص بابريكا',
                        Step: "تقشر البطاطس وتقور ثم تغسل بالماء ثم تحمر فى زيت غزير\nنقوم بتعصيج اللحمه بوضع معلقه سمنه فى وعاء مناسب ثم ننزل بالبصل يدبل ثم اللحمه ونتبلها ونتركها تنضج\nنقوم بحشو اللحمه داخل البطاطس ثم نرصها فى صينيه\nفى طاسه صغيره ننزل بمعلقه زيت ثم التوم والصلصه والتوابل ثم نسقى بها البطاطس ثم ندخلها الفرن تحمر ونخرجها نقدمها بالف هنا",
                        video: "https://www.youtube.com/watch?v=Bybn0UwkOrU",
                        categortType: 4,


                    },
                    {
                        categortType: 1,
                        Image: require("../img/110cbf893a9f3a68f23dccb19d2dd6e8_w750_h500.jpg"),
                        name: "السينابون",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "25",
                        components: "- طحين : 4 اكواب\n- حليب : نصف كوب (دافئ)\n- خميرة : 4 ملعقة صغيرة\n- سكر : ملعقة كبيرة\n- الزبدة : ربع كوب\n- البيض : 1 حبة\n- سكر : ربع كوب\n- ملح : ملعقة صغيرة",
                        view: true,
                        Step: "ضعي الخميرة على الحليب الدافئ وملعقة السكر في كوب\nوقلبي جيدا.\nضعي كل المكونات الأخرى في وعاء كبير الحجم\nوقلبي جيدا.\nأضيفي كوب الخميرة والحليب على مكونات عجينة السينابون\nثم اعجني العجينة جيدا حتى تصبح ناعمة الملمس.\nاتركي العجينة حتى تختمر\nثم شكليها واحشيها.",
                        time: "1 h",
                        video: "https://www.youtube.com/watch?v=uz1r7fhg9A8"
                    },
                    {
                        Image: require("../img/rokak.jpg"),
                        name: "رقاق طري باللحمة المفرومة",
                        view: true,
                        time: "40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: ' لفه رقاق طري.\nنصف كيلو لحم مفروم.\nبصلة كبيرة مبشورة.\nطماطم مبشورة.\nمعلقة صلصة كبيرة.\nمرقة دجاج.\nتوابل لحم.\nفلفل أسود.\nفلفل أخضر مقطع.\nملح.\nلبن.\nشوربة لحم أو فراخ.\nسمن.',
                        Step: "نحضر صينية متوسطة مدهونة بالسمن\nثم نضع ورقة واحدة من الرقاق ونمسح بالسمن\nونكمل بهذه الطريقة حتى نكمل نصف الكمية الموجودة من الرقاق.\nنضع اللحم المفروم المعصج في المنتصف ونكمل باقي الأوراق بهذه الطريقة.\nنضع الشوربه من فوقها وتدخل الفرن على درجة حرارة متوسطة حتى يحمر الوجه ويقدم ساخنا. ",
                        video: "https://www.youtube.com/watch?v=Op3UgTR3ujE",
                        categortType: 4,


                    },

                    {
                        Image: require("../img/54423-55.jpg"),
                        name: "طاجن بطاطس باللحمة",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: 'ك بطاطس مقطع\nك لحمة مقطع\nك طماطم معصور\n3 فص ثوم مقطع\nبصلة مقطعة\n2 معلقة ملح فلفل\nملعقة كزبرة\nمعلقة بهارات على جوزة الطيب\nورقة لوري على حبهان',
                        Step: "هنجيب حلة ونحط فية طماطم وبصلة ولوري وحبها\nونسيبة تغلى نحط للحمة\nاول متخش في السوية نحط ملعقة ملح وفلفل\nبعد كدة هنجيب الطاجن الطاجن ونحط البطاطس واللحمة والبصل والملح\nونحط التوابل والبهارات ونقلبهم في بعض\nونحط الطماطم ومعلقة سمنة\nونغطية بفويل وندخلة الفرن\nلاحد السوية\nهنشيل الغط ونحطة تحت الشوية",
                        video: "https://www.youtube.com/watch?v=UiPWYbzN0-U",
                        categortType: 6,


                    },

                    {
                        Image: require("../img/meatWithfrek.jpg"),
                        name: "طاجن لحمة بالفريك",
                        view: true,
                        time: " 50 min",
                        Elta7der: '10 min',
                        Eltahy: "40 min",
                        Elsouba: "60",
                        components: '¼ ك فريك مغسول ومنقوع\n½ ك لحمة مقطع\nمعلقة سمنة\n2 معلقة زيت\nملعقة صلصة\nبصلة مقطعة\n2 معلقة ملح وفلفل\nمعلقة\nجوزة الطيب',
                        Step: "هنجيب حلة ونحط السمنة ونحط اللحمة ونشوحة لاحد ميتغر اللون\nهنحط مياه ساخنة ونحط بصلة وطماطمة ونسيبة تخش في السوية\nنحط ملعقة ملح وفلفل\nهنجيب حلة ونحط ملعقة سمنة ونحط بصلة ونقلب ونحط الصلصة\nونحط ٢كوبية شوربة ونسيبة\nتغلى نحط الفريك ونحط التوابل والبهارات والملح ونسيبة يشرب\nهنجيب الطاجن ونحط الفريك واللحمة وندخلة الفرن",
                        video: "https://www.youtube.com/watch?v=dQNoYn_7bA0",
                        categortType: 6,

                    },
                    {
                        Image: require("../img/1613190183_node.png"),
                        name: "كشري مصري",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: 'معكرونة : 1 كيلو (مشكلة)\nالأرز المصريّ : نصف كيلو\nالعدس : نصف كيلو\nطماطم : 1 كيلو\nالثوم : 10 فصوص\nشعيرية : ربع كيلو\nالبصل : 3 حبات\nالخل : حسب الحاجة\nملح : حسب الرغبة\nالشطة : حسب الحاجة\nالكمون : حسب الرغبة\nحمص : ربع كيلو\nعصير الليمون : حسب الرغبة\nالزيت : حسب الحاجة\nالكزبرة : ربع ملعقة صغيرة',
                        Step: "حمري 5 فصوص ثوم جيدا وأضيفي الطماطم بعد تصفيتها وضعي نصف ملعقة فلفل أسود وملعقة ونصف ملح و٤ ملعقة خل واتركيهم يغلوا جيدا حوالي نصف ساعة مع تزويد الماء ونتركها حتى تستوي. اغسلي نصف كيلو العدس جيدا ونغطيه بالماء ونزود ونضيف الثوم والبصل ونصف ملعقة كبيرة ملح ويترك على النار.\nضعي في قدر 4 ملعقة زيت ونضيف الشعيرية ونحمرها جيدا ونغسل الأرز وينزل به على الشعيرية مع ملعقة من الملح والماء وتترك المكونات نصف ساعة حتى يستوي الأرز.\nفي قدر آخر نضع الحمص حتى ينسلق مع نصف ملعقة صغيرة ملح.\nلتحضير الدقة: افرمي الثوم وضع كوب من الخل وكوب ماء ثم نصف ملعقة ملح ونصف ملعقة كمون وربع ملعقة كزبرة مطحونة.\nلتحضير الشطة: اضربي الطماطم في الخلاط وضعيهم في قدر وأضيفي 5 ملعقة من صلصة الكشري وعصير الليمون وملعقة كبيرة خل و5 ملعقة صغيرة شطة وملعقة ملح صغيرة وكوب من الماء ويترك ليغلي 5 دقائق.\nاسلقي المكرونة في الماء والزيت والملح وتصفى ونضيف 3 ملعقة زيت ونقلبها.\nحمري البصل الشرائح المغطى بالدقيق في الزيت الغزير حتى يتحمر.\nضعي المكرونة في طبق التقديم\nوأضيفي الأرز مع العدس والحمص وعليهم الصلصة والبصل المقرمش وضعي الدقة والشطة بأطباق جانبية.",
                        video: "https://www.youtube.com/watch?v=RX6k_VjkM1M",
                        categortType: 4,

                    },
                    {
                        Image: require("../img/46188.jpg"),
                        name: "ورق عنب",
                        view: true,
                        time: " 60 min",
                        Elta7der: '20 min',
                        Eltahy: "40 min",
                        Elsouba: "90",
                        components: 'نصف كيلو ورق عنب مسلوق.\n2كوب كبير من عصير الطماطم.\nحزمه بقدونس.\nبصل مفروم.\nملعقة كبيرة سمن بلدي أو نباتي.\nملح وبهارات محشي.\n2 كوب مرقه دجاج أو لحم.\n2 كوب أرز ابيض مغسول ومصفي جيدا من الماء.',
                        Step: "تحضير وعاء مناسب وإضافة السمن مع البصل ويقلب جيدا لمدة دقيقتين ثم إضافة عصير الطماطم و الملح وبهارات المحشي  ويترك الطماطم على النار حتى يصبح خليطه سميك ثم إضافة البقدونس المفروم والأرز مع التقليب جيدا في وعاء مع إضافة شرائح من البصل والطماطم ثم حشو ورق العنب بخلطة الأرز ورصه بطريقه منظمه ومرتبة وبعد الانتهاء تضاف المرقة مع معلقة كبيرة من السمن ويطهي ورق العنب على نار عالية لمدة 10 دقائق ثم تهدئة النار ويطهي لمدة 40 دقيقة ويقدم ورق العنب ساخن مع الدجاج أو اللحم أو البط.",
                        video: "https://www.youtube.com/watch?v=ELp9zkImO_8",
                        categortType: 4,

                    },
                    {
                        Image: require("../img/50e33a46e3aa05b3d61625a1840d936b_w750_h500.jpg"),
                        name: "بيتزا الباربكيو",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: '- مكونات العجينة :\nملح : رشّة\nالزيت : ربع كوب\nسكر : رشّة\nالخميرة الفورية : ملعقة كبيرة\nدقيق : 3 اكواب\nماء دافئ : كوب\n- جبنة : كوب (مبشورة)\n- صدر الدجاج : 2 قطعة\n- صلصة الباربيكيو : كوب\n- البصل : 1 حبة (مقطع شرائح)\n- ملح : رشّة\n- فليفلة خضراء : نصف حبة (مقطعة)\n- صلصة طماطم : 2 ملعقة كبيرة',
                        Step: "ضعي الخميرة في كوب ماء دافئ مع رشة سكر\nثم حركي الخليط واتركيه قليلا حتى يتخمر. ضعي الدقيق في طبق مع رشة ملح والزيت\nواعجني جيدا حتى تحصلي على عجينة متماسكة.\nضعي العجينة في وعاء مدهون بالزيت وغلفيها واتركيها حتى تتخمر لمدة ساعة واحدة.\nضعي صدور الدجاج المقطعة في قدر مع رشة ملح واقليها حتى تنضج.\nافردي العجينة بواسطة الشوبك واصنعي ثقوبا في العجينة بواسطة شوكة.\nاخلطي صلصة الباربكيو مع صلصة الطماطم وافرديها على العجينة.\nضعي صدور الدجاج والفليفلة الخضراء\nوشرائح البصل\nوالجبنة المبشورة على العجينة.\nاخبزيها في الفرن حتى تنضج ثم قدميها.",
                        video: "https://www.youtube.com/watch?v=HHPTD_eXfWI",
                        categortType: 7,

                    },
                    {
                        Image: require("../img/0fde4266664dbd6a75ef98da2fd8bb01_w750_h500.jpg"),
                        name: "باذنجان محشي",
                        view: true,
                        time: " 50 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "50",
                        components: '- الأرز المصريّ : كيلو\n- البصل : 3 حبات (مفروم)\n- عصير الطماطم : 4 اكواب\n- مرق دجاج : 4 اكواب\n- الشبت : نصف كوب\n- بقدونس : نصف كوب\n- كزبرة خضراء : نصف كوب\n- صلصة طماطم : ملعقة كبيرة\n- الزيت : ملعقة كبيرة\n- القرفة : نصف ملعقة صغيرة\n- نعناع ناشف : ملعقة صغيرة\n- بهارات مشكلة : ملعقة كبيرة\n- فلفل أسود : ملعقة\n- جوزة الطيب : ربع ملعقة صغيرة\n- الشطة : نصف ملعقة صغيرة\n- ملح : حسب الرغبة',
                        Step: "على نار متوسطة سخني الزيت ثم أضيفي البصل وقلبيه حتى يذبل ثم أضيفي صلصة الطماطم و3 أكواب من عصير الطماطم وقلبي ثم اتركيها حتى تغلي. أضيفي مكعب المرق وقلبي لمدة 5 دقائق وفي وعاء كبير ضعي الأرز والكزبرة والشبت والبقدونس وخليط البصل والطماطم والنعناع والقرفة والبهارات وجوزة الطيب والفلفل الأسود والملح والفلفل الحار وقلبي جيدا.\nاحشي الباذنجان بالأرز واتركي مقدار عقلة اصبع حتى تسمحي للأرز بالتمدد أثناء النضج وعلى نار متوسطة ضعي باقي عصير الطماطم والمرق واتركيه حتى يغلي.\nرصي الباذنجان في القدر ثم صبي المرق في داخل كل ثمرة باذنجان ثم صبي باقي المرق في قاع القدر حتى يصل إلى منتصف الباذنجان ثم غطي القدر واتركيه على نار متوسطة حتى يغلي المرق.\nأخفضي النار لتصبح هادئة واتركيه لمدة 60 دقيقة حتى ينضج وقدميه ساخنا.",
                        video: "https://www.youtube.com/watch?v=QvLdDdt_XoI",
                        categortType: 4,

                    },
                    {
                        Image: require("../img/a55cbaa56ad2a42b19c3f0e50e065be5_w750_h500.jpg"),
                        name: "أرز بالحمص",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: '- الأرز : كوب ونصف\n- البصل : 1 حبة (متوسط الحجم / مفروم فرما ناعما)\n- حمص : كوب (حبوب)\n- السمن البلدي : 2 ملعقة كبيرة\n- بهارات مشكلة : نصف ملعقة صغيرة\n- ملح : رشّة\n- فلفل أسود : رشّة\n',
                        Step: "في قدر من الماء على نار متوسطة\nضعي حبوب الحمص حتى تُسلق وتنضج تماما\nثمّ اغسليها وصفيها من الماء وضعيها جانبا.\nاغسلي الأرز بالماء\nثمّ اتركيه حتى ينقع لفترة من الوقت.\nفي قدر غير لاصق ومتوسط الحجم وعلى نار متوسطة سخني السمن\nثم أضيفي البصل وشوحي حتى يذبل ويصبح ذهبي اللون.\nصفّي الأرز من الماء\nوأضيفيه فوق البصل في القدر واتركيه حتى يتحمّر قليلا.\nأضيفي حبوب الحمص مع كميّة البهارات والملح\nواسكبي حوالي 2 كوب من الماء\nثم حركي جيدا واتركي المزيج حتى يغلي.\nغطي القدر عند الغليان\nثم خففي النار واتركيه حتى ينضج الأرز تماما.\nاسكبي الأرز بالحمص في طبق التقديم وقدميه ساخنا.",
                        video: "https://www.youtube.com/watch?v=OpEqt-mrcgI",
                        categortType: 3,

                    },
                    {
                        Image: require("../img/2b1b8ee85f95fcd65e75e2a1e2c91adc_w750_h500.jpg"),
                        name: "دجاج بصوص الخردل",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: '- صدر الدجاج : 4 صدو\n- المايونيز : 3 ملاعق كبيرة\n- الخردل : ثلث كوب\n- العسل : 3 ملاعق كبيرة\n- الصويا صوص : ملعقة كبيرة\n- عصير الليمون : ملعقة كبيرة',
                        Step: "اخلطي الخردل\nوالعسل\nوعصير الليمون\nوالصويا صوص\nوالمايونيز\nفي طبق.\nارفعي ملعقتين كبيرتين من الصوص للتقديم.\nاخلطي باقي كمية الصوص بالدجاج في طبق وغطيه\nواتركيه في الثلاجة ليلة كاملة.\nأخرجي الطبق من الثلاجة\nوضعي الدجاج مع الصوص في صينية فرن\nوأدخليها الفرن على درجة حرارة 165 مئوية لمدة 15 دقيقة أو حتى ينضج الدجاج.\nقدميه ساخنا ووزعي كمية الصلصة الإضافية فوقه.",
                        video: "https://www.youtube.com/watch?v=dPMkgbc6akY",
                        categortType: 1,

                    },
                    {
                        Image: require("../img/9b3fbd09a97d3a465cfcaebe6c7d677c_w750_h500.jpg"),
                        name: "مسقعة الباذنجان والبطاطس ",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: '- للصلصة البيضاء - البشاميل :\nالزبدة : كوب دقيق : 2 كوب حليب : 6 اكواب (ساخن)\nكريمة الطبخ : 4 اكواب\n- للتقديم :\nفتات الخبز : نصف كوب\nجبن البارميزان : 3 ملاعق كبيرة (مبشور)\n- لحم العجل : كيلو (مفروم)\n- القرفة : ملعقة صغيرة (مطحونة)\n- جوزة الطيب : ملعقة صغيرة (مطحونة)\n- زيت الزيتون : كوب\n- البصل الأحمر : 2 كوب (مفروم فرما ناعما)\n- الثوم : نصف كوب (مفروم)\n- البطاطس : 5 حبات (مقطّعة قطع كبيرة)\n- الباذنجان : 5 حبات (مقطع قطع كبيرة)\n- الفطر : 2 كوب (مفروم)\n- الكرفس : 2 كوب (مفروم فرما ناعما)\n- الكراث : 2 كوب (مفروم فرما ناعما)\n- إكليل الجبل : 3 ملاعق صغيرة (مفروم)\n- الزعتر : رشّة\n- أوراق الريحان : حفنة (طازجة)\n- عصير العنب الاحمر : كوب\n- معجون الطماطم : كوب\n- السكر البني : 2 ملعقة صغيرة\n- طماطم : 2 كوب (مقشرة ومفرومة فرما ناعما)\n- ملح : حسب الرغبة\n- فلفل أسود : حسب الرغبة',
                        Step: "ضعي اللحم المفروم مع القرفة\nوجوزة الطيب\nإلى قدر به زيت على النار مع غطاء القدر\nوبعد 15 دقيقة\nضعي فرم البصل مع التقليب حتى يكتسب لونا ذهبيا\nً أضيفي الثوم\nوالبطاطس\nوالباذنجان\nوالفطر\nوالكرفس\nوالكراث\nوإكليل الجبل\nوالزعتر\nوأوراق الريحان\nواطهي المكونات جيدا قبل إضافة عصير العنب الأحمر.\nعندما تتشرب المكونات عصير العنب\nأضيفي معجون الطماطم\nوالسكر مع التحريك لـ 3 دقائق\nثم أضيفي الطماطم المقشرة\nوتبهر بالملح وتطهى لمده 60 دقيقة.\nلإعداد الصلصة البيضاء (البشاميل): ذوبي الزبدة في قدر صغير على النار\nوأضيفي الدقيق مع التحريك لـ 10 دقائق قبل صبّ الحليب الساخن تدريجيا\nودعي المكونات لـ 10 دقائق على نار هادئة.\nللتقديم: اسكبي الصلصة البيضاء فوق القدر الذي يدخل إلى فرن ساخن وذلك لـ 15 دقيقة\nثم زيني القدر بالجبن\nوفتات الخبز\nوتدخل إلى الفرن مجددا لدقائق قبل التقديم.",
                        video: "https://www.youtube.com/watch?v=eABWp3GPIUE",
                        categortType: 4,

                    },
                    {
                        Image: require("../img/f3e6936fc09d00be1c90bec714625521_w750_h500.jpg"),
                        name: "كفته داوود باشا",
                        view: true,
                        time: " 60 min",
                        Elta7der: '20 min',
                        Eltahy: "40 min",
                        Elsouba: "60",
                        components: '- مقادير الصلصة :\nالبصل : 1 حبة (مفروم)\nالثوم : فصّان (مهروس)\nصلصة طماطم : 2 كوب\nمعجون الطماطم : 2 ملعقة صغيرة\nالزيت النباتي : 2 ملعقة كبيرة\nالماء : ربع كوب\n- لحم مفروم : 500 غراما\n- البصل : 1 حبة (مفروم)\n- كزبرة خضراء : ربع كوب (مفرومة)\n- بقدونس : نصف كوب (مفروم)\n- الزيت النباتي : ربع كوب\n- فلفل رومي : 1 حبة (مفروم)\n- الثوم : فصّان (مهروس)\n- فلفل أسود : نصف ملعقة صغيرة\n- كزبرة يابسة : ملعقة صغيرة\n- بهارات مشكلة : ملعقة صغيرة',
                        Step: "في وعاء للخلط\nضعي اللحم\nوالكزبرة\nوالبصل\nوالبقدونس\nوالثوم\nوالفلفل الأسود\nوالبهارات\nوالفلفل الرومي\nوالكزبرة الجافة\nاخلطي المكونات حتى تتداخل.\nحمّي الزيت في مقلاة على نار متوسطة\nوشكلي كرات متساوية الحجم من خليط اللحم\nوضعيه في المقلاة\nوقلبي حتى يتغير لونها وتنضج\nثم ارفعيها من المقلاة وضعيها في طبق جانبي.\nفي مقلاة على النار\nسخني الزيت\nثم أضيفي البصل والثوم وقلبي حتى يذبلا.\nأضيفي معجون الطماطم\nوصلصة الطماطم\nوالملح\nوالبهارات المشكلة\nوالماء وحركي المكونات حتى تتداخل.\nعند الغليان خففي النار\nوأضيفي كرات اللحم\nثم غطي المقلاة\nواطبخي المكونات حتى تنضج وتكثف الصلصة.\nيقدم ساخنا بجانب الأرز الأبيض.",
                        video: "https://www.youtube.com/watch?v=hcRuAVoOIQI",
                        categortType: 4,

                    },
                    {
                        Image: require("../img/b370dcb6a455f9e136588beaec699d2d_w750_h500.jpg"),
                        name: "محشي الكوسا والباذنجان ",
                        view: true,
                        time: " 65 min",
                        Elta7der: '25 min',
                        Eltahy: "40 min",
                        Elsouba: "70",
                        components: '- الباذنجان : نصف كيلو\n- الكوسا : نصف كيلو\n- الأرز : 2 كوب (مغسول ومصفى)\n- البصل : 1 حبة (مفروم)\n- بقدونس : نصف كوب (مفروم)\n- طماطم : 2 حبة (مقطعة)\n- الثوم : 3 فصوص\n- لحم مفروم : ربع كيلو\n- زيت الزيتون : نصف كوب\n- مرق دجاج : مكعب\n- نعناع ناشف : ملعقة صغيرة\n- ملح : حسب الرغبة\n- فلفل أسود : حسب الرغبة\n- البطاطس : 2 حبة (مقطعة شرائح)\n- ماء ساخن : حسب الحاجة',
                        Step: "احفري الكوسا والباذنجان أزيلي اللبّ من الداخل\nثم اغسلي الخضار جيدا وصفيها.\nحضري وعاء\nواخلطي اللحم المفروم\nوالطماطم\nوالبصل\nوالبقدونس\nوالأرز المغسول.\nأضيفي الملح\nوالفلفل الأسود حسب الرغبة\nوالثوم\nوالنعناع الجاف\nوزيت الزيتون\nوقلبي المكونات جيدا حتى تمتزج تماما.\nاحشي الكوسا والباذنجان بالخليط دون ملئها.\nحضري قدر\nوضعي به القليل من الزيت ويتم رص شرائح البطاطس به.\nضعي الكوسا والباذنجان فوق البطاطس\nوأضيفي الماء المغلي مع مرق الدجاج والملح.\nضعي القدر على النار مع تغطيه\nواتركيه حتى الغليان\nثم خففي النار\nواتركيه حتى تنضج الخضار.\nقبل الإستواء ضعي الثوم المهروس مع ملعقة كبيرة نعناع جاف واتركيه لعشر دقائق إضافية.\nاسكبي المحشي في طبق التقديم وقدميه ساخنا.",
                        video: "https://www.youtube.com/watch?v=5El4aaTrCVg",
                        categortType: 4,

                    },
                    {
                        Image: require("../img/7868aa162f2f871cdd7db810f98f8b5c_w750_h500.jpg"),
                        name: "مقلوبة السمك",
                        view: true,
                        time: " 60 min",
                        Elta7der: '15 min',
                        Eltahy: "45 min",
                        Elsouba: "30",
                        components: '- سمك الفيليه : 2 كيلو\nمرق السمك : 2 مكعب\nالبصل : 6 حبات (مقطع شرائح)\nالسمنة : 2 ملعقة كبيرة\nبهار السمك : ملعقة كبيرة\nالكمون : ملعقة كبيرة\nالزيت : نصف لتر (لقلي السمك)',
                        Step: "تبلي السمك بالبهارات واتركيه جانبا.\nانقعي الأرز لمدة 20 دقيقة ثم صفيه.\nفي قدر على النار\nضعي البصل واقليه بالسمنة\nوضعي مكعبات مرق السمك\nوالبهارات\nوالأرز.\nصُبي الماء على الأرز واتركيه لينضج.\nاقلي السمك وضعيه فوق الأرز المفلفل\nوتقدم المقلوبة مع السلطة بالطحينة.",
                        video: "https://www.youtube.com/watch?v=atLWX35t51Q",
                        categortType: 6,

                    },
                    {
                        Image: require("../img/31b85a6c088484f1f33ed58316ded79f_w750_h500.jpg"),
                        name: "الكباب المشوي",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: '- زيت الزيتون : 3 ملاعق كبيرة\n- خل العنب : 3 ملاعق كبيرة\n- الخردل : ملعقة كبيرة\n- لحم البتلو : 500 غراما (لحم العجل / مقطع مكعبات)\n- صلصة الباربيكيو : ملعقة كبيرة (جاهزة)\n- إكليل الجبل : ملعقة صغيرة (روزماري / مفروم)\n- الفليفلة الحمراء : 2 حبة (متوسطة الحجم / منزوعة البذور ومُقطَّعة إلى مكعبات)\n',
                        Step: " لإعداد التتبيلة: يُضاف زيت الزيتون والخل والخردل إلى قارورة صغيرة\nوتُرجُّ هذه الأخيرة جيِّدًا\nحتَّى تختلط المكوِّنات جيِّدًا.\nتوزَّع مكعبات اللحم في طبق زجاج عميق\nوتُملَّح وتُبهَّر حسب الرغبة\nثمَّ تُصبُّ التتبيلة عليها\nكما يُضاف فرم إكليل الجبل\nوصلصة الباربكيو. وتمرَّغ المكعبات بالصلصة جيِّدًا.\nتوزَّع مكعبات اللحم على الأشياش\nبالتناوب مع الفليفلة\nوتشوى حتَّى تنضج وتصبح بنيَّة اللون\nوزهريَّة وطريَّة من الداخل.\nستحتاجين إلى: أشياش الخشب\nمنقوعة بالماء.",
                        video: "https://www.youtube.com/watch?v=rQD1DApqkE0",
                        categortType: 5,

                    },
                    {
                        Image: require("../img/31b5fb1d5b095a960dfbe7d2e31cd273_w750_h500.jpg"),
                        name: "مكرونة بالتونة دايت",
                        view: true,
                        time: " 25 min",
                        Elta7der: '5 min',
                        Eltahy: "20 min",
                        Elsouba: "20",
                        components: '- معكرونة : 500 غراما\nالتونا : علبة (مصفاة من الزيت)\nطماطم : 400 غراما (مقطعة)\nالفلفل الملوّن : 3 حبات\nكزبرة خضراء : ضمة\nالفلفل الحار : نصف ملعقة صغيرة\nالثوم : فصّان (مفروم)\nملح : رشّة\nفلفل أسود : رشّة\nالزيتون : ربع كوب (منزوع النواة)\nزيت الزيتون : 2 ملعقة كبيرة\nالبصل : 1 حبة (مفروم)',
                        Step: "اسلقي المكرونة في ماء وملح وزيت لمدة 10 دقائق حتى تنضج\nثم صفيها واتركيها جانبا.\nسخني الزيت في مقلاة على النار\nوشوحي البصل والثوم حتى يذبلا.\nأضيفي الفلفل الألوان\nوالطماطم\nوالكزبرة\nوالزيتون\nوالتونة.\nتبلي بالملح والفلفل الأسود\nثم حركي قليلا.\nأضيفي المكرونة المسلوقة وقلبي جيدا\nثم ضعيها في طبق التقديم وقدميها ساخنة.",
                        video: "https://www.youtube.com/watch?v=XXegVJTN1Qc",
                        categortType: 2,

                    },
                    {
                        Image: require("../img/969e8aab44a92214cae12916d30bbe4a_w750_h500.jpg"),
                        name: "كاساديا الدجاج بالجبن الشيدر",
                        view: true,
                        time: " 30 min",
                        Elta7der: '5 min',
                        Eltahy: "25 min",
                        Elsouba: "30",
                        components: '- الزيت النباتي : ملعقتان كبيرتان ونصف\n- خبز التورتيلا : 4 أرغفة\n- الدجاج : 2 كوب (مسلوق ومفتت)\n- جبن الشيدر : 2 كوب (مبشور)',
                        Step: "قطّعي خبز التورتيلا إلى أنصاف.\nوزعي كمية من جبن الشيدر\nثم الدجاج المفتت\nثم جبن الشيدر داخل نصف الخبز.\nأغلقي أنصاف الخبز على الحشوة بالنصف الفارغ من الخبز\nواضغطي عليه قليلا.\nكرري الخطوة السابقة حتى نفاذ الكمية.\nسخني الزيت في مقلاة على نار متوسطة\nواقلي الخبز المحشي لدقيقتان حتى يذوب الجبن بداخله.\nقدمي كاساديا الدجاج بجبن الشيدر ساخنا.",
                        video: "https://www.youtube.com/watch?v=HzWKH4FgPvM",
                        categortType: 7,

                    },
                    {
                        Image: require("../img/a0a8698daa960a40c15194a6a0b3ba7b_w750_h500.jpg"),
                        name: "كريب شيش طاووق",
                        view: true,
                        time: " 60 min",
                        Elta7der: '30 min',
                        Eltahy: "30 min",
                        Elsouba: "50",
                        components: '- لتحضير الحشوة :\nصدر الدجاج : 500 غراما (مقطع مكعبات)\nمعجون الطماطم : 2 ملعقة كبيرة\nالخل الأبيض : ملعقة كبيرة\nملح : ملعقة صغيرة ونصف\nفلفل أسود : نصف ملعقة صغيرة\nالقرفة : ربع ملعقة صغيرة\nفلفل رومي : 1 حبة (مقطع مكعبات)\nالبصل : 1 حبة (مقطع شرائح)\nبهار دجاج : ملعقة صغيرة\n- لتحضير الكريب :\nحليب : كوب (سائل)\nالماء : كوب\nالبيض : 1 حبة\nملح : رشّة\nفلفل أسود : رشّة\nدقيق : كوب',
                        Step: "لتحضير الحشوة: في وعاء\nضعي الدجاج\nومعجون الطماطم\nوالخلّ\nوالبهارات\nوقلبي المكونات حتى تمتزج واتركيها منقوعة في التتبيلة.\nلتحضير العجينة: في وعاء الخلاط\nضعي الحليب\nوالماء\nوالدقيق\nوالبيض\nوالملح\nوالفلفل الأسود.\nاخلطي المكونات في الخلاط حتى تحصلي على عجينة متجانسة وسائلة.\nسخني مقلاة مدهونة بالزيت على نار متوسطة إلى هادئة\nواسكبي مقدار مغرفة من العجينة.\nحركي المقلاة بشكل دائري لتشكيل العجينة واتركيها حتى تنضج وتتحمر ثم اقلبيها للجهة الأخرى.\nكرري العملية حتى نفاذ الكمية.\nفي مقلاة أخرى\nحمّي ملعقتان من الزيت على نار متوسطة وضعي الشيش طاووق قلبيه حتى يتبدل لونه.\nأضيفي البصل وقلبيه مع الشيش طاووق حتى ينضج.\nأضيفي الفلفل وقلبيه مع باقي المكونات حتى يذبل.\nوزعي كمية من خليط الشيش طاووق على خبز الكريب وقدميه ساخنا.",
                        video: "https://www.youtube.com/watch?v=Dd5qSRtd4x8",
                        categortType: 7,

                    },
                    {
                        Image: require("../img/4df924d6215941ec344097c77d8d409f_w750_h500.jpg"),
                        name: "كبسة خضار سريعة",
                        view: true,
                        time: " 60 min",
                        Elta7der: '15 min',
                        Eltahy: "45 min",
                        Elsouba: "30",
                        components: '- أرز بسمتي : 2 كوب\nمرق دجاج : 4 اكواب\nملح : ملعقة صغيرة وثلاثة أرباع الملعقة\nالفلفل الاحمر الحار : نصف ملعقة صغيرة\nبودرة الكاري : ملعقة صغيرة ونصف\nالكمون : ملعقة صغيرة ونصف\nالكركم : ملعقة صغيرة ونصف\nالثوم : نصف ملعقة صغيرة (مهروس)\nطماطم : 1 حبة (مفرومة فرما ناعما)\nالبصل : 1 حبة (مفروم فرما ناعما)\nورق غار : 2 ورقة\nلومي : 2 حبة (مجفف)\nالزعفران : ربع ملعقة صغيرة\nسمن : 3 ملاعق كبيرة',
                        Step: "انقعي الأرز بالماء البارد لحوالي 35 دقيقة\nثم اغسليه جيدا حتى تتخلصي من أكبر كمية من النشا من الأرز.سخني السمن في قدر كبير الحجم على نار متوسّطة.\nأضيفي البصل وشوّحي مع السمن حتى يذبل.\nأضيفي الثوم والطماطم\nثم قلّبي لدقيقة.تبلي بجميع البهارات واللومي وورق الغار\nثم قلّبي الخليط لعدة دقائق.\nأضيفي الأرز والمرق\nثم خففي النار\nواتركي القدر حتى ينضج الأرز.\nاسكبي كبسة الخضار في طبق التقديم وقدميها ساخنة.",
                        video: "https://www.youtube.com/watch?v=PnoYKPnyxvc",
                        categortType: 3,

                    },
                    {
                        Image: require("../img/f213a26ce9152d184baeed39a4076fa2_w750_h500.jpg"),
                        name: "روستو دجاج بالبرتقال",
                        view: true,
                        time: " 55 min",
                        Elta7der: '10 min',
                        Eltahy: "45 min",
                        Elsouba: "60",
                        components: '- الدجاج : دجاجة\nالبرتقال : 1 حبة (مقطع)\nعصير البرتقال : كوب\nورق غار : 2 ورقة\nالبصل : 1 حبة (مفروم)\nبرش البرتقال : ملعقة صغيرة\nزعتر مجفف : ربع ملعقة صغيرة\nالزيت النباتي : 2 ملعقة صغيرة\nالزبدة : 2 ملعقة صغيرة\nملح : حسب الرغبة\nفلفل أسود : حسب الرغبة\nالثوم : فصّان\nصلصة طماطم : 2 ملعقة كبيرة',
                        Step: "قطعي الدجاجة إلى نصفين طوليا.\nضعي الزيت في قدر على النار\nواقلي الدجاج من جميع الجهات ثم ضعيه جانبا.\nفي القدر نفسه\nحمري البصل المفروم مع الثوم حتى يذبل.\nأضيفي برش برتقال وعصيره\nوصلصة الطماطم\nوورق الغار\nوالزعتر الجاف\nواتركي المقدار يغلي على النار لمدة 5 دقائق.\nأضيفي الدجاج وغطيه حتى ينضج\nثم قدميه وزينيه بقطع البرتقال.",
                        video: "https://www.youtube.com/watch?v=jHBpvyElA4k",
                        categortType: 1,

                    },
                    {
                        Image: require("../img/aasth.jpeg"),
                        name: "قهوة اسبريسو",
                        Elta7der: '5 min',
                        Eltahy: "10 min",
                        Elsouba: "25",
                        components: "4 ملاعق كبيرة (40 جم) قهوة مطحونة\n2 كوب (500 مل) ماء مغلي\nوعاء به مكبس للقهوة (وعاء كبس القهوة)",
                        view: true,
                        Step: "ضعي القهوة في الوعاء\nثم صبي الماء المغلي\nواتركيه جانبًا لمدة أربع دقائق.\nاضغطي على المكبس لأسفل حتى يمنع القهوة من التحرك\nويثبتها في الأسفل. صبي الإسبريسو في أكواب التقديم\nوقدميها ساخنة",
                        time: "20 min",
                        categortType: 1,
                        video: "https://www.youtube.com/watch?v=TpZ2uVtMoVU"
                    },
                    {
                        Image: require("../img/202109041239143914.jpg"),
                        name: "ارز معمر",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: 'يتم معايرة الأرز بنصف كمية البرام\nلتر حلب\nكريمة لباني\nزبدة\nقشطة\nملح',
                        Step: "يتم غسل الأرز جيدا قبل أن يصف\nى قومي بوضع كمية الأرز والتي تكون نصف حجم البرام في الطاجن\nيوضع عليه معلقة كبيرة من الزبدة البقري أو الفلاحي\nعلبة كريمة لباني صغيرة للطبخ قومي بوضعها على الأرز\nيغطى تماما بالحليب المغلي على أن يغمر الأرز به\nثم يوضع عليه الملح فقط حسب الرغبة\nملحوظة: ا يوضع عليه توابل لكي يظهر به طعم القشطة والزبدة في الطاجن فلا يتم وضع أي توابل غير الملح\nثم توضع في الفرن على درجة حرارة متوسطة 180 درجة حتى يصل الأرز بأن يتشرب من الحليب تماما توضع القشطة على وجه الطاجن\nيترك في الفرن حتى يحمر وجه برام الأرز المعمر ويكتمل نضوجه\nيمكن وضع قطع من الحمام مسلوق أو قطع من اللحم البتلو المسلوق أو كبد الدجاج مسلوقة أو صدور فراخ بقلب الطاجن\nيمكنك إضافة جوز الطيب حسب الرغبة",
                        video: "https://www.youtube.com/watch?v=IHWqrDccHuA",
                        categortType: 4,

                    },
                    {
                        Image: require("../img/12b1ffc4d25e01c114fecc8f82d4693b_w750_h500.jpg"),
                        name: "سلطة البطاطس المقلية بالخل والثوم",
                        view: true,
                        time: " 15 min",
                        Elta7der: '5 min',
                        Eltahy: "10 min",
                        Elsouba: "20",
                        components: '- للصوص :\nالطحينية : ربع كوب\nزبادي : 4 ملعقة صغيرة\nالثوم : فصّان (مهروس)\nعصير الليمون : نصف حبة\nالخل : ملعقة صغيرة\nالماء : 2 ملعقة كبيرة\nملح : نصف ملعقة صغيرة\n- خس : كوب ونصف (مقطع)\n- البطاطس : 1 حبة (مقطعة مكعبات ومقلية)\n- طماطم : 1 حبة (مقطعة)',
                        Step: "ضعي الخس المقطع\nوالبطاطس المقلية\nوالطماطم في طبق التقديم.\nاخلطي الزبادي مع الماء\nوالطحينية\nوعصير الليمون\nوالخل\nوالملح\nوالثوم جيدا في وعاء صغير.\nوزعي المزيج فوق خليط السلطة وزيني بالبقدونس وقدميها.",
                        video: "https://www.youtube.com/watch?v=YEmkiZPEKIM",
                        categortType: 3,

                    },
                    {
                        Image: require("../img/20211211164112024.jpg"),
                        name: "بط مشوي بدبس الرمان",
                        view: true,
                        time: " 60 min",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "60",
                        components: 'بط\nملح وفلفل اسود\nبابريكا\nكركم\nكاري\nزنجبيل\nصوص حار\nم. ك دبس الرمان\nخل\n2 بصله\n1 فلفل رومي\n1 جزره كبيره\n2 طماطم\n1 مرقه ماجي فورى\nورق لورى وحبهان ومستكه\n1/2 كوب شوربة بط\nسكر\n1 مرقة دجاج',
                        Step: "يغسل البط وينقع في خل وملح ثم نضع ماء يغلى وعند الغليان نضع ورق اللورى والحبهان والمستكه ونشطف البط ونفتحه فتحات بالعرض بالسكين لسهوله السوا ونسقطه في الماء.\nنزيل الريم ثم نضع ملح وفلفل وماجى والسكر ونهدئ النار ونغطيه ونتركه حتى قرب السوا لمدة ساعة ونص ساعتين حسب حجم البطه.\nاضرب طماطم وبصلايه وبقية التوابل في الكبه حتى تمام التجانس و ننشل البطه من الشربه ونتبلها بالخلطه دى ونتركها ساعتين في التتبيله.\nنحضر صينيه نقطع فيها البصل والجزر والفلفل والطماطم دوائر ونضع ملح وفلفل اسود ونقلب ونضع البط فوقيها ثم نضع نص كوب الشوربه وندخلها الفرن مدة 15 : 20 دقيقه حتى يحمر الوجه. وبالف هنا وشفا",
                        video: "https://www.youtube.com/watch?v=a1BVwmbtHkg",
                        categortType: 4,

                    },
                    {
                        Image: require("../img/104-233834-how-sambosk-works-with-cheese-2.png"),
                        name: "سمبوسه بالجبنه",
                        view: true,
                        time: " 20 min",
                        Elta7der: '10 min',
                        Eltahy: "10 min",
                        Elsouba: "50",
                        components: '1/2 كيلو سمبوسه\nقطعتين جبنه قريش\n2 فلفل اخضر متقطع\n1 بصله متوسطه متقطعه\nرشة فلفل اسود\nرشة ملح\nرشة كمون\nرشة كزبره\nمعلقه صغيره زيت زيتون او نباتي',
                        Step: "هنضيف كل المكونات ع الجبنه ونخلطهم كويس\nهنحشي السمبوسه ع شكل مثلثات\nونسخن الزيت ونحمرها فيها الي ان تأخذ اللون الذهبي",
                        video: "https://www.youtube.com/watch?v=tYb2mKyU9kw",
                        categortType: 4,

                    },
                    {
                        Image: require("../img/downloadhamam.jpg"),
                        name: "حمام محشى",
                        view: true,
                        time: " 70 min",
                        Elta7der: '30 min',
                        Eltahy: "40 min",
                        Elsouba: "80",
                        components: 'جوز حمام\nكوب ارز\nكبد الحمام\nبصل\nnمعلقه ملح وفلفل\nnمعلقه كمون\nnمعلقه بهارات\nرشه نعناع ناشف',
                        Step: "نقوم بتنضيف الحمام وغسله جيدا مع فصل جلد البطن عن اللحم حتى يسهل الحشو\nفى حله نضع معلقه كبيره سمنه ثم ننزل بكبد الحمام وبصله متقطعه صغير وملح وفلفل وكمون ونقلبهم شويه ثم ننزل بالارز المغسول ثم رشه النعناع ونضيف ماء مغلى نصف مقدار الارز لكى يستوي نصف سوا فقط ثم نتركه يبرد قليلا ثم نحشو به الحمام بين الجلد والبطن وايضا نحشو قليل من الارز فى داخل الحمام ثم نغلق الحمام (بتكتيف الارجل داخل بعض)\nيسلق فى ماء مغلى به بصله وشريحه جزر وملح وفلفل وحبهان وورق لوري واي مطيبات تفضلينها\nيترك لينضج ثم نخرجه ونحمره في سمنه او ندهنه من الخارج بالسمن وندخله الفرن تحت الشوايه ليحمر ثم يقدم بالف هنا ",
                        video: "https://www.youtube.com/watch?v=psZA8rf00NI",
                        categortType: 4,

                    },
                    {
                        Image: require("../img/downloadl7maa.jpg"),
                        name: "ورقة لحم بالخضروات",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: '2 بطاطس كبيرة حلقات\n2 بصل جوليان\n2 فلفل رومي حلقات\nقرن فلفل حامي\n2 جزر حلقات\n3 طماطم حلقات\nم صلصة\n5 فص ثوم حلقات\n3 م زيت\n2 مكعب زبدة\nم ص ملح\n1/2 م ص بهار لحم\n1/2 م ص فلفل اسود\n1/2 كيلو لحم بفتيك مدقوق',
                        Step: "تتيل اللحم بملح وفلفل وبهار وتشوح في الزيت والزبدة\nندعك البصل والفلفل الحامي مع ملح وفلفل وبهار باليد\nتجهز الخضروات وتخلط جميعها\nنفرش ورقتين فويل عكس بعض في صينية وفوقها ورقتين زبدة عكس بعض ونضع جزء من اللحم ثم نص الخضار ثم نرص اللحم ثم باقي الخضار\nتغلق الورق جيدا عليها\nتدخل فرن مسخن اعلى حرارة ربع ساعة ثم نهدا النار ١٨٠ ساعة ثم تقلب وتشق على شكل زائد",
                        video: "https://www.youtube.com/watch?v=n0LriJQbzok",
                        categortType: 5,

                    },
                    {
                        Image: require("../img/downloadsopet.jpg"),
                        name: "سبيط مقلي",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "50",
                        components: 'ك سبيط (حبار) مقطع\n5 فصوص ثوم\n2 قرن فلفل\nمعلقة ملح\nمعلقة شطة\nمعلقة كمون\nمعلقة كزبرة\n½كوبية دقيق\nمعلقة ثوم بودرة وبصل بودرة\nكوبية زيت\n2قرن فلفل حامي\nمعلقة خل وليمون',
                        Step: "هنجيب الكبة نحط الثوم والتوابل والملح والثوم والبصل والفلفل\nوالليمون والخل ونضربهم\nبعد كدة نقطع السبيط قطع ونغسلة ونحطة في الخلطة ساعة\nبعد كدة نحطة في الدقيق\nونقلي السبيط والفلفل",
                        video: "https://www.youtube.com/watch?v=vBsiEA0Cg24",
                        categortType: 6,

                    },
                    {
                        Image: require("../img/saidaya.jpg"),
                        name: "رز صياديه",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: '1/2 كيلو رز\nبصل مفروم\nملح\nكمون\nمكعب مرقه دجاج',
                        Step: "نقوم بتحمير البصل للون البنى\nثم نضع الرز عليه ونقلب ثم نضع الملح والكمون ومكعب المرقه ونقلب جيدا\nثم نضع المياه السخنه ونتركه على نار متوسطه ثم نهدى النار ونتركه للتسويه",
                        video: "https://www.youtube.com/watch?v=I_mdyPAQW18",
                        categortType: 4,

                    },
                    {
                        Image: require("../img/20171120020043043.jpg"),
                        name: "النجرسكو",
                        view: true,
                        time: " 80 min",
                        Elta7der: '20 min',
                        Eltahy: "60 min",
                        Elsouba: "60",
                        components: 'مكرونة شرايط مسلوقة.\nنصف كيلو صدور دجاج مقطعة ومسلوقة.\nمشروم طازج مقطع شرائح (اختياري).\n1 ملعقة زيت.\n3 ملاعق كبيرة دقيق.\n7 ملاعق كبيرة لبن بودرة خالي الدسم.\n1 لتر مرقة منزوعة الدسم.\nجبنة موزاريلا مبشورة للوجه.\nجوزة الطيب.\nبودرة ثوم أو بصل.\nملح وفلفل.',
                        Step: "تسلق المكرونة في ماء مغلي مملح بدون إضافة زيت\nويراعى سلقها 3/4 سلقة.\nلعمل البشاميل نضع 1 ملعقة دقيق مع ملعقة الزبدة والزيت حتى يصل إلى اللون الذهبي الفاتح\nثم تضاف المرقة بالتدريج مع التقليب المستمر\nويذاب اللبن البودرة والدقيق مع باقي المرقة وتكون باردة.\nويصب خليط المرقة على الدقيق والزبدة\nمع التقليب المستمر\nثم يضاف الملح والفلفل وجوزة الطيب والثوم البودرة\nويترك على النار حتى القوام المظبوط.\nبعد ذلك يضاف المشروم للبشاميل ويقلب\nثم يضاف الدجاج ويقلب في الصوص\nويضاف قليل من الجبنة للصوص.\nبودرة الثوم رائحتها اقوى من بودرة البصل\nلذا كميتها بتكون أقل ويمكن إضافة بصلة مبشورة ويتم تحميرها مع الحشوة\nولكن بيكون القوام مرملا أكثر.\nلإنهاء وصفة النجرسكو اللايت\nندهن وعاء بايركس الفرن بالزيت\nوتوضع المكرونة المسلوقة (ومقلبة في ملعقة زيت)\nثم تضاف الحشوة مع الصوص\nثم تضاف القليل من الجبنة الموزاريلا على الوجه.\nونضعها في الفرن على 200 درجة حتى تصل إلى اللون الذهبي.",
                        video: "https://www.youtube.com/watch?v=DWBJcbSAf9Q",
                        categortType: 2,

                    },
                    {
                        Image: require("../img/images.jpg"),
                        name: 'فتة باللحمة المفرومة',
                        view: true,
                        time: " 25 min",
                        Elta7der: '5 min',
                        Eltahy: "20 min",
                        Elsouba: "30",
                        components: 'لحمة مفرومة\nبصل\nطماطم\nثوم\nفلفل أحمر\nكمون\nفلفل أسود\nملح',
                        Step: "'يُقلى البصل والثوم في زيت حتى يذبلان ثم يُضاف إليهم اللحمة المفرومة ويُقلى الكل. تُضاف الطماطم المقطعة إلى الخليط ويُترك لمدة 5 دقائق حتى تنضج ثم يُتبل بالكمون والفلفل الأسود والملح.'",
                        video: "https://www.youtube.com/watch?v=zhPV1SI7ukc",
                        categortType: 4,

                    },
                    {
                        Image: require("../img/15489737431619515555.jpg"),
                        name: "كفتة",
                        view: true,
                        time: " 30 min",
                        Elta7der: '10 min',
                        Eltahy: "20 min",
                        Elsouba: "50",
                        components: 'لحمة مفرومة\nبصل\nثوم\nبقدونس\nكمون\nفلفل\nملح\nطحين\nزيت',
                        Step: 'تُخلط اللحمة المفرومة مع البصل المفروم والثوم والبقدونس والكمون والفلفل والملح والطحين. تُشكل الخليط إلى كفتة وتُقلى في الزيت حتى تنضج.',
                        video: "https://www.youtube.com/watch?v=0l9HiHwM5Vc",
                        categortType: 4,

                    },
                    {
                        Image: require("../img/download(1).jpg"),
                        name: "طاجن مكرونة بالكبدة",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: '½ ك كبدة مقطعة ومحمره\nمعلقة سمنة\nمعلقة ملح شطة بهارات\nبصلة مقطعة\n2 قرن فلفل مقطع\n½ مكرونة مقطعة\n2 معلقة صلصة',
                        Step: "هنجيب حلة ونحط السمنة ونحط البصل ونقلب\nبعد كدة نحط الصلصة والطماطم\nوالتوابل والبهارات ونسيبة تسبك\nهنجيب الطاجن ونحط الكبدة ونحط المكرونة ونحط الفلفل\nونحط التسبيك وندخلة الفرن",
                        video: "https://www.youtube.com/watch?v=_Mn_V9atVCM",
                        categortType: 2,

                    }
                    ,
                    {
                        Image: require("../img/kepdaaaa.jpg"),
                        name: "كبده اسكندراني",
                        view: true,
                        time: " 30 min",
                        Elta7der: '10 min',
                        Eltahy: "20 min",
                        Elsouba: "30",
                        components: 'كبده بلد\nيثوم مفروم\nعصير ليمون\n2 معلقه خل\nملح وفلفل\nكمون\nشطه',
                        Step: "حطيت كل التوابل مع بعض وسبتها لحد ما حضرت الكبده\nمقطعة الكبده وضيفتهم سبتهم حوالي ربع ساعة وفي طاسه تيفال فيها حوالي 2 ملعقة كبيره زيت سخن نزل بالكبده وسبتها على النار 10 دقائق ونزلت عليها بالفلفل الاخضر وقلبتها وقفلت النار",
                        video: "https://www.youtube.com/watch?v=J84l8JxnTW0",
                        categortType: 4,

                    }
                    ,
                    {
                        Image: require("../img/okra-1400x788.jpg"),
                        name: "البامية",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "60",
                        components: '2 ملعقة كبيرة زيت زيتون\n1 حبة بصل مفرومة\n2 فص ثوم مهروس\n200 غرام بامية\nرشة ملح\nرشة فلفل حار\nرشة فلفل أسود\nرشة بابريكا\n1 ملعقة كبيرة معجون طماطم\n½ كوب ماء\n¼ كوب عصير ليمون حامض\nكزبرة خضراء للزينة',
                        Step: "سخني الزيت في قدر على نار متوسطة. أضيفي البصل وحمريه لمدة 10 دقائق حتى يصبح لونه ذهبيا.أضيفي الثوم وحمريه لمدة دقيقة ثم أضيفي البامية وحركيها باستمرار.\nامزجي معجون الطماطم مع نصف كوب ماء\nوقلّبي المزيج جيدا.\nأضيفي الملح\nالفلفل الحار\nالفلفل والبابريكا إلى الصلصة وقلّبي المزيج.\nأضيفي مزيج الصلصة إلى القدر.\nغطّي القدر واتركيه على نار هادئة لمدة 30 دقيقة مع التقليب كل 5 دقائق",
                        video: "https://www.youtube.com/watch?v=ls1nodywhuA",
                        categortType: 4,

                    }
                    ,
                    {
                        Image: require("../img/kkkk.jpg"),
                        name: "فطيرة الدجاج",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "70",
                        components: 'زيت الزيتون للقلي\n1 بصل مقطع شرائح\n2 فص ثوم مفروم\n3 كوب صدر دجاج مطبوخ ومقطع شرائح\n1 كوب معجون طماطم\nملح حسب الذوق\nفلفل أسود حسب الذوق\nبقدونس مفروم حسب الذوق\n2 كوب حليب\n1 كوب زيت\n2 ملعقة كبيرة زبدة\n5 بيضات\n2 بطاطس مطهية\nمهروسة\n2 كوب دقيق قمح\n1 ملعقة كبيرة بايكينج باودر\n1 كوب جبن كريمي برازيلي\n½ 1 كوب جبن موزاريلا',
                        Step: "في مقلاة\nحمري البصل والثوم\nثم أضيفي الدجاج واطهيه حتى يصبح ذهبي اللون.\nأضيفي معجون الطماطم ثم تبليه بالملح\nالفلفل والبقدونس المفروم. اتركي المزيج جانبا.\nفي الخلاط\nاخفقي الحليب مع الزيت\nالزبدة\nالبيض والبطاطس المهروسة. انقلي الخليط إلى وعاء ثم أضيفي دقيق القمح والبايكينج باودر مع رشة من الملح.\nاسكبي نصف العجين في صحن فرن مدهون بالزبدة\nثم وزعي خليط الدجاج فوقه بالتساوي باستخدام ملعقة\nثم أضيفي الجبن الكريمي وجبن الموزاريلا.\nغطي الحشو بالعجين المتبقي ثم اخبزي الفطيرة في فرن مسخّن مسبقا بدرجة حرارة 350 درجة فهرنهايت لمدة 30 دقيقة.",
                        video: "https://www.youtube.com/watch?v=QptPLrcVXcM",
                        categortType: 1,

                    }
                    ,
                    {
                        Image: require("../img/download(2).jpg"),
                        name: " كفتة الارز",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: '¾ كوب لحم عجل مفروم\n¾ كوب أرز مطحون\n2 بندورة\n1 بصل\n2 بطاطس\n1 ملعقة كبيرة بقدونس\n2 ملعقة كبيرة رب بندورة (معجون طماطم)\n¾ كوب زيت نباتي\n1 ملعقة صغيرة قرفة\n1 ملعقة صغيرة بهار حلو\n1 ملعقة صغيرة جوزة الطيب\n1 ملعقة صغيرة كمون\n1 ملعقة صغيرة ملح\n6 فص ثوم\n1 مكعب مرق دجاج\n½1 كوب ماء',
                        Step: "قطّعي المكونات.ضعي ½ كمية كل من (البصل\nالبقدونس\nالثوم) وعليهم أضيفي الطحين\nالتوابل ثم قومي بالخلط.\nشكّلي اللحم على شكل أصابع وضعيهم بصحن مدهون بالزيت.\nفي مقلاة سخّني الزيت ثم قلي أصابع الكفتة من كل الجهات.\nارفعيهم من على النار.\nفي وعاء سخّني ملعقتين زيت ثم أضيفي باقي البصل والثوم وقومي بالتقليب.\nأضيفي الطماطم وبعد أن تنهرس الطماطم أضيفي مكعبات البطاطس ومعجون الطماطم مع الماء\nمرق الدجاج والكفتة اتركيهم حتى تنضج البطاطس بالكامل.\nارفعي الوعاء من النار وزيّني الصحن بالبقدونس عند التقديم",
                        video: "https://www.youtube.com/watch?v=t2xL-EKSiQU",
                        categortType: 4,

                    },
                  
                    {
                        Image: require("../img/0Hawawshi.jpg"),
                        name: "الحواوشي",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: '½ كيلو لحم مفروم\n250 غ دهن خروف\nبصلة وسط مفرومة ناعم\n2 فلفل اخضر\nرشة ملح\nرشة كمون\nرشة فلفل اسود\n2 حبهان\n¼ كوب زيت\n2 فلفل اخضر\n5 أرغفة خبز',
                        Step: "افرمي البصل ناعما جدا و اتركيه جانبا فى وعاء عميق\nقطعى الفلفل قصطع صغيرة و ضيفيه بالوعاء على البصل\nضيفى الملح و الكمون و الحبهان و الفلفل\nضيفى اللحم المفروم و قومى برش قطعة من دهن الخروف على الخليط\nقومى بالتقليب و الخلط جيدا لتمتزج كل المكونات معا\nدخلى الوعاء الثلاجة لمدة ساعة\nاحضرى الخبز بعد مرور الساعة و اصنعى فى كل خبز من الجانب فتحة صغيرة ادخلى من خلالها الحشو و افرديه داخل الرغيف\nكررى الامر مع كل الارغفة الحشو .\nادهنى الخبز من اعلى و من اسفل بالزيت\nسخنى الفرن جيدا على نار متوسطة\nرصى الخبز فى صينية و ادخليها الفرن على الشبكة و اتركيه حتى تمام النضج (من ربع لتلت ساعة) .\nيقدم الحواوشي ساخنا ",
                        video: "https://www.youtube.com/watch?v=iT0BPY3H-A0",
                        categortType: 1,

                    },
                    {
                        Image: require("../img/5f0865f6dccdc.jpg"),
                        name: "الكابتشينو",
                        Elta7der: '5 min',
                        Eltahy: "15 min",
                        Elsouba: "25",
                        components: "¼ كوب (37.5 جم) قهوة سريعة الذوبان\n. ¼ كوب (50 جم) سكر\n. 3 ملاعق كبيرة (45 مل) ماء.\nكوب (250 مل) حليب خالي الدسم\n. كاكاو وقرفة للزينة",
                        view: true,
                        Step: "ضعي السكر والقهوة والماء في وعاء كبير\nواخفقيها بالمضرب اليدوي لمدة ثلاث إلى خمس دقائق\nحتى يتكون لديكِ خليط ناعم كالكريمة\n. ضعي الحليب على نار متوسطة\nواخفقيه باستمرار حتى يغلي\nوتتكون لديكِ رغوة كثيفة. وزعي الكابتشينو على كوبين\nثم وزعي الحليب بالرغوة الخاصة به\nوقلبيه برفق حتى تمتزج المكونات\nثم قدميه. زيني الكابتشينو ببودرة الكاكاو والقرفة",
                        time: "20 min",
                        categortType: 1,
                        video: "https://www.youtube.com/watch?v=hiUSTyAeTSI"
                    },
                    {
                        Image: require("../img/3eeegga.jpg"),
                        name: "عجة البيض",
                        view: true,
                        time: " 20 min",
                        Elta7der: '5 min',
                        Eltahy: "15 min",
                        Elsouba: "20",
                        components: '4 بيضات\nرشة ملح\nرشة بقدونس5 ملعقة كبيرة زيت أو زبدة\n1 مكعب مرق دجاج\n1 ملعقة صغيرة فلفل أسود\nرشة نعناع\n¼ كوب بصل أخضر مفروم فرما ناعما\n2 حبة فلفل حلو مفرومة فرما ناعما',
                        Step: "فى مقلاة غير لاصقة على النار\nذوبى الزبدة ثم أضيفى الخضار بعد تقطيعه ومكعب مرق الدجاج\nقلبي المزيج.\nأضيفي الفلفل الاسود وقومي بتغطية المقلاة\nاستمري في الطهي على نار هادئة لمدة 5-10 دقائق مع التحريك من حين لآخر حتى تنضج الخضروات على البخار.",
                        video: "https://www.youtube.com/watch?v=rPQN7xjy7Yw",
                        categortType: 4,

                    }
                    ,
                    {
                        Image: require("../img/download(3).jpg"),
                        name: "فطيرة مشلتت",
                        view: true,
                        time: " 50 min",
                        Elta7der: '30 min',
                        Eltahy: "20 min",
                        Elsouba: "70",
                        components: '1 كيلو دقيق\n1 كوب سكر\n1 كوب ماء\n½ كيلو زبدة\n1 ملعقة صغيرة بايكينج باودر',
                        Step: "احضري وعاء وضعي السكر\nالدقيق معا.قطّعي الزبدة قطع صغيرة واضيفيها إلى خليط الدقيق واعجنيهم بأطراف أصابعك حتى تتكون عجينة يابسة.\nضعي العجينة في مكان مرشوش بالدقيق وافرديها بالنشابة حتى تصبح بعرض ½ سم\nرشّيها بالماء بين الحين والآخر حتى لا تلتصق بالسطح.\nقطّعي العجينة لعدة قطع متساوية\nافردي كل قطعة حتى تصبح رقيقة جدا.\nكرّري العملية حتى نفاذ القطع.\nاحضري صينية دائرية مدهونة بالزبدة وضعي قطعة من العجين المفرود في الصينية ثم ادهنيها بالزبدة ثم ضعي قطعة اخرى وادهنيها بالزبدة\nوهكذا حتى تنتهي الكمية.\nاخبزيها في الفرن على درجة حرارة 180 درجة حتى يحمر ثم قدميه ساخنا.",
                        video: "https://www.youtube.com/watch?v=a4sBaw0Xrbo",
                        categortType: 7,

                    }
                    ,
                    {
                        Image: require("../img/kapapshamii.jpg"),
                        name: "كباب شامي",
                        view: true,
                        time: " 45 min",
                        Elta7der: '25 min',
                        Eltahy: "20 min",
                        Elsouba: "30",
                        components: 'حبة بصل مبروشة\n300 غ لحمة مفرومة\n½ كوب كزبرة\n½ ملعقة صغيرة بهار كاري\n½ ملعقة صغيرة قرفة\nبيضة\n½ كوب طحين\nبهار أسود حسب الرغبة\nملح حسب الرغبة\nزيت نباتي\n⅔ كوب عصير ليمون حامض\n2 فص ثوم',
                        Step: "1.في صحن ضعي كل المقادير (ماعدا الزيت\nالثوم\nوعصير الليمون) وقومي بالخلط.\n2.شكّلي الخليط كما بالفيديو وضعيهم بصحن.\n3.أدخلي الصحن الثلاجة لمدة 20 دقيقة.\n4.في مقلاة على النار سخّني الزيت ثم قلّي الكباب.\n5.في مقلاة أخرى ضعي عصير الليمون الحامض والثوم وقومي التقليب.\n6.أضيفي الكباب بالمقلاة وقومي بالتحريك.",
                        video: "https://www.youtube.com/watch?v=pUadgLI9tb0",
                        categortType: 5,

                    }
                    ,
                    {
                        Image: require("../img/0Garlic.lemon.steak.jpg"),
                        name: " اللحم بالثوم والليمون",
                        view: true,
                        time: " 70 min",
                        Elta7der: '30 min',
                        Eltahy: "40 min",
                        Elsouba: "70",
                        components: '400 غ لحم مقطع\n½ ملعقة صغيرة بهار أسود\n½ ملعقة صغيرة زنجبيل\n½ ملعقة صغيرة بودرة ثوم\n½ ملعقة صغيرة بهار تشيلي\nرشة ملح\nملعقة كبيرة زيت زيتون\n3 ملاعق كبيرة طحين\n2 فص ثوم\nملعقة كبيرة خل التفاح\nكوب مرق اللحم\n3 ملاعق كبيرة عصير ليمون حامض\n3 ملاعق كبيرة بقدونس\nحبة بصل مقطعة',
                        Step: "1.ضعي اللحم بصحن غويط.\n2.تبّليه بالبهار الأسود\nبهار تشيلي\nزنجبيل\nبودرة الثوم\nالملح\nوزيت الزيتون ثم قومي بالتقليب.\n3.أضيفي الطحين\nوقومي بإعادة التقليب.\n4.في مقلاة على النار ضعي زيت الزيتون.\n5.أضيفي اللحم وقومي بالتقليب حتى يتغير لونه.\n6.أضيفي الثوم وقومي بالتحريك.\n7.أضيفي خل التفاح\nمرق اللحم\nعصير الليمون الحامض واستمري بالتحريك.\n8.أضيفي البقدونس وقومي بالتقليب.\n9.ارفعي المقلاة من على النار بعد تمام نضج اللحم.\n10.في مقلاة أخرى على النار سخّني الزيت ثم ضعي البصل وقومي بالتقليب حتى يتغير لونه.\n11.زيّني وجه اللحم بشرائح البصل التي حضرتيها.\n12.قدميها ساخنة.",
                        video: "https://www.youtube.com/watch?v=EFu7QZG-luI",
                        categortType: 5,

                    }
                    ,
                    {
                        Image: require("../img/maxresdefault-1-22.jpg"),
                        name: "كبة اللحم بالبرغل",
                        view: true,
                        time: " 80 min",
                        Elta7der: '30 min',
                        Eltahy: "50 min",
                        Elsouba: "70",
                        components: '1 كيلو لحم مفروم\n1 بصلة مفرومة\n1 ملعقة بهارات\n1 ملعقة ملح\n1 ملعقة فلفل\n2 كوب برغل ناعم\n1 ملعقة كمون\n2 ملعقة معجون فلفل أحمر\n2 ملعقة صنوبر مطحون\nزيت للقلي',
                        Step: "احضري وعاء واخلطي البرغل مع اللحم\nالملح\nالفلفل\nالبهارات\nالبصل\nالكمون\nالصنوبر ومعجون الفلفل الأحمر.\nشكّلي الخليط على شكل كرات ثم قلّيها في الزيت حتى تصبح بنية اللون.\nقدميها ساخنة.",
                        video: "https://www.youtube.com/watch?v=gZx3iqpAbN8",
                        categortType: 5,

                    },
                    {
                        Image: require("../img/coklemone.jpg"),
                        name: "عصير ليمون",
                        view: true,
                        time: "15 min",
                        Elta7der: '5 min',
                        Eltahy: "10 min",
                        Elsouba: "10",
                        components: "2 ليمون كبير\nماء\n2 معلقه سكر\nحفنه نعناع\nثلج\nماء بارد",
                        Step: "نقوم بعصر كمية من نعصر الليمون ثم نصب عصيره ف الخلاط\nنضع مقدار النعناع والسكر والماء البارد ونخلط ف الخلاط ثم نصب ف الكاس مع الثلج",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=g0KnsicH7kU"

                    },
                    {
                        Image: require("../img/lemonandkewe.jpeg"),
                        name: "عصير الكيوي و التوت والليمون",
                        Elta7der: '5 min',
                        Eltahy: "10 min",
                        Elsouba: "15",
                        components: "كوبين عصير كيوي بالليمون\nكوب عصير ليمون\nتوت اسود الكمية حسب الرغبه",
                        view: true,
                        Step: "نخلط جميع المكونات ونقدمها ونزينها بالليمون و النعناع و التوت",
                        time: "15 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=3UwC4xNvk68"


                    },
                    {
                        Image: require("../img/greepfrot.jpeg"),
                        name: "عصير الجريب فروت مع البرتقال و الليمون",
                        Elta7der: '5 min',
                        Eltahy: "15 min",
                        Elsouba: "20",
                        components: "حبة جريب فروت\nحبة برتقال\n½ حبة ليمون اصفر\n½ حبة ليمون اخضر (ممكن الاستغناء عنة)\nسكر حسب الرغبة (انا ما استعملت السكر)",
                        view: true,
                        Step: "في عصارة البرتقال قومي بعصر جميع المكونات. صبي الخليط في اكواب التقديم و اضيفي السكر الي الاكواب حسب الرغبة و حركي جيدا. يقدم وبالف هنا و شفا",
                        time: "15 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=4N8CVW2LcNA"


                    },
                    {
                        Image: require("../img/lemonandganzabl.jpeg"),
                        name: "عصير الليمون بالزنجبيل 'الصحي'",
                        Elta7der: '5 min',
                        Eltahy: "10 min",
                        Elsouba: "25",
                        components: "3 حبات ليمون أخضر متوسطة الحجم\n1/4 كوب زنجبيل طازج مبشور\nكوب ماء بارد",
                        view: true,
                        Step: "اضف الماء و معلقه ملح اضف الماء و معلقه ملح اضف الماء و نقشر الليمون و نقطعه بالنص و نستخرج البذور\nو نبشر الزنجبيل بعدها نضع كل المكونات بالخلاط ونخلطها لمدة خمس دقائق",
                        time: "15 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=8TIfFbO-5lI"


                    },
                    {
                        Image: require("../img/lemonandorange.jpeg"),
                        name: "عصير البرتقال والليمون",
                        Elta7der: '5 min',
                        Eltahy: "20 min",
                        Elsouba: "25",
                        components: "2 حبة برتقال\n2 حبة ليمون\n1 كوب سكر",
                        view: true,
                        Step: "نقشر حبات الليمون والبرتقال\nتقطع وتزال البذور\nتخلط في الخلاط الكهربائي ثم تصفى\nيعاد العصير الى الخلاط مع مكعبات الثلج\nتصب في اكواب التقديم ويقدم بارد",
                        time: "25 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=lBu65ME2WmQ"


                    },
                    {
                        Image: require("../img/sahlab.jpeg"),
                        name: "سحلب",
                        Elta7der: '5 min',
                        Eltahy: "10 min",
                        Elsouba: "70",
                        components: "1/2 لتر حليب\n5 ملاعق بودرة سحلب\nملعقة سكر",
                        view: true,
                        Step: "اضف الماء و معلقه ملح اضف الماء و معلقه ملح اضف الماء و بريق يوضع فيه الحليب وهو بارد ثم يضاف السحلب ويحرك ثم يوضع السكر\nنولع عليه النار هادئة مع التحريك لمدة 10 دقائق حتى يثقل قليلا\nيوضع في كاس ويزين بالقرفه والفستق وبالعافيه",
                        time: "15 min",
                        categortType: 1,
                        video: "https://www.youtube.com/watch?v=fBSsdfLotpE"
                    },
                    {
                        Image: require("../img/88.jpeg"),
                        name: "هوت شوكلت",
                        Elta7der: '5 min',
                        Eltahy: "20 min",
                        Elsouba: "50",
                        components: "3/4 كوب شوكولاتة بودرة\n4 اكواب حليب سائل\n1 كوب سكر\nملعقة صغيرة نشاء ذرة",
                        view: true,
                        Step: "اضف الماء و معلقه ملح اضف الماء و معلقه ملح اضف الماء و توضع جميع المكونات في قدر على نار هادئة مع التقليب المستمر لكي لاتحترق الى ان تبدأ بالغليان",
                        time: "25 min",
                        categortType: 1,
                        video: "https://www.youtube.com/watch?v=38xZdDygW04"


                    },
                    {
                        Image: require("../img/55.jpeg"),
                        name: "عصير فراولة و توت ",
                        Elta7der: '5 min',
                        Eltahy: "10 min",
                        Elsouba: "25",
                        components: "1 كوب فراولة مجمده\n1/2 كوب توت مجمد\n1/2 كوب سكر\n1 كوب ماء ",
                        view: true,
                        Step: "في الخلاط : نخلط جميع المكونات ",
                        time: "15 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=4uKOb4OFrVE"
                    },
                    {
                        Image: require("../img/555.jpeg"),
                        name: "سموزي الفرااوله",
                        Elta7der: '5 min',
                        Eltahy: "20 min",
                        Elsouba: "30",
                        components: "كيس فراوله مجمدة\nظرف كريم شانتيه\nسكر حسب الرغبة\nفانيليا\nحليب",
                        view: true,
                        Step: "نخلطهم في الخلاط ونستمتع بأحلى فراوله واذا حابنو يكون تقيل نضيف مكعبات ثلج ونخلطه",
                        time: "15 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=r3Ycl293l_U"
                    },
                    {
                        Image: require("../img/tamr.jpeg"),
                        name: "مشروب التمر والحليب",
                        Elta7der: '5 min',
                        Eltahy: "10 min",
                        Elsouba: "10",
                        components: "10 حبات تمر\nكوبين حليب\nسكر\nحبة موز",
                        view: true,
                        Step: "ناتي بالخلاط الكهربائي نضع الموز التمر والحليب سكر ونخلط جيد",
                        time: "15 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=pvYp6JmpP78"
                    },
                    {
                        Image: require("../img/sa.jpeg"),
                        name: "مشروب السّحلب الشتوي",
                        Elta7der: '5 min',
                        Eltahy: "15 min",
                        Elsouba: "50",
                        components: "1 كوب ماء\n3 م حليب بودرة\n2 م نشا\n2 م سكر\n1 م ص فانليا\n1 م ص قرفة\n1 م مكسرات مجروشة\n1 م ص جوز الهند",
                        view: true,
                        Step: "نضع الحليب والسكر والنشا في إناء ونحرّك جيّدا.\nيرفع على النار مع التحريك بين فترة وإخرى ويترك على النار حتى يتكثف المزيج.\nيصب في أكواب التقديم ويزيّن بالقرفة والمكسرات وجوز الهند.",
                        time: "20 min",
                        categortType: 1,
                        video: "https://www.youtube.com/watch?v=CgUTsEiF824"
                    },
                    {
                        Image: require("../img/ddh.jpeg"),
                        name: "مشروب الزنجبيل بالزعفران",
                        Elta7der: '5 min',
                        Eltahy: "10 min",
                        Elsouba: "40",
                        components: "ملعقة صغيرة زنجبيل مطحون\nسكر حسب الرغبة\nكمشة زعفران\nربع علبة حليب سائل مبخر\nلتر ماء مغلي",
                        view: true,
                        Step: "نضع الحليب والسكر والنشا في إناء ونحرّك نضع كل المقادير في براد الشاي\nنصب فوقها الماء المغلي ونتركها خمس دقائق وبالعافية",
                        time: "15 min",
                        categortType: 1,
                        video: "https://www.youtube.com/watch?v=N2XhBxidLjo"
                    },
                    {
                        Image: require("../img/dddh.jpeg"),
                        name: "موهيتو السڤن اب",
                        Elta7der: '5 min',
                        Eltahy: "5 min",
                        Elsouba: "10",
                        components: "ملعقة صغيرة زنجبيل علبة سڤن اب\nتوت مشكل حسب الرغبة\n2 نعناع طازج\nمكعبات ثلج\nنكهة حسب الرغبة\nفراولة مقطعة",
                        view: true,
                        Step: "بالكاس ثلج و نكهة\nنضيف النعناع و التوت\nنضع السڤن اب و نقدمه بااارد",
                        time: "10 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=2t1IXAe4li4"
                    },
                    {
                        Image: require("../img/ffth.jpeg"),
                        name: "عصير التفاح والكيوي والموز والعنب",
                        Elta7der: '10 min',
                        Eltahy: "10 min",
                        Elsouba: "40",
                        components: "1 تفاح اخضر\n1 موز\n1 كيوي\n½ كوب من العنب اخضر\n1 كوب من الحليب الطازج\n1 ملعقه من العسل",
                        view: true,
                        Step: "اول نقطلع التفاح ونقطع الموز ونقطع الكيوي انضيفهم في الخلاط\nانضيف 1كوب الحليب طازج انضيف 1ملعقه العسل وانخلطه في امكانك تضيفي الماء ان حبيتي وايقدم بارد في العافية",
                        time: "20 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=SXPOHoGuU5Y"
                    },
                    {
                        Image: require("../img/dgkth.jpeg"),
                        name: "عصير افوكادو",
                        Elta7der: '5 min',
                        Eltahy: "10 min",
                        Elsouba: "25",
                        components: "2 حبات افوكادو\n2 حبات موز\nكاستين حليب\nعسل على الحسب تحلية\nثلج",
                        view: true,
                        Step: "في الخلاط أضيف جميع المكونات واخلطهم جيدا واصب على الكاسات وتقدم بالهناء والشفاء ",
                        time: "15 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=UbvKV3SACe4"
                    },
                    {
                        Image: require("../img/ddddddth.jpeg"),
                        name: "عصير البطيخ",
                        Elta7der: '5 min',
                        Eltahy: "5 min",
                        Elsouba: "20",
                        components: "1/2 بطيخه\nكوب ثلج",
                        view: true,
                        Step: "نخلص البطيخ في الخلاط\nنضعه الثلج في الاكواب ونضيف عصير البطيخ عليه",
                        time: "10 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=ZYoh_n549y0"
                    },
                    {
                        Image: require("../img/flkfoth.jpeg"),
                        name: "عصير الرمان والتوت ",
                        Elta7der: '5 min',
                        Eltahy: "10 min",
                        Elsouba: "25",
                        components: "2 حبة من الرمان\n1/2 كاس من التوت او عصير توت\nماء بارد\n2 ظرف سكر سيتفيا\n1 ملعقة كبيره ماء الورد او الزهر",
                        view: true,
                        Step: "اول نقشر الرمان ونشيل الحبوب وانضيف في الخلاط انضيف حبات توت نص كوب وانضيف الماء بارد\nانضيف السكر 2ظرف ستيفيا و1ملعقة ماء الورد او الزهر بمكانكم تضيفون السكر العادي حبيت يكون العصير الصحي وانصفيه ويكون بارد ",
                        time: "15 min",
                        categortType: 2,
                        video: "https://www.youtube.com/shorts/12m0aMEPYnI"
                    },
                    {
                        Image: require("../img/6545th.jpeg"),
                        name: "مشروب الكركديه",
                        Elta7der: '5 min',
                        Eltahy: "10 min",
                        Elsouba: "60",
                        components: "كوب ونصف من زهورات الكركديه\nكوب سكر\nملعقه ماء الورد\nليتر ماء ساخن للنقع\nعند التقديم\nمكعبات ثلج وبعض الزهورات المغسوله\nمكعبات ثلج",
                        view: true,
                        Step: "تغسل زهورات الكركديه لازالة الاتربه ونحضر باقي المكونات ونضع زهورات الكركديه المغسوله بوعاء ونضع عليها السكر وماء الورد\nنصب عليها لتر ماء مغلي وننقعها ساعتين ونضعها بالثلاج احط منه مكعبات ابرزها في الفريزر عشان تكون مكعبات ثلج استخدمها اثناء التقديم واطلع الكركديه من الثلاجه واصفيه واضع مكعبات الثلج في كاس التقديم واسكب عليها مشروب الكركديه",
                        time: "15 min",
                        categortType: 1,
                        video: "https://www.youtube.com/watch?v=GnzaI9oXVLQ"
                    },
                    {
                        Image: require("../img/dsdth.jpeg"),
                        name: "عصير موز بالفرولة",
                        Elta7der: '5 min',
                        Eltahy: "15 min",
                        Elsouba: "20",
                        components: "6 حبات فراولة\n2 حبة موز\nكوب حليب\nثلج مجروش\n2 م ك ايسكريم ڤانيلا\nعسل او سكر حسب الرغبة",
                        view: true,
                        Step: "اخلط جميع المكونات في الخلاط واقدمه باكواب وبالعافية",
                        time: "20 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=xOkfvKtvPdY"
                    },
                    {
                        Image: require("../img/xxth.jpeg"),
                        name: "عصير التين الشوكي والفراولة",
                        Elta7der: '5 min',
                        Eltahy: "15 min",
                        Elsouba: "40",
                        components: "5 حبات تين الشوكي\n2 م سكر\n6 حبات فراولة\n1 م عصير ليمون\n5 مكعبات ثلج",
                        view: true,
                        Step: "تقشر حبة التين وتعصر في تلخلاط الكهربائيوتصقى من البذور ويعاد في الخلاط\nيضاف الفراولة والسكر والثلج وتعصر معا",
                        time: "20 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=xdA88hQZ3Mc"
                    },
                    {
                        Image: require("../img/vvth.jpeg"),
                        name: "موهيتو الفراولة",
                        Elta7der: '5 min',
                        Eltahy: "15 min",
                        Elsouba: "40",
                        components: "100 جرام فراولة مجمده او طازجة و يفضل طازجه\n1/4 حزمه نعناع\nليمونه مقطعه ارباع\nسيروب الفراولة او نكهة فراوله او فيمتو\nسفن اب او مياه معدنيه\nملعقة سكر",
                        view: true,
                        Step: "نضع الفراوله مع النعناع مع الليمون مع السكر في هاون و نقوم بهرسهم مع بعض حتى تنزل موية الفراوله مع الليمون و النعناع\nنضع في جك العصير. سيروب الفراوله. مع مكونات الخطوه الاولى كاملة\nونضع عليها المياه المعدنيه. او سفن اب حسب الكميه المرغوب فيها و بالعافيه.",
                        time: "20 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=43MyQOYyofs"
                    },
                    {
                        Image: require("../img/txch.jpeg"),
                        name: "عصير مانجا",
                        Elta7der: '5 min',
                        Eltahy: "15 min",
                        Elsouba: "25",
                        components: "3 حبات من ثمرة المانجو\nكوب ماء\nسكر او عسل حسب الرغبة",
                        view: true,
                        Step: "جميع المكونات في الخلاط وبالعافية",
                        time: "20 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=NVDt5Mb77Mw"
                    },
                    {
                        Image: require("../img/ddssth.jpeg"),
                        name: "عصير الافوكادو والمانجا",
                        Elta7der: '5 min',
                        Eltahy: "15 min",
                        Elsouba: "25",
                        components: "1 افوكادو\n1 مانجا\nربع كوب لوز\nملعقتين عسل\n3 اكواب حليب",
                        view: true,
                        Step: "نقطع الفواكه\nنضيف جميع المكونات و نخلط و يقدم باردا و بالعافية",
                        time: "20 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=Y2azMnxKDnI"
                    },
                    {
                        Image: require("../img/tdvh.jpeg"),
                        name: "عصير المانجا والفراولة",
                        Elta7der: '5 min',
                        Eltahy: "15 min",
                        Elsouba: "25",
                        components: "كوبين فراولة مجمدة مقطعة\nكوب مانجا مجمدة\n1/3 كوب عصير البرتقال",
                        view: true,
                        Step: "تُخلط جميع المكونات في الخلاط ثم تُقدم في كأس وبالعافية مقدما ",
                        time: "20 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=9ePJjmJdVNg"
                    },
                    {
                        Image: require("../img/bdcxvth.jpeg"),
                        name: "عصير مانجا وجوافه",
                        Elta7der: '5 min',
                        Eltahy: "15 min",
                        Elsouba: "25",
                        components: "3 مانجو زاكيه\n3 جوافه\n١ افوكادو مستويه\n2 كاس حليب\n1 كاس ماء\n1 ظريف كريم شانتيه(دريم ويب)\nسكر حسب الرغبه",
                        view: true,
                        Step: "نخلط جميع المكونات بالخلاط ونتحكم بسمك العصير اذا تحبوا اخف زيدوا ماء ونصفيه جيدا من بذور الجوافه\nيوضع بالثلاجه لوقت التقديم. وبالعااافيه",
                        time: "20 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=KiRJHtwGez8"
                    },
                    {
                        Image: require("../img/tvvvvh.jpeg"),
                        name: "هوت شوكلت الاوريو",
                        Elta7der: '5 min',
                        Eltahy: "15 min",
                        Elsouba: "25",
                        components: "كوب ونص حليب\nمغلف اوريو مكسر فيه 4 حبات\nملعقة اكل شوكولاته بالجيكيه او جالكسي او نوتيلا او نسكويك حسب المتوفر\nملعقه صغيرة نسكافيه",
                        view: true,
                        Step: "نخلط جميع المقادير\nنضعها على النار مع التحريك المستمر لحد مايثقل قوامها ونقدمها",
                        time: "20 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=8TpU14ll1I8"
                    },
                    
                    {
                        Image: require("../img/5f086508b8d56.jpg"),
                        name: "القهوة التركي بالشوكولاتة",
                        Elta7der: '5 min',
                        Eltahy: "15 min",
                        Elsouba: "40",
                        components: "⅔ كوب (166.6 مل) ماء\n. ½ 1 ملعقة كبيرة (15 جم) قهوة تركي\n. ملعقة صغيرة (5 جم) كاكاو\n. ملعقة صغيرة (5 جم) شوكولاتة مبشورة\n. سكر حسب الرغبة",
                        view: true,
                        Step: "ضعي الماء والقهوة والكاكاو والسكر والشوكولاتة في كنكة (ركوة)\nوقلبي المكونات حتى تذوب\n. ضعي القهوة على نار هادئة\nحتى تقترب من الغليان\n. ارفعي القهوة عن النار حتى تهدأ قليلًا\nثم أعيديها مرة أخرى حتى تظهر فقاعات على أطراف الكنكة\nويصبح لها وجه\n. ارفعي القهوة عن النار\nوصبيها في الفناجين\nوقدميها ساخنة",
                        time: "20 min",
                        categortType: 1,
                        video: "https://www.youtube.com/watch?v=zftgNcNZpgA"
                    },
                                {
                        categortType: 4,
                        Image: require("../img/884972e5a924823e4c6fa80c6b6ddf3b_w750_h500.jpg"),
                        name: "كنافة بالمانجو",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "50",
                        components: "- الكنافة : 500 غراما\n- شيرة : كوب\n- سمن : 500 غراما (مذوب)\n- عصير المانغو : 3 اكواب\n- كريمة : 3 اكواب (مخفوقة)\n- مانغو : 4 حبات (مقشرة ومقطعة مكعبات)",
                        view: true,
                        Step: "1. اخلطي عجينة الكنافة مع السمن المذوب جيدا ثم افردي الكنافة في الصينية وأدخليها الفرن على حرارة 180 درجة لمدة 20 دقيقة حتى تتحمص.\n2. ازيلي الكنافة من الفرن وقطعيها باليد حتى تصبح مفتتة.\n3. ضعي في طبق زجاجي عميق للتقديم طبقة من الكنافة المفتتة.\n4. أضيفي عصير المانجو وكمية من الكريمة المخفوقة وكمية من المانجو.\n5. ضعي فوقها طبقة من الكنافة وأعيدي الكرة لعمل طبقتين أو ثلاث حسب الرغبة.\n6. أدخلي الطبق للثلاجة لحين التقديم.",
                        time: "40 min",
                        video: "https://www.youtube.com/watch?v=D-UjCw-tmCs"
                    },
                    
                    {
                        Image: require("../img/5f0867c5bc87c.jpg"),
                        name: "اللاتيه",
                        Elta7der: '5 min',
                        Eltahy: "15 min",
                        Elsouba: "25",
                        components: "¼ كوب (37.5 جم) قهوة سريعة الذوبان\n. ¾ كوب (180 مل) ماء\n. ¾ كوب (180 مل) حليب",
                        view: true,
                        Step: "على نار متوسطة\nضعي القهوة والماء\nواتركيهما حتى يغلي الخليط\n. على نار متوسطة\nسخني الحليب\nوقلبي باستمرار بالمضرب اليدوي\nحتى يغلي وتتكون رغوة\n. صبي الحليب والقهوة في الأكواب بكميات متساوية\nوقدميها ساخنة مع السكر",
                        time: "20 min",
                        categortType: 1,
                        video: "https://www.youtube.com/watch?v=as0hCOWyWcs"
                    },
                    

                    //ddd
                     
                    {
                        Image: require("../img/maklopa.jpg"),
                        name: "المقلوبة",
                        view: true,
                        time: "60 min",
                        Elta7der: '15 min',
                        Eltahy: "40 min",
                        Elsouba: "30",
                        components: "2 حبة بصل مفرومة\n3 حبات طماطم مفرومة\n1 حبة فلفل أخضر مفروم\n1 كوب أرز\nملح وفلفل أسود حسب الذوق\n2 ملعقة كبيرة زيت زيتون",
                        Step: "يسخن الزيت في مقلاة كبيرة ويضاف البصل ويقلب حتى يصبح شفافا.\nيضاف الطماطم والفلفل الأخضر ويقلب لبضع دقائق.\nيضاف الأرز ويقلب جيدا حتى يتغطى بالصلصة ويتماسك.\nيضاف الماء ويترك ليغلي \nثم يخفض الحرارة ويترك ليطهو لمدة 20-25 دقيقة حتى يصبح الأرز مطهوا.\nيقدم المقلوبة ساخنة.",
                        video: "https://www.youtube.com/watch?v=1t8RsqlQd8k",
                        categortType: 3,


                    },
                    {
                        Image: require("../img/Egyptian_food_Koshary.jpg"),
                        name: "كشري",
                        view: true,
                        time: "50 min",
                        Elta7der: '10 min',
                        Eltahy: "40 min",
                        Elsouba: "20",
                        components: "2 كوب أرز\n1 كوب عدس\n1/2 كوب شعيرية مقطعة\n1 بصلة مفرومة\n3 فصوص ثوم مفرومة\nملح وفلفل حسب الذوق\nزيت للقلي",
                        Step: "يغلى العدس في ماء مملح حتى يصبح طريا ثم يصفى.\nيحمص الأرز في زيت ساخن ثم يضاف الماء والملح ويترك ليطهى حتى يصبح الأرز مطهوا.\nيقلى البصل والثوم في زيت حتى يصبحان ذهبيين ثم يضاف العدس ويترك لمدة 5 دقائق.\nتقلى الشعيرية حتى تصبح ذهبية ثم تضاف إلى الأرز وتخلط جيدا.\nيقدم الكشري ساخنا مع العدس والشعيرية المقلية والبصل والثوم.",
                        video: "https://www.youtube.com/watch?v=Jrs7KaqzYHA",
                        categortType: 4,


                    },


                    {
                        categortType: 1,
                        Image: require("../img/t2h.jpeg"),
                        name: "كوكيز بدون زبدة وسكر",
                        Elta7der: '10 min',
                        Eltahy: "40 min",
                        Elsouba: "40",
                        components: "بيضة\nفنجال او 50 مل طحينة سايلة\nملعقتين كبيرة زبدة الفول السوداني\n8 تمرات بدون نوى\nفنجال او 50 مل محلي سائل عسل او دبس\nاستخدمت شراب الأجاف agave\nرشة ملح وقرفة وهيل\nملعقة صغيرة باكنج بودر\nملعقة صغيرة باكنج صودا\nكاس شوفان مطحون\nجوز ولوز مكسر حسب الرغبة\nزبيب\nحبيبات الشوكولاتة",
                        view: true,
                        Step: "تخلط المقادير في محضرة الطعام حتى تتجانس ثم يضاف الشوفان ويخلط\nيضاف لها الزبيب والمكسرات والشوكولاتة وتقلب ويفرغ الخليط في صينية مدهونة بالطحينة وترش برقائق الملح اختياري\nيدخل فرن حار على ١٨٠ درجة مدة عشر دقائق الى ربع ساعة او حتى تستوي. تترك لتبرد ثم تقطع\nهذي حبيبات الشوكولاتة العضوية الخام المستخدمة. افضل خيار للاستمتاع بفوائد الشوكولاتة بدون اي اضافات من دهون او سكر. اخذته من لولو ماركت ويتوفر في ايهرب",
                        time: "50 min",
                        video: "https://www.youtube.com/watch?v=tarEKpgAynM"
                    },

                    {
                        categortType: 1,
                        Image: require("../img/c83cec3ab81e6701b37ed191684ffca1_w750_h500.jpg"),
                        name: "صوص الشوكولاتة السريع",
                        Elta7der: '5 min',
                        Eltahy: "20 min",
                        Elsouba: "10",
                        components: " الكاكاو : ثلثان الكوب\nالماء : كوب وربع\nسكر : كوب وثلثا الكوب\nالفانيليا : ملعقة صغيرة",
                        view: true,
                        Step: "سخني قدر متوسط على نار متوسطة\nوأضيفي الكاكاو\nوالماء\nوالسكر\nاخلطيهم معا.\nاتركي المزيج يغلي لمدة دقيقة.\nارفعي القدر عن النار\nوأضيفي الفانيليا\nثم قلبي الصوص مرة أخرى.\nقدميه مع الكيك والبسكويت. ",
                        time: "25 min",
                        video: "https://www.youtube.com/watch?v=96dxIl0IpsQ"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/b59e92dcec3a53710c6ff754f0c705d7_w750_h500.jpg"),
                        name: "كريب ريد فلفت",
                        Elta7der: '5 min',
                        Eltahy: "20 min",
                        Elsouba: "10",
                        components: "- حليب : كوب\n- سكر : 3 ملاعق كبيرة\n- دقيق : كوب\n- الزبدة : ملعقة كبيرة\n- الآيس كريم : كوب\n- الزيت النباتي : 2 ملعقة كبيرة\n- الشوكولاتة : كوب (سائلة)\n- الفانيليا : ملعقة صغيرة\n- ملون الطعام الاحمر : 2 نقطة",
                        view: true,
                        Step: "أحضري وعاء\nواخلطي البيض\nوالحليب\nوالدقيق\nوالسكر\nوملون الطعام\nوالفانيليا\nوالزبدة.\nأحضري مقلاة\nوضعي مغرفة من الخليط مع القليل من الزيت\nواقلي الكريب على الوجهين حتى ينضج.\nكرري العملية حتى انتهاء الكمية.\nاحشي الكريب بالآيس كريم\nولفيه رول\nثم زينيه بالشوكولاتة السائلة وقدميه",
                        time: "25 min",
                        video: "https://www.youtube.com/watch?v=_nui4biqXuM"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/7b463add022ac44559167d7661ecf5f8_w750_h500.jpg"),
                        name: "كريب رول بالشوكولاتة",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: "- للحشو :\nشوكولاتة نيوتيلا\nالفواكة : حسب الرغبة\n- البيض : 2 حبة\n- الفانيليا : ملعقة كبيرة (سائلة)\n- الزبدة : 2 ملعقة كبيرة\n- سكر : 2 ملعقة كبيرة\n- الزيت النباتي : ملعقة كبيرة\n- حليب : كوب\n- دقيق : 2 كوب",
                        view: true,
                        Step: " البيض والفانيلا بالمضرب اليدوي.\nأضيفي الزبدة والسكر مع الخفق بعد كل إضافة.\nإبدأي بإضافة الزيت والحليب واخفقي.\nأضيفي الدقيق للمزيج السابق واخفقي جيدا حتى تتجانس المكونات.\nقومي بتسخين مقلاة واسعة على النار وخذي مقدار من العجينة ووزعيها بالمقلاة بالتساوي واتركي العجينة حتى تنضج من الأسفل ثم اقلبيها على الوجه الآخر.\nقومي بوضع حبات الكريب الجاهز في طبق جانبي.\nكرري الخطوة السابقة حتى الانتهاء من الكمية.\nاحشي حبات الكريب بشوكولاتة النوتيلا ولفيها على شكل رولات وضعيها في طبق التقديم وزيني بالفواكة المشكلة بحسب الرغبة",
                        time: "40 min",
                        video: "https://www.youtube.com/watch?v=yk0_1lQ8HFs"
                    },
                    {
                        Image: require("../img/ddssth.jpeg"),
                        name: "عصير الافوكادو والمانجا",
                        Elta7der: '5 min',
                        Eltahy: "15 min",
                        Elsouba: "25",
                        components: "1 افوكادو\n1 مانجا\nربع كوب لوز\nملعقتين عسل\n3 اكواب حليب",
                        view: true,
                        Step: "نقطع الفواكه\nنضيف جميع المكونات و نخلط و يقدم باردا و بالعافية",
                        time: "20 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=Y2azMnxKDnI"
                    },
                    {
                        Image: require("../img/tdvh.jpeg"),
                        name: "عصير المانجا والفراولة",
                        Elta7der: '5 min',
                        Eltahy: "15 min",
                        Elsouba: "25",
                        components: "كوبين فراولة مجمدة مقطعة\nكوب مانجا مجمدة\n1/3 كوب عصير البرتقال",
                        view: true,
                        Step: "تُخلط جميع المكونات في الخلاط ثم تُقدم في كأس وبالعافية مقدما ",
                        time: "20 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=9ePJjmJdVNg"
                    },
                    {
                        Image: require("../img/bdcxvth.jpeg"),
                        name: "عصير مانجا وجوافه",
                        Elta7der: '5 min',
                        Eltahy: "15 min",
                        Elsouba: "25",
                        components: "3 مانجو زاكيه\n3 جوافه\n١ افوكادو مستويه\n2 كاس حليب\n1 كاس ماء\n1 ظريف كريم شانتيه(دريم ويب)\nسكر حسب الرغبه",
                        view: true,
                        Step: "نخلط جميع المكونات بالخلاط ونتحكم بسمك العصير اذا تحبوا اخف زيدوا ماء ونصفيه جيدا من بذور الجوافه\nيوضع بالثلاجه لوقت التقديم. وبالعااافيه",
                        time: "20 min",
                        categortType: 2,
                        video: "https://www.youtube.com/watch?v=KiRJHtwGez8"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/0849c2d982feb7746395b9aefc19ae95_w750_h500.png"),
                        name: "كريب بالنوتيلا بدون بيض",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: "- حليب : نصف كوب\n- الماء : ثلاث أرباع الكوب\n- الزبدة : 3 ملاعق كبيرة (مذابة)\n- الفانيليا : ملعقة صغيرة\n- طحين : كوب\n- سكر : ملعقة كبيرة\n- ملح : ربع ملعقة صغيرة\n- الزيت النباتي : ملعقة كبيرة\n- شوكولاتة نيوتيلا : نصف كوب\n- بندق : ربع كوب (مفروم خشن)",
                        view: true,
                        Step: "في وعاء متوسط الحجم\nضعي الحليب\nالماء\nالزبدة والفانيليا ثم اخلطي المكونات حتى تتجانس.\nاخلطي في وعاء آخر كل من الدقيق\nالسكر والملح لتتداخل المكونات جيدا.\nأضيفي مزيج الحليب إلى الخليط ثم اخفقي المكونات جيدا بواسطة خفاق يدوي حتى تحصلي على مزيج متجانس.\nغطي وعاء المزيج ثم أدخليه لمدة ساعتين إلى الثلاجة.\nحمي مقلاة غير لاصقة على النار\nاسكبي مقدار ملعقتان كبيرتان في الوسط ثم اتركي العجينة حتى تظهر فقاعات على وجهها.\nاقلبي العجينة على الجهة الثانية ثم اتركيها حتى تصبح ذهبية اللون.\nأعيدي الكرة حتى انتهاء الكمية.\nادهني الشوكولاتة النوتيلا على الكريب وزيني بالبندق وقدميه",
                        time: "40 min",
                        video: "https://www.youtube.com/watch?v=N6mV52NZwjc"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/8e4d2ffed7f9be71695ef1bcea4ce84a_w750_h500.jpg"),
                        name: "كيكة اسفنجية بالشوكولاتة بدون بيض",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "50",
                        components: "- طحين : 3 اكواب\n- سكر : 2 كوب\n- ملح : ملعقة صغيرة\n- بيكنج صودا : 2 ملعقة صغيرة\n- بودرة الكاكاو : نصف كوب\n- الزيت النباتي : ثلاث أرباع الكوب\n- الخل الأبيض : 2 ملعقة كبيرة\n- الفانيليا : 2 ملعقة صغيرة\n- ماء بارد : 2 كوب",
                        view: true,
                        Step: "انخلي الطحين في وعاء\nأضيفي الملح والكاكاو البودرة والبيكنج صودا والسكر\nأضيفي الزيت والخل والفانيلا والماء البارد واخفقي حتى تتجانس المكونات\nصبي المزيج في صينية كيك مدهونة بالزبدة ورشة طحين\nأدخلي الصينية الفرن على حرارة 175 درجة لمدة 40 دقيقة أو حتى ينضج الكيك\nأخرجي الصينية من الفرن واتركيها لمدة 10 دقائق ثم زينيها حسب الرغبة",
                        time: "1 h",
                        video: "https://www.youtube.com/watch?v=iuJysb4NzO0"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/4b30d44fc3e59d1e825b724c6047d702_w750_h500.jpg"),
                        name: "كب كيك كوكيز",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: "- طحين : كوب وثلاثة ارباع الكوب\n- ملح : نصف ملعقة صغيرة\n- بيكنج صودا : ملعقة صغيرة\n- الزبدة : نصف كوب (مذابة)\n- سكر : نصف كوب (أبيض)\n- زبدة الفول السوداني : نصف كوب\n- السكر البني : نصف كوب\n- البيض : 1 حبة (مخفوق)\n- مستخلص الفانيليا : ملعقة صغيرة\n- حليب : 2 ملعقة كبيرة",
                        view: true,
                        Step: "حمّي الفرن على درجة حرارة 180 مئوية.\nفي وعاء\nنخلّي الطحين\nوالملح\nوالبيكنج صودا\nواتركيه جانبا.\nاخفقي الزبدة مع السكر\nوزبدة الفول السوداني\nوالسكر البني\nجيدا حتى تتجانس المكونات.\nأضيفي البيض\nوالفانيليا\nوالحليب مع الخفق باستمرار.\nأضيفي خليط الطحين واستمري في الخفق.\nاصنعي من الخليط كرات متساوية في الحجم\nوضعي كل واحدة في كوب من أكواب قالب ميني مافن غير مدهون.\nاخبزي القالب في الفرن لمدة 8 دقائق.\nأخرجي القالب من الفرن\nواتركيه جانبا حتى يبرد ثم قدميه",
                        time: "40 min",
                        video: "https://www.youtube.com/watch?v=DojBA7kGbZ0"
                    },

                    {
                        categortType: 1,
                        Image: require("../img/cd69ebce4a01358cf8aa3a9b0c035949_w750_h500.jpg"),
                        name: "زبدة الفول السوداني",
                        Elta7der: '5 min',
                        Eltahy: "20 min",
                        Elsouba: "30",
                        components: "- الفول السوداني : 2 كوب (غير مملح)",
                        view: true,
                        Step: "حمّي الفرن على درجة حرارة 180 مئوية.\nحضري صينية فرن ووزعي بها الفول السوداني\nثم أدخلي الصينية إلى الفرن لمدة 10 دقائق حتى يصبح الفول ذهبي اللون.\nفي وعاء الخلاط الكهربائي\nضعي الفول السوداني وهو دافئ دون أي إضافات\nثم اطحنيه حتى يصبح ناعم القوام.\nاحفظي زبدة الفول السوداني في وعاء زجاجي لحين الاستخدام",
                        time: "25 min",
                        video: "https://www.youtube.com/watch?v=0U8J8-dLm34"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/bc0ab7efdd9f05b3cb96d4b91c6d8700_w750_h500.jpg"),
                        name: "كيك الشوكولاتة بكريمة الفدج",
                        Elta7der: '10 min',
                        Eltahy: "90 min",
                        Elsouba: "50",
                        components: "- دقيق : كوبان وثلث الكوب\n- سكر : ثلاث أرباع الكوب\n- الزبدة : ثلاث أرباع الكوب (مذوبة)\n- زيت الذرة : نصف كوب\n- الكريما الحامضة : نصف كوب (ساور كريم)\n- السكر البني : ثلث كوب\n- الكاكاو : ربع كوب (خام)\n- البيض : 3 حبات\n- الفانيليا : ملعقة كبيرة (سائلة)\n- بيكنج بودر : 2 ملعقة صغيرة\n- بيكنج صودا : ملعقة صغيرة\n- ملح : نصف ملعقة صغيرة\n- رقائق الشوكولاته : ثلاث أرباع الكوب\n- سكر البودرة : كوب وثلاثة ارباع الكوب\n- الزبدة : كوب (بدرجة حرارة الغرفة)\n- الفانيليا : ملعقة كبيرة (سائلة)",
                        view: true,
                        Step: "1. لتحضير الفدج: على بخار مائي\nضعي رقائق الشوكولاتة\nوقلبيها حتى تذوب\nثم ارفعيها واتركيها جانبا.\n2. في وعاء كبير\nضعي الزبدة\nواخفقيها بالمضرب الكهربائي لمدة 3 دقائق.\n3. أضيفي السكر تدريجيا\nمع الاستمرار بالخفق\nحتى يصبح القوام كالكريمة.\n4. أضيفي الفانيليا والشوكولاتة\nواخفقي حتى تختلط المكونات تماما\nثم ضعيها في الثلاجة لحين تحضير الكيك.\n5. لتحضير الكيك: سخني الفرن عند درجة حرارة 180.\n6. في وعاء كبير\nضعي الدقيق والسكر بنوعيه والكاكاو والبيكنج باودر وبيكربونات الصودا والملح\nوقلبي جيدا.\n7. في وعاء آخر\nضعي البيض والساور كريم والفانيليا\nواخفقي بالمضرب الكهربائي\nحتى تختلط المكونات.\n8. في وعاء آخر\nضعي الزيت والزبدة المذابة\nواخفقي بالمضرب الكهربائي\nحتى يختلطا تماما.\n9. أضيفي خليط الدقيق إلى الزيت\nواخفقي جيدا\nثم أضيفي خليط البيض واخفقي جيدا.\n10. صبي العجين في صينية مدهونة بالزبدة ومرشوشة بالقليل من الكاكاو.\n11. ضعي الصينية في الفرن لمدة 45 – 50 دقيقة\nثم أخرجيها واتركيها تبرد تماما.\n12. اقطعي الكيك بالعرض من المنتصف\nثم ضعي ربع كمية الفدج في المنتصف\nثم زينيها من الأعلى والجوانب بباقي الفدج.",
                        time: "1 h 40 min",
                        video: "https://www.youtube.com/watch?v=eWOT3n6eSOc"
                    },
                    {
                        categortType: 2,
                        Image: require("../img/ebe83d0b7f6f467eb20355ff0f9a220d_w750_h500.jpg"),
                        name: "مهلبية البرتقال السريعة",
                        Elta7der: '5 min',
                        Eltahy: "40 min",
                        Elsouba: "50",
                        components: "- حليب : كيلو\n- عصير البرتقال : كوب\n- برش البرتقال : 1 حبة\n- الزبدة : 2 مكعب\n- النشاء : 5 ملاعق كبيرة\n- الفانيليا : حسب الرغبة\n- سكر : حسب الحاجة",
                        view: true,
                        Step: "في قدر عميق على النار\nضعي الحليب مع عصير البرتقال\nثم أضيفي بشر البرتقال\nوالفانيليا\nوالسكر وقلبي.\nأضيفي مكعبات الزبدة.\nذوبي النشا مع القليل من الحليب البارد\nثم أضيفي المزيج إلى الخليط.\nقلبي حتى يتجانس ويتشكل لديكِ القوام المطلوب.\nاسكبي المهلبية في أطباق التقديم\nوضعيها في الثلاجة حتى تبرد قبل التقديم.",
                        time: "45 min",
                        video: "https://www.youtube.com/watch?v=vxsnZPF8Yns"
                    },
                    {
                        categortType: 2,
                        Image: require("../img/73b4400bfd3e65a57e083c16720e1606_w750_h500.jpg"),
                        name: "مهلبية بالمانجو",
                        Elta7der: '10 min',
                        Eltahy: "60 min",
                        Elsouba: "40",
                        components: "- حليب بودرة : 6 ملاعق كبيرة\n- الماء : كوبان وربع\n- سكر : ملعقة كبيرة\n- عصير المانغو : 2 كوب\n- النشاء : 2 ملعقة كبيرة\n- ماء الزهر : 2 ملعقة كبيرة",
                        view: true,
                        Step: "لتحضير خليط المانجو: في وعاء\nاخلطي ربع كوب من الماء مع النشا وعصير المانجو\nثم ضعي المزيج في قدر على النار وحركي حتى يبدأ بالغليان ويكثف قوامه.\nفي قدر آخر\nاخلطي كمية الماء المتبقية مع الحليب البودرة\nوالنشا\nوالسكر\nوحركي المكونات جيدا على نار متوسطة حتى يبدأ بالغليان ويصبح كثيف وكريمي القوام\nثم ارفعي القدر عن النار وأضيفي ماء الزهر وحركي.\nاسكبي خليط المهلبية في أكواب التقديم\nواتركيه قليلا حتى يبرد\nثم اسكبي فوقه خليط المانجو.\nضعي أكواب المهلبية في الثلاجة لمدة 4 ساعات قبل التقديم\nوزينيها بقطع المانجو على الوجه وقدميها باردة",
                        time: "1 h 10 min",
                        video: "https://www.youtube.com/watch?v=ZkfncCNUlkI"
                    },
                    {
                        categortType: 2,
                        Image: require("../img/eeefb20bb4b5e29f3acc1404a144c03b_w750_h500.jpg"),
                        name: "مهلبية بالقشطة",
                        Elta7der: '5 min',
                        Eltahy: "25 min",
                        Elsouba: "30",
                        components: "- حليب : 6 اكواب\n- النشاء : 6 ملاعق كبيرة\n- القشطة : علبة\n- مستكة : ملعقة صغيرة (مطحونة)\n- كريمة : مغلف (بودرة)\n- ماء الزهر : ملعقة كبيرة\n- سكر : كوب\n- فستق حلبي : ربع كوب (مفروم خشن / للزينة)",
                        view: true,
                        Step: "اخلطي الحليب مع السكر والنشا في قدر على نار متوسطة بواسطة المضرب اليدوي حتى يذوب السكر.\nأضيفي علبة القشطة\nوحركي حتى تختلط المكونات.\nأضيفي المستكة المطحونة\nومغلف بودرة الكريمة\nوماء الزهر وحركي.\nحركي المزيج حتى يبدأ بالغليان ويتحول لمزيج كثيف وكريمي.\nاسكبي المهلبية بأكواب التقديم\nوأدخليها للثلاجة مدة 3 ساعات قبل التقديم.\nعند التقديم زيني بالفستق الحلبي وقدميها باردة",
                        time: "30 min",
                        video: "https://www.youtube.com/watch?v=4GauvheG4aI"
                    },
                    {
                        categortType: 2,
                        Image: require("../img/5464th.jpeg"),
                        name: "مهلبية الآيس كريم",
                        Elta7der: '5 min',
                        Eltahy: "25 min",
                        Elsouba: "25",
                        components: "- الماء : 3 اكواب\n- حليب : كوب وربع (مجفف)\n- سكر : كوب\n- النشاء : 5 ملاعق كبيرة\n- القشطة : كوب\n- كريمة : 3 باكيت (بودرة جاهزة)\n- فستق حلبي : 4 ملاعق كبيرة",
                        view: true,
                        Step: "1. أحضري كاسات تقديم.\n2. في كسرولة ضعي الماء\nالحليب\nالسكر\nالنشا\nباستعمال مضرب شبك قلبي ليختلط ثم سخني على نار متوسطة مع استمرار التقليب بهدوء لتحصلي على مهلبية ناعمة.\n3. أضيفي القشطة والكريمة قلبي ليختلط.\n4. وزعي المهلبية على الكاسات.\n5. ضعي المهلبية في البراد لعدة ساعات.\n6. انثري الفستق وقدميها.",
                        time: "30 min",
                        video: "https://www.youtube.com/watch?v=gNjsBypLU2M"
                    },
                    {
                        categortType: 2,
                        Image: require("../img/cc43f268a41c5cd29a78ba55a5473c98_w750_h500.jpg"),
                        name: "مهلبية بالنشا واللبن",
                        Elta7der: '5 min',
                        Eltahy: "30 min",
                        Elsouba: "25",
                        components: "- حليب : كوب\n- سكر : 2 ملعقة كبيرة\n- نشاء الذرة : ملعقة كبيرة\n- ماء الورد : ملعقة صغيرة",
                        view: true,
                        Step: "ضعي الحليب والسكر في قدر على النار واتركيه إلى أن يغلي.\nذوّبي النشا بالقليل من الماء وأضيفيه بشكل تدريجي إلى خليط الحليب والسكر وقلبي جيدا حتى يثخن القوام.\nارفعي المزيج عن النار\nثم أضيفي ماء الورد وحركي قليلا.\nاسكبي المهلبية في أكواب التقديم\nثم زينيها بالمكسرات\nوجوز الهند\nوالزبيب\nبحسب الرغبة\nثم قدميها باردة",
                        time: "35 min",
                        video: "https://www.youtube.com/watch?v=ogI4S49bL0k"
                    },
                    {
                        Image: require("../img/riseandche.jpg"),
                        name: "أرز مقلي بالدجاج",
                        view: true,
                        time: "25 min",
                        Elta7der: '10 min',
                        Eltahy: "15 min",
                        Elsouba: "10",
                        components: "1 صدر دجاج\n½ بصله\nثوم كامله\nجزر\nبصله اخضر\nرز مصري\n2 بيضة",
                        Step: "اطبخ في جهاز طهي رز ١٥ دقاق على مع زيت ملح\nبعد زيت و دجاج احط مع بهارات الثوم و بهارات مشكلا و ملح و صلصة صويا حلو\nاقطع الثوم و بصله و بصله أخضر و جزر\nاقلي بصل و الجزر و بيضة مع زيت و قليل صلصة صويا حلو\nبعد احط دجاج مع البصله الخضر و ثوم\nواحط كل حاجه علي بعضها",
                        categortType: 1,
                        video: "https://www.youtube.com/watch?v=qZFWEYXOV28"

                    },
                    {
                        categortType: 2,
                        Image: require("../img/4a9e01c0b201c34c264b2144cb53c41b_w750_h500.jpg"),
                        name: "مهلبية اللوز والكاسترد",
                        Elta7der: '5 min',
                        Eltahy: "20 min",
                        Elsouba: "25",
                        components: "- الماء : ليتر (بدرجة حرارة الغرفة)\n- حليب بودرة : كوب\n- بودرة الكاسترد الجاهزة : 4 ملاعق كبيرة\n- القشطة : علبة\n- سكر : 3 ملاعق كبيرة\n- هيل : نصف ملعقة صغيرة (مطحون)\n- ماء الورد : ملعقة كبيرة\n- لوز : ربع كوب",
                        view: true,
                        Step: "في قدر على نار متوسطة اخلطي الماء مع الحليب.\nأضيفي بودرة الكاسترد\nوالسكر\nوالقشطة\nوالهيل وحركي المكونات جيدا حتى يغلي المزيج\nومن ثم خففي النار مع الإستمرار في التحريك حتى يكثف القوام.\nارفعي القدر عن النار\nثم أضيفي ماء الورد وحركي جيدا.\nاسكبي المهلبية في أكواب التقديم وزينيها باللوز\nثم قدميها",
                        time: "25 min",
                        video: "https://www.youtube.com/watch?v=vDuGzna8NcA"
                    },
                    {
                        categortType: 2,
                        Image: require("../img/5d4baa40180bb6661e72ebe3db61d3c4_w750_h500.jpg"),
                        name: "مهلبية الموز",
                        Elta7der: '5 min',
                        Eltahy: "25 min",
                        Elsouba: "25",
                        components: "- الموز : 4 حبات\n- عصير الليمون : نصف حبة\n- لبن : 2 كوب\n- سكر : 4 ملاعق كبيرة\n- النشاء : ملعقة صغيرة\n- الفانيليا : ملعقة صغيرة\n- الموز : 1 حبة (للتزيين / حسب الرغبة)",
                        view: true,
                        Step: "في وعاء\nاخلطي الموز مع عصير الليمون وقومي بهرسه جيدا.\nذوبي النشا في القليل من الحليب ثم ارفعي باقي كمية الحليب على نار متوسطة.\nأضيفي النشا والسكر والفانيليا إلى الحليب عندما يصل إلى مرحلة الغليان وقلبي جيدا.\nأضيفي مهروس الموز إلى الخليط وقلبي جيدا.\nبعد أن يبرد صبي المهلبية في أطباق التقديم وزينيها بشرائح الموز",
                        time: "30 min",
                        video: "https://www.youtube.com/watch?v=lwoQwnAujRg"
                    },
                    {
                        categortType: 2,
                        Image: require("../img/1522b111cd5b349f67273c76e8a8a23c_w750_h500.jpg"),
                        name: "مهلبية الجوافة",
                        Elta7der: '5 min',
                        Eltahy: "25 min",
                        Elsouba: "25",
                        components: "- حليب : نصف لتر\n- عصير جوافة : 500 مل\n- سكر : 150 غراما\n- الفانيليا : 6 غم\n- الزبدة : 50 غم (مقطعة)\n- النشاء : 50 غم\n- الماء : 100 ملليلتر",
                        view: true,
                        Step: "1. في قدر على النار\nنضع الحليب\nوعصير الجوافة\nوالسكر\nوالفانيلا\nونقلب المكونات مع بعضها البعض\nحتى التأكد من ذوبان السكر.\n2. في وعاء آخر\nنذوب النشا مع الماء\nحتى يذوب النشا.\n3. نضيف الزبدة\nوخليط النشا والماء\nعلى خليط الحليب وعصير الجوافة\nونحرك حتى نحصل على قوام كثيف.\n4. تصب مهلبية الجوافة بصينية الفرن\nوتدخل للفرن حتى يحمر وجهها. وتقدم.",
                        time: "30 min",
                        video: "https://www.youtube.com/watch?v=br_J1MPbLEM"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/1a7ed0813b00fb1b83935a2d4f9d1739_w750_h500.jpg"),
                        name: "البيتيفور",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "50",
                        components: "- الزبدة : ثلاث أرباع الكوب (طرية)\n- دقيق : كوب\n- الفانيليا : ملعقة صغيرة\n- البيض : 1 حبة\n- سكر : كوب (مطحون)\n- كرز : نصف كوب (مجفف ومفروم)",
                        view: true,
                        Step: "اخلطي الزبدة والسكر البودرة بمحضرة الطعام حتى يصبح المزيج كريمي.\nأضيفي البيضة والفانيلا واخفقي.\nأضيفي الدقيق واخفقي حتى تتكون عجينة ناعمة.\nضعي العجين بالقمع الخاص بتشكيل البيتفور وشكلي وردات صغيرة.\nضعي البيتيفور بصينية مبطنة بورق الزبدة.\nضعي قطعة من الكرز في منتصف كل حبة.\nأدخلي الصينية للفرن على درجة حرارة 180 لمدة 14 دقيقة.\nأخرجي الصينية من الفرن واتركي البيتيفور يبرد وقدميه.",
                        time: "1 h",
                        video: "https://www.youtube.com/watch?v=0Ncw53jpfV8"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/6dffe6a2c55b0d3be844559538e53bff_w750_h500.jpg"),
                        name: "شوكولاتة بدون سكر",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "50",
                        components: "- الكاكاو : نصف كوب (خام)\n- زيت جوز الهند : نصف كوب\n- لوز : حسب الرغبة (مجروش)\n- العسل : 2 ملعقة كبيرة",
                        view: true,
                        Step: "ضعي نصف كمية الزيت في وعاء للخلط.\nأضيفي العسل والكاكاو بالتدريج مع التقليب بعد كل إضافة حتى لا تتكون أي تكتلات في الخليط.\nقومي بتوزيع خليط الشوكولاتة في قالب سيليكون.\nأضيفي اللوز المجروش في القوالب الصغيرة على الوجه.\nأدخلي القالب إلى الفريزر حتى تجمد الشوكولاتة.\nأخرجي الشوكولاتة من الفريزر وقدميها بحسب الرغبة",
                        time: "1 h",
                        video: "https://www.youtube.com/watch?v=86t0XD0oPUQ"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/ec0350670ed17367d7a78b6d7f5726b4_w750_h500.jpg"),
                        name: "لبن زبادي بالفراولة",
                        Elta7der: '5 min',
                        Eltahy: "10 min",
                        Elsouba: "20",
                        components: "- لبن زبادي : 3 اكواب\n- الفراولة : 2 كوب (مفرومة)\n- السكر الناعم : نصف كوب (بودرة)\n- الفراولة : حسب الرغبة (مقطعة أنصاف / للتزيين)",
                        view: true,
                        Step: "ضعي الزبادي والسكر وكوبا من الفراولة في الخلاط على سرعة متوسطة إلى أن يصبح الخليط ناعما.\nأضيفي الكمية الباقية من الفراولة وقلبي ثم ضعي الزبادي في الثلاجة حتى يبرد تماما.\nقومي بتوزيع الزبادي في الأكواب وزيني بالفراولة.",
                        time: "15 min",
                        video: "https://www.youtube.com/watch?v=zTfwvek7qmo"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/89a3ec2249273fc52325bd98a9e34f46_w750_h500.jpg"),
                        name: "كيكة زبادي بالشربات",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "40",
                        components: "- مقادير الشربات :\nسكر : كوب\nالماء : ثلث كوب\nعصير الليمون : ملعقة صغيرة\nماء الورد : ملعقة صغيرة\n- زبادي : كوب\n- طحين : كوبان ونصف (منخل)\n- البيض : 3 حبات\n- سكر : كوب\n- الفانيليا : ملعقة صغيرة\n- بيكنج بودر : 2 ملعقة صغيرة\n- بيكربونات الصودا : نصف ملعقة صغيرة\n- الزيت : نصف كوب",
                        view: true,
                        Step: "سخني الفرن على درجة حرارة 180 مئوية\nوجهزي قالب الكيك بدهنه بالزيت ورشة طحين أو بالزبدة.\nفي وعاء للخلط: ضعي السكر والبيض والفانيلا واخفقي المكونات باستخدام المضرب الكهربائي حتى الحصول على مزيج متجانس وقوام كريمي.\nأضيفي الزيت واستمري بالخفق.\nفي وعاء آخر اخلطي المكونات الجافة التالية: الطحين\nوالملح\nوبيكربونات الصودا\nوالبيكنج باودر\nوأضيفي المكونات الجافة على السائلة مع إضافة الزبادي حتى تمتزج المكونات مع بعضها البعض جيدا.\nصبي خليط الكيك في القالب وأدخليه إلى الفرن لمدة 40 – 45 دقيقة حتى تمام نضج الكيك.\nأخرجي الكيك من الفرن ويترك حتى يبرد تماما.\nلتحضير الشربات: امزجي السكر والماء في وعاء على النار حتى درجة الغليان\nثم أضيفي ماء الورد وعصير الليمون وقلبي المكونات حتى الحصول على مزيج الشربات المطلوب.\nوزعي الشربات على الكيك حتى يتشرب الكيك الشربات جيدا وزيني الكيك بحسب الرغبة.",
                        time: "1 h",
                        video: "https://www.youtube.com/watch?v=WkV2S_qVEbQ"
                    },
                    {
                        Image: require("../img/download1.jpg"),
                        name: "طاجن مكرونة بشاميل ",
                        view: true,
                        time: " 50 min",
                        Elta7der: '10 min',
                        Eltahy: "40 min",
                        Elsouba: "30",
                        components: '½ كيلو مكرونة بنة او اقلام\nماء للغلى\nملح\nالحشو :\n¼ كيلو لحمة مفرومة\nملح\nفلفل اسمر\nبصلة مفرومة او مقطعة صغير\nالبشاميل :\n4 معالق دقيق\nلتر لبن\nمعلقتين سمن\nمكعب مرق\nملح\nفلفل\nجبن رومى او موتزريلا',
                        Step: "فى حلة يغلى الماء ثم يضاف المكرونة والملح وتترك لتستوى ثم تصفى ولا تغسل\nفى طاسة يوضع البصل والسمن حتى تصبح البصل ذهبى اللون يضاف اللحمة ويقلب ثم يضاف الملح والفلفل\nفى حلة يضاف السمن والدقيق ويقلب ثم يضاف اللبن والملح والفلفل والمكعب المرق ويقلب حتى يتقل القوام\nتحضر البرامات الصغيرة او الطواجن الصغيرة تدهن بمادة دهنية\nيضاف قليل من البشاميل الى المكرونة ويقلب ثم توضع طبقة من المكرونة فى البرام ثم يضاف اللحمة ثم توضع الطبقة الثاتية\nيغطى الوجه بالبشاميل و الجبن وتدخل فرن ساخن لمدة 20 دقيقة ",
                        video: "https://www.youtube.com/watch?v=jzr_0t74aJA",
                        categortType: 2,


                    },
                    {
                        Image: require("../img/Untitled-108.jpg"),
                        name: "مكرونة وايت صوص",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: '400 جرام مكرونة قلم\nكوب حليب 2\n3 ملعقة كبيرة\nملعقة كبيرة زبدة\nملح\nفلفل أسود\nكوب جبن شيدر أو ميكس جبن',
                        Step: "تسلق المكرونة في ماء مغلي مملح حتى تصل إلى درجة النضج المرغوب.\nنضيف الدقيق والزبدة إلى الحليب ونخلطهم جيدا بالمضرب اليدوي معه ثم نرفعهم على النار مع استمرار التقليب حتى يتقل القوام.\nنضيف الملح والفلفل الأسود ونقلب ثم الأجبان ونقلب حتى تذوب\nثم نضيف المكرونة المسلوقة إلى الصوص ونقلب ونتركها حتى يغلي بها ثم ترفع من النار وتقدم وبالهنا. ",
                        video: "https://www.youtube.com/watch?v=rjH9sgsMADE",
                        categortType: 2,


                    },

                    {
                        Image: require("../img/makronawithgampry.jpg"),
                        name: "مكرونة بالجمبري",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: "½ كيلو جمبري متقشر ومتنض\nف لمونة\n½ معلقة صغيرة كمون\n½ معلقة صغيرة فلفل اسود\n½ معلقة صغيرة كسبرة\nمعلقة كبيرة زبدة\nمعلقة صغيرة مليانة توم مفروم\nمعلقة كبيرة دقيق",
                        Step: "بنتبل الجمبري باللمون والكمون والفلفل الاسود والكسبرة\nفي حلة بنشوح التوم وننزل بالجمبري ونقلب لحد مايستوي بعدين نطلعه ونحط مكان الجمبري الزبدة والدقيق ونقلب وبعدين نحط مكعب المرق ونقلب بعدين نحط اللبن والكريمة اللباني ونرجع الجمبري تاني ونقلب ولما يبتدي يتقل نحط المكرونة ونقلب تقلبتين وخلاص ولو حسيتوا ان الصوص تقيل بتزودوا لبن لو مظبوط خلاص  ",
                        video: "https://www.youtube.com/watch?v=bgpUK0nkFkY",
                        categortType: 2,


                    },
                    {
                        Image: require("../img/makronabldggag.jpg"),
                        name: "مكرونة كريمية بالدجاج ",
                        view: true,
                        time: " 60 min",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "50",
                        components: 'تتبيلة الدجاج:\n2 صدور دجاج 4 ملاعق كبيرة زيت نباتي\n1 ملعقة كبيرة توابل كيچن\n1 ملعقة صغيرة بودرة بصل\n1 ملعقة صغيرة بودرة ثوم\n1 ملعقة صغيرة بقدونس مجفّف\n1 ملعقة صغيرة بهارات دجاج\n1/2 ملعقة صغيرة بابريكا المكرونة:\n500 جرام مكرونة أقلام\n1 كوب كريمة طبخ\n1 كوب مرقة دجاج\n1/2 كوب "115 جرام" جبنة كريمية\n1 حبّة بصل مفروم\n1 حبّة طماطم مقطّعة مكعبات\n1 حبّة فلفل رومي مقطّع مكعبات\n1 ملعقة كبيرة زبدة\n1 ملعقة صغيرة بودرة مرقة دجاج\n1 ملعقة صغيرة توابل كيچن\n1/2 ملعقة صغيرة ثوم مهروسة\nملح - فلفل أسود',
                        Step: "نسلق المكرونة بالطريقة المعتادة ثم نصفّيها ونتركها جانبا ونبدأ أولا بتجهيز الدجاج\nإذا كانت الصدور سميكة نضعهم بين طبقتين من الورق الشفاف ونَدُقّهم وهذا حتى ينضجوا تماما من الداخل ثم ندهنهم بملعقة كبيرة من الزيت\nهذه بهارات الكيچن التي استخدمتها بالوصفة وهي تُضفي نكهة مميزة ولذيذة جدا للطبق\nنخلط كل مكونات التتبيلة معا بطبق صغير ونغلّف بهم صدور الدجاج\nوبمقلاة عميقة وغير لاصقة نسخّن حوالي 3 ملاعق كبيرة من الزيت ونشوِّح به الدجاج لمدة 10 دقائق تقريبا مع التقليب المستمر على كل الجوانب حتى ينضجوا تماما ثم نُخرجهم جانبا ونتركهم لتهدأ حرارتهم قليلا\nبنفس المقلاة نُذيب الزبدة ونشوِّح بها البصل والثوم حتى يلين قوام البصل ثم نُضيف مكعبات الفلفل والطماطم وعندما يلين قوام الخضروات نضع الكريما ومرقة الدجاج ثم الجبنة الكريمية ونقلّب جيدا حتى تتجانس المكونات ثم نُضيف بودرة مرقة الدجاج وبهارات الكيچن ونتبّل بالملح والفلفل الأسود\nوعندما يبدأ الخليط بالغليان نُضيف المكرونة المسلوقة مع التقليب الجيد حتى تختلط بها كل المكونات ثم نقطّع صدور الدجاج إلى شرائح ونقلّبهم مع المكرونة ونترك بعض الشرائح جانبا لوضعهم على الوجه عند التقديم النهائي\nنرفع المكرونة عن النار وتوضع بأطباق التقديم ونرُش الوجه بالقليل من الجبنة المبشورة أو نزيّن حسب الرغبة\nوأخيرا تُقدَّم مكرونة الدجاج والكيچن ساخنة",
                        video: "https://www.youtube.com/watch?v=rFOASDE9kgs",
                        categortType: 1,


                    },
                    {
                        Image: require("../img/733.jpg"),
                        name: "صينية بطاطس باللحمة",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "40",
                        components: '1 كيلو لحمة مسلوقة\n1 كيلو بطاطس\n3 كوب عصير طماطم\n1 كوب ماء بصلة حلقات\n1 ملعقة صغيرة ثوم مفروم\n1 ملعقة كبيرة سمنة\nفلفل حار  حسب الرغبة\nملح\nفلفل أسود ',
                        Step: "شوحي البصل في زيت مخصص للطهى على النار مع إضافة ذرة ملح له حتى تذبل ثم تضاف قطع اللحمة وتحمر قليلا ثم يضاف عصير الطماطم والثوم ويقلب الخليط بشكل جيد\nضعي شرائح البطاطس في صينية مع الفلفل الحار حسب الرغبة و يضاف خليط الطماطم والطماطم إلى البطاطس و يضاف الماء والملح والفلفل الأسود\nتوضع الصينية على النار لتغلي ثم توضع في الفرن وانتظري حتى تمام النضج ",
                        video: "https://www.youtube.com/watch?v=QaGmEgUaODc",
                        categortType: 5,


                    },
                    {
                        Image: require("../img/491.jpg"),
                        name: "كفتة الجمبري",
                        view: true,
                        time: " 35 min",
                        Elta7der: '10 min',
                        Eltahy: "25 min",
                        Elsouba: "50",
                        components: 'جمبري مفروم\nسمك فيليه\nبيض\nزنجبيل طازج\nشبت\nفلفل ألوان\nأعشاب\nكاري\nجزر\nكزبرة خضراء\nخلة خشب\nبقسماط\nثوم\nملح\nفلفل\nزيت ذرة ',
                        Step: "افرمي الزنجبيل والثوم والجزر والفلفل الألوان والكاري والأعشاب وملح وفلفل وسمك فيليه وجمبري بشكل جيد\nضعي القليل من البقسماط مع الاستمرار في الفرم\nثم شكلي العحينة اصابع في خلة خشب باستخدام الزيت وضعيها على الشواية حتى تنضج ثم قدميها ",
                        video: "https://www.youtube.com/watch?v=_oMKekApjXg",
                        categortType: 6,


                    },
                    {
                        Image: require("../img/0shrimpsgrilledtomato.jpg"),
                        name: "مكرونة بالجمبري",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "40",
                        components: '300 جرام معكرونه 300 جرام جمبري\n½ معلقه صغيره فلفل اسود\nمعلقه صغيره كاري\nبصلة متوسطة متقطعة\nكوب فلفل رومي متقطع\n5 وحدات طماطم متقطعين\nفصين ثوم\nملح حسب التذوق\nكوب ونص ميه',
                        Step: "حلة كبيرة هنضيف المكونات جمب بعضها ونضيف الماء الساخنة ونغطيها ونشغل النار متوسطة\nاول ماتبدأ تغلى هنقلب كل المكونات مع بعضهم حلو اوي وهنهدي النار ونخليها متغطيها و تكمل تسويه\nبعد حوالي ١٥ دقيقه هنفتح عليها ونقلبها كويس اوي وتتقدم ساخنة ",
                        video: "https://youtube.com/watch?v=Uk58nYk9gnk",
                        categortType: 6,


                    },
                    {
                        Image: require("../img/f213a26ce9152d184baeed39a4076fa2_w750_h500.jpg"),
                        name: "روستو دجاج بالبرتقال",
                        view: true,
                        time: " 55 min",
                        Elta7der: '10 min',
                        Eltahy: "45 min",
                        Elsouba: "60",
                        components: '- الدجاج : دجاجة\nالبرتقال : 1 حبة (مقطع)\nعصير البرتقال : كوب\nورق غار : 2 ورقة\nالبصل : 1 حبة (مفروم)\nبرش البرتقال : ملعقة صغيرة\nزعتر مجفف : ربع ملعقة صغيرة\nالزيت النباتي : 2 ملعقة صغيرة\nالزبدة : 2 ملعقة صغيرة\nملح : حسب الرغبة\nفلفل أسود : حسب الرغبة\nالثوم : فصّان\nصلصة طماطم : 2 ملعقة كبيرة',
                        Step: "قطعي الدجاجة إلى نصفين طوليا.\nضعي الزيت في قدر على النار\nواقلي الدجاج من جميع الجهات ثم ضعيه جانبا.\nفي القدر نفسه\nحمري البصل المفروم مع الثوم حتى يذبل.\nأضيفي برش برتقال وعصيره\nوصلصة الطماطم\nوورق الغار\nوالزعتر الجاف\nواتركي المقدار يغلي على النار لمدة 5 دقائق.\nأضيفي الدجاج وغطيه حتى ينضج\nثم قدميه وزينيه بقطع البرتقال.",
                        video: "https://www.youtube.com/watch?v=jHBpvyElA4k",
                        categortType: 1,

                    },
                    {
                        categortType: 1,
                        Image: require("../img/eb39a2eb90f3a572ab87e8c573c25d46_w750_h500.jpg"),
                        name: "كيكة الزبادي الاسفنجية",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "40",
                        components: "- للكيك :\nالزيت النباتي : ثلاث أرباع الكوب\nالبيض : 2 حبة\nبرش ليمون : ملعقة كبيرة\nعصير الليمون : 2 ملعقة كبيرة\nلبن زبادي : كوب\nسكر : كوب وثلاثة ارباع الكوب\nدقيق : 2 كوب\nبيكنج بودر : 2 ملعقة صغيرة\n- للتغطية :\nسكر البودرة : نصف كوب\nعصير الليمون : ربع كوب",
                        view: true,
                        Step: "اخفقي الزيت والبيض وبرش الليمون وعصير الليمون واللبن والسكر في وعاء كبير حتى يمتزجوا تماما.\nأضيفي الدقيق والبكينج باودر واخفقي برفق حتى الامتزاج.\nادهني قالب الكيك ببعض الزيت ثم صبي فيه خليط الكيك واخبزي الكيك في فرن حامي على درجة حرارة  180 مئوية لمدة 30 دقيقة.\nحضري طبقة التغطية عن طريق خلط السكر البودرة وعصير الليمون معا.\nاقلبي الكيك رأسا على عقب على طبق التقديم ورشي على سطحه طبقة التغطية بينما لا يزال ساخنا.",
                        time: "1 h",
                        video: "https://www.youtube.com/watch?v=fsstwbXlJ-o"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/90ba876e49b6a5a2e1986d6b647072cc_w750_h500.jpg"),
                        name: "معمول بالمكسرات",
                        Elta7der: '10 min',
                        Eltahy: "110 min",
                        Elsouba: "80",
                        components: "- لتحضير حشوة الفستق الحلبي :\nفستق حلبي : 250 غراما (مجروش)\nقطر : ربع كوب (ثقيل)\n- لتحضير حشوة الجوز :\nالجوز : 250 غراما (مجروش)\nالقرفة : ملعقة صغيرة\nقطر : ربع كوب (ثقيل)\n- سميد خشن : 8 اكواب\n- سميد ناعم : 3 اكواب\n- الزبدة : حسب الحاجة\n- الماء : كوب ونصف\n- سكر : 2 كوب\n- خميرة : ملعقة كبيرة\n- المحلب : 2 ملعقة صغيرة",
                        view: true,
                        Step: "ضعي السميد الناعم والسميد الخشن والسكر والمحلب والزبدة في وعاء.\nاخلطي المكونات جيدا حتى تتجانس ثم غطي الوعاء واتركيه جانبا لـ8 ساعات على الأقل.\nقومي بإضافة الخميرة على مزيج السميد ثم اسكبي الماء تدريجيا وادعكي المكونات جيدا حتى تحصلي على عجينة متماسكة.\nقسمي العجينة إلى قسمين متساويين واتركيها ترتاح لبعض الوقت.\nاخلطي الجوز مع القرفة والقطر وفي وعاء آخر اخلطي الفستق الحلبي والقطر.\nخذي كمية من العجين واحشيها بالجوز أو الفستق الحلبي ثم شكليها بحسب رغبتك.\nأعيدي الكرة حتى انتهاء الكمية.\nصفي قطع المعمول في صواني واخبزيها في فرن محمى مسبقا على حرارة متوسطة.",
                        time: "2 h",
                        video: "https://www.youtube.com/watch?v=0pya1bnNreM"
                    },
                    {
                        categortType: 5,
                        Image: require("../img/4536415th.jpeg"),
                        name: "قطايف بالجوز",
                        Elta7der: '5 min',
                        Eltahy: "30 min",
                        Elsouba: "25",
                        components: "- للشيرة :\nسكر : كوب\nالماء : كوب\nماء الزهر : ملعقة صغيرة\nعصير الليمون : قليل\n- القطايف : نصف كيلو (عجينة)\n- الجوز : ثلاث أرباع الكوب (مفروم خشن)\n- سكر البودرة : ملعقة كبيرة\n- القرفة : ملعقة كبيرة (مطحونة)\n- سمن : ملعقة كبيرة",
                        view: true,
                        Step: "اخلطي الجوز والسكر والقرفة في طبق.\nاحشي حبات القطايف بالحشوة ورصيها في صينية للفرن.\nوزعي السمن على حبات القطايف وأدخليها للفرن على حرارة 180 درجة لمدة 20 دقيقة حتى تتحمر.\nلتحضير الشيرة: اخلطي السكر مع الماء في قدر على نار متوسطة وحركي حتى يذوب السكر ويبدأ بالغليان.\nأضيفي عصرة الليمون وحركي حتى تتمازج المكونات.\nارفعي الشيرة عن النار وأضيفي ماء الزهر.\nوزعي الشيرة على حبات القطايف وقدميها دافئة.",
                        time: "35 min",
                        video: "https://www.youtube.com/watch?v=tbTWQ2TRtCI"
                    },
                    {
                        categortType: 4,
                        Image: require("../img/460631a884f126b2d66155b0b20e3a72_w750_h500.jpg"),
                        name: "كنافة بالقشطة",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "30",
                        components: "- عجينة كنافة : نصف كيلو (جاهزة)\n- سمن : ثلاث أرباع الكوب\n- حليب : 2 كوب (سائل)\n- النشاء : 2 ملعقة كبيرة\n- سكر : 2 ملعقة كبيرة\n- البيض : 1 حبة\n- ماء الورد : ملعقة كبيرة (أو ماء الزهر) ",
                        view: true,
                        Step: "لتحضير القشطة: في وعاء على النار\nضعي الحليب مع ماء الورد أو ماء الزهر\nوأضيفي إليه السكر.\nسخني المزيج قليلا ثمّ ضعي البيضة مع إستمرارية التحريك.\nأضيفي كميّة النشا بعد أن تذوبيها بالقليل من الماء\nوتابعي التحريك.\nبعد أن يغلي المزيج أضيفي علبة القشطة\nوحركي حتّى تذوب القشطة في المزيج.\nارفعي المزيج عن النار\nوغطّي وجهه لكي لا يجف\nوضعيه جانبا حتّى يبرد تماما.\nإبدأي بتقطيع عجينة الكنافة بيدكِ إلى قطع صغيرة.\nفي وعاء عميق ضعي عجينة الكنافة\nوأضيفي إليها السمن\nثم افركيها بيديكِ جيّدا حتى يتوزع السمن على العجينة بأكملها.\nإفردي نصف مقدار عجينة الكنافة على صينية الفرن\nوقومي بالضغط عليها بكفّة يدكِ حتى تصبح بمستوى واحد.\nوزعي حشوة القشطة على وجه الطبقة التي فردتها في الصينيّة بشكل متساوي.\nأضيفي النصف الثاني من عجينة الكنافة\nووزعيه بشكل متساوي\nواضغطي عليها بكف يدكِ.\nحمّي الفرن\nثم ضعي الكنافة في الفرن لخبزها حوالي 15 دقيقة حتى تصبح ذهبية اللون.\nأخرجيها من الفرن\nوضيفي إليها القطر البارد تماما\nثم زينيها بالفستق الحلبي\nوقدميها.",
                        time: "1 h",
                        video: "https://www.youtube.com/watch?v=GbOL_oMyENg"
                    },
                    {
                        categortType: 4,
                        Image: require("../img/cf82378b48898b67305548b733e72ea7_w750_h500.jpeg"),
                        name: "كنافة بالمهلبية",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "25",
                        components: "- عجينة الكنافة الشعر : 400 غراما\n- سكر : 5 ملاعق كبيرة\n- الزبدة : 60 غراما\n- الزبدة : 5 ملاعق كبيرة (للمهلبية)\n- دقيق : نصف كوب (للمهلبية)\n- حليب : 4 اكواب (سائل / للمهلبية)\n- كريمة : نصف كوب (سائلة للحلويات / للمهلبية)\n- حليب بودرة : 2 ملعقة كبيرة (للمهلبية)\n- سكر : نصف كوب (للمهلبية)",
                        view: true,
                        Step: "في قدر على النار نضع الزبدة والسكر وننتظر حتى تذوب الزبدة ثم نضع الكنافة ونستمر بالتقليب حتى يتغير لونها ويصبح أشقر ثم نضعها جانبا.\nفي قدر آخر على النار نضع الزبدة ونتركها حتى تذوب ثم نزود الدقيق ونحرك حتى تصبح عجينة ثم نضيف جميع كمية الحليب بالتدريج مع التحريك باستمرار.\nنضيف السكر والحليب البودرة والكريمة السائلة على خليط الحليب ونستمر بالتحريك حتى يسخن الخليط ويثخن.\nفي بايركس نضع طبقة أولى من الكنافة ونرصها جيدا ثم نضع كمية المهلبية ثم نضع على الوجه طبقة أخرى من الكنافة ونتركها جانبا حتى تبرد ثم ندخلها الثلاجة لمدة ٤ ساعات.\nتزين بالفستق الحلبي والحليب المكثف المحلى.",
                        time: "1 h",
                        video: "https://www.youtube.com/watch?v=IenYZRMfwzQ"
                    },
                    {
                        Image: require("../img/0kabsayemen.jpg"),
                        name: "الكبسة اليمني",
                        view: true,
                        time: " 40 min",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "60",
                        components: '1 كيلو غرام لحم مع العظام\n4 كوب أرز بسمتي منقوع بالماء لمدة ساعة قبل الطهي\n1 معلقة كبيرة خل\n1 معلقة كبيرة بهارات مشكلة\n1 كوب ماء\n1 ملعقة كبيرة ملح\n4 حبات هيل\n4 عود قرفة\n4 كبش قرنفل\n3 حبة بصل كبيرة مقطعة حلقات\n200 غرام زبادي\n1 ملعقة صغيرة زعفران\nمنقوع فى قليل من الماء\n1 معلقة كبيرة زنجبيل',
                        Step: "فى قدر الضغط على النار\nأضيفي جميع المكونات عدا الأرز و الزعفران.\nقلبي المزيج ثم غطى القدر واتركيه على النار حتى ينضج اللحم تماما.\nفى هذه الأثناء\nاسلقى الارز حتى يصبح نصف ناضجا.\nبعد نضج اللحم\nانقلي محتويات قدر الضغط إلى قدر عادى عميق.\nأضيفى الأرز فوق خليط اللحم\nثم سخني القدر على النار.\nأضيفى الزعفران على الوجه\nثم غطي القدر واتركيه على النار\nحتى ينضج الأرز تماما.\nقدمي الكبسة ساخنة",
                        video: "https://www.youtube.com/watch?v=k0GCjA_TohI",
                        categortType: 3,

                    },
                    {
                        categortType: 1,
                        Image: require("../img/110cbf893a9f3a68f23dccb19d2dd6e8_w750_h500.jpg"),
                        name: "السينابون",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "25",
                        components: "- طحين : 4 اكواب\n- حليب : نصف كوب (دافئ)\n- خميرة : 4 ملعقة صغيرة\n- سكر : ملعقة كبيرة\n- الزبدة : ربع كوب\n- البيض : 1 حبة\n- سكر : ربع كوب\n- ملح : ملعقة صغيرة",
                        view: true,
                        Step: "ضعي الخميرة على الحليب الدافئ وملعقة السكر في كوب\nوقلبي جيدا.\nضعي كل المكونات الأخرى في وعاء كبير الحجم\nوقلبي جيدا.\nأضيفي كوب الخميرة والحليب على مكونات عجينة السينابون\nثم اعجني العجينة جيدا حتى تصبح ناعمة الملمس.\nاتركي العجينة حتى تختمر\nثم شكليها واحشيها.",
                        time: "1 h",
                        video: "https://www.youtube.com/watch?v=uz1r7fhg9A8"
                    },
                    {
                        categortType: 5,
                        Image: require("../img/691d959bb2492c326a797797dc29831b_w750_h500.jpg"),
                        name: "عجينة القطايف",
                        Elta7der: '5 min',
                        Eltahy: "30 min",
                        Elsouba: "25",
                        components: "- طحين : 2 كوب\n- السميد : نصف كوب\n- سكر : نصف كوب\n- الماء : 3 اكواب\n- بيكنج بودر : 3 ملاعق صغيرة\n- الفانيليا : ملعقة صغيرة\n- ملح : رشّة",
                        view: true,
                        Step: "في الخلاط الكهربائي\nضعي جميع المكونات ثم اخلطي حتى تتجانس مع بعضها البعض.\nاسكبي الخليط في إبريق الشاي.\nحضّري صينية بلا حواف وضعيها على النار.\nاسكبي مقدار من عجينة القطايف في الصينية لتشكلي دائرة\nوانتظري لتأخذ لونا ذهبيا من أسفل.\nعند الإستواء ضعيها جانبا لتبرد وغطيها حتى لا تجف ثم احشيها بالحشوة المفضلة واشوي القطايف في الفرن.",
                        time: "35 min",
                        video: "https://www.youtube.com/watch?v=0_iQzJK3dPs"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/cfcc7fbc8b77933dda0a55659811efe3_w750_h500.jpg"),
                        name: "البقلاوة بالقشطة",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "30",
                        components: "- عجينة البقلاوة : نصف كيلو (شرائح)\n- القشطة : نصف كيلو\n- الزبدة : كوب (طرية بحرارة الغرفة)\n- سيرب : كوب (أو عسل لتسقية الحلى)",
                        view: true,
                        Step: "قسّمي شرائح عجينة البقلاوة إلى نصفين وتأكدي من فصل الشرائح عن بعضها في كل قسم\nحتى لا تلتصق مع بعضها البعض.\nادهني بالقليل من الزبدة الطرية ما بين كل شريحتين\nوقطعيها إلى مستطيلات بأحجام متساوية.\nعلى طرف كل مستطيل ضعي ملعقة من القشطة بعيدا عن الأطراف\nوقومي بلف العجينة وأغلقيها جيدا.\nفي صينية الفرن\nضعي ورقة زبدة ورصّي قطع عجينة البقلاوة وادهني الوجه بالزبدة جيدا حتى تتغطى تماما.\nحمّي الفرن على درجة حرارة  180 مئوية\nوأدخلي الصينية لمدة 25 دقيقة حتى تصبح ذهبية اللون.\nأخرجيها من الفرن وضعيها في طبق تقديم ثم اسكبي عليها سيرب ولا بد أن يكون بارد تماما أو عسل\nواتركيه حتى تتشربه أصابع البقلاوة بالقشطة\nثم صفيها من السيرب\nووزعيها في طبق تقديم.",
                        time: "1 h",
                        video: "https://www.youtube.com/watch?v=FIj3qPyLcmg"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/baalawa-choco.jpg"),
                        name: "البقلاوة بالشوكولاتة",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "30",
                        components: "- طحين : 1 كيلو\n- ملح : 25 غراما\n- السمنة : 25 غراما\n- الماء : 600 غراما\n- الكاكاو : 50 غم\n- النشاء : 100 غراما\n- كاجو : 1 كيلو (مفروم ناعم)\n- النشاء : 100 غراما",
                        view: true,
                        Step: "1. يخلط الطحين مع الماء والملح بشكل جيد\nومن ثم يضاف إلى العجينة السمنة والكاكاو\nوتخلط العجينة مرّة أخرى حتى تصبح متماسكة.\n2. تقطّع العجينة الى 13 قطعة\nونضع على كل قطعة القليل من النشاء (المذوّب بالماء).\n3. ترقّ كل عجينة على حدة على شكل رغيف من الخبز\nوتوضع فوق بعضها (وبين كل طبقة من العجين نرشّ القليل من النشاء حتى لا تلتصق ببعضها) ويجب ألا ننسى حشو الطبقات بالكاجو المفروم.\n4. توضع العجينة في صينية كبيرة وتقطّع إلى قطع صغيرة ومتجانسة\nويوضع عليها السمنة وتدخل إلى الفرن على درجة حرارة 200 مئوية حتى يصبح لونها ذهبيا.\n5. عندما تخرج من الفرن\nنرشّ عليها القطر وتقدّم عندما تبرد.",
                        time: "1 h",
                        video: "https://www.youtube.com/watch?v=yjGdMMBaZ1o"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/5a18aa9160d897b50908c62216043e61_w750_h500.jpg"),
                        name: "الجلي",
                        Elta7der: '5 min',
                        Eltahy: "25 min",
                        Elsouba: "20",
                        components: "- الجيلي : كيس (بأي نكهة مفضلة)\n- ماء ساخن : 2 كوب\n- الفواكة : حسب الرغبة (موز- فراولة - توت - كرز - كيوي)",
                        view: true,
                        Step: "اخلطي المسحوق مع الماء المغلي وصبيه فوق الفواكة.\nقومي بوضع القالب في الثلاجة الى أن يبرد بالكامل ويجمد الجلي.",
                        time: "30 min",
                        video: "https://www.youtube.com/watch?v=gS1z3NxSgcU"
                    },
                    {
                        categortType: 3,
                        Image: require("../img/346ab9e3701f79656efa95b2edb95ced_w750_h500.jpg"),
                        name: "بسبوسة اللوز",
                        Elta7der: '5 min',
                        Eltahy: "35 min",
                        Elsouba: "25",
                        components: "- لتحضير القطر :\nالماء : كوب\nسكر : كوب\nعصير الليمون : نصف ملعقة صغيرة (حامض)\n- السميد : كوب\n- حليب مكثف محلى : نصف علبة (أو 200 غرام)\n- الزبدة : نصف كوب (مذوّبة)\n- الماء : نصف كوب\n- بيكنج بودر : ثلاثة أرباع الملعقة الصغيرة\n- لوز : نصف كوب (مقشر / للزينة)",
                        view: true,
                        Step: "اخفقي الزبدة\nالحليب المكثّف المحلّى والبايكنغ باودر في وعاءٍ كبير.\nأضيفي السميد والماء واخفقي المكوّنات من جديد حتى تتماسك.\nادهني صينية فرن بالقليل من الزبدة ثمّ وزّعي العجينة السائلة فيها.\nقطّعي العجينة إلى مربّعات ورصّي حبّة لوز في وسط كل مربّع.\nاخبزي البسبوسة في فرنٍ محمّى لحوالي 35 دقيقة.\nتفقّدي نضج البسبوسة في الدقيقة الثلاثين.\nلتحضير الشيرة: ذوّبي السكر في الماء في قدرٍ على النار ثمّ اغلي المزيج لمدة 8 دقائق.\nارفعي القدر عن النار\nأضيفي عصير الليمون الحامض\nحرّكي المكوّنات ودعي القطر يبرد.\nاسكبي القطر البارد على البسبوسة ثمّ قدّميها عندما تتشرّبه.",
                        time: "40 min",
                        video: "https://www.youtube.com/watch?v=rBC2OphsOmE"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/a2363dc4f713e95ef97edbc437d4082b_w750_h500.jpg"),
                        name: "أم علي بالجلاش",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "50",
                        components: "- عجينة الجلاش الجاهزة : 250 غراما\n- الزبدة : 2 ملعقة كبيرة\n- حليب : لتر ونصف (سائل)\n- سكر : نصف كوب\n- كريمة : علبة (أو قشدة)\n- مكسرات : ربع كوب (يفضل استخدام البندق المجروش)",
                        view: true,
                        Step: "قطّعي عجينة الفيلو أو الجلاش إلى قطع صغيرة.\nذوّبي الزبدة في صينية فرن ثمّ ضعي فيها قطع العجين وأدخليها إلى فرن حامٍ حتى تجفّ وتتحمرّ قليلا.\nفي قدر\nإغلي الحليب مع السكر وحرّكي حتى يذوب السكر.\nاسكبي الكريمة أو القشدة وحرّكي حتى الغليان.\nضعي قطع الجلاش في صينية بايركس واسكبي فوقها مزيج الحليب.\nرشّي المكسرات بحسب الرغبة على وجه الطبق وأدخلي الصينية إلى الفرن لمدّة 20 دقيقة مع مراقبتها حتى لا يفور الحليب.\nقدّمي طبق أم علي بالجلاش ساخنا أو باردا مع إضافة القليل من الحليب بحسب الرغبة عند التقديم.",
                        time: "1 h",
                        video: "https://www.youtube.com/watch?v=Ankb7iqTI-0"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/723e9ba33c55e336b0ba3e2a75d8d038_w750_h500.jpg"),
                        name: "تشيز كيك بالكراميل",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "25",
                        components: "- جبن كريمي : 4 علب\n- سكر : كوب\n- حليب بودرة : كوب\n- جيلاتين : 2 ملعقة صغيرة\n- بسكويت الشاي السادة : حسب الحاجة\n- الزبدة : ملعقة كبيرة\n- كريم كراميل : حسب الحاجة (بارد / للتزيين)",
                        view: true,
                        Step: "في الخلاط الكهربائي\nاطحني البسكويت ثمّ اخلطيه مع الزبدة.\nفي قعر صينية تشيز كيك متحرّكة القاعدة\nمدّي طبقة البسكويت ورصّيها جيدا.\nأدخلي الصينية إلى الثلاجة حتى تجمد الطبقة قليلا.\nفي الخلاط الكهربائي\nضعي جبن الكريم والسكر والحليب والجيلاتين.\nاخلطي المكونات لمدّة ربع ساعة.\nضعي مزيج الكريم فوق البسكويت.\nأعيدي الصينية إلى الثلاجة لبعض الوقت.\nاسكبي الكريم كراميل البارد فوق التشيز كيك وأعيدي الصينية إلى الثلاجة لساعة على الأقل ثمّ قدّمي التشيز كيك باردا",
                        time: "1 h",
                        video: "https://www.youtube.com/watch?v=LQybdyLt9a8"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/2f7974a90e09c86fc80a7deec9c60408_w750_h500.jpg"),
                        name: "كيك البرتقال والمكسرات",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "30",
                        components: "- لتحضير الصلصة :\nعصير البرتقال : كوب\nالماء : كوب\nالنشاء : 2 ملعقة كبيرة\nسكر : 4 ملاعق كبيرة\nالجوز : ربع كوب\nجوز الهند : ربع كوب\n- البيض : 5 حبات\n- سكر : كوب\n- الزيت : نصف كوب\n- عصير البرتقال : نصف كوب\n- حليب : نصف كوب (سائل)\n- قشرة البرتقال : 2 ملعقة كبيرة (مبشور)\n- الفانيليا : ملعقة صغيرة\n- بيكنج بودر : 2 ملعقة صغيرة\n- دقيق : كوبان ونصف (منخول)\n- ملح : رشّة",
                        view: true,
                        Step: "حمّي الفرن على حرارة 180 درجة مئوية.\nفي الخلاط الكهربائي\nاخفقي البيض جيدا لمدّة 5 دقائق مع رشّة ملح والفانيليا حتى ينفش.\nاسكبي الزيت تدريجيا ثمّ عصير البرتقال والحليب واخققي جيدا.\nأضيفي الدقيق المنخول والبايكنغ باودر واخلطي حتى تتجانس المكونات.\nجهّزي صينية فرن وادهنيها بالزبدة ورشّيها بالدقيق.\nاسكبي خليط الكيك في الصينية وأدخليها إلى الفرن حوالي 45 دقيقة أو حتى ينضج الكيك.\nلتحضير الصلصة: في قدر\nضعي الماء وعصير البرتقال والنشاء والسكر على نار هادئة.\nاخلطي حتى تتجانس المكونات وتكثف الصلصة.\nاسكبي الصلصة على الكيكة.\nزيّني بالجوز وجوز الهند وشرائح البرتقال.",
                        time: "1 h",
                        video: "https://www.youtube.com/watch?v=deU9YNjljOo"
                    },
                    {
                        categortType: 5,
                        Image: require("../img/a6364eeb31782120e481f574dcdfb6f1_w750_h500.jpg"),
                        name: "قطايف مقلي بالجبن",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "50",
                        components: "- لتحضير العجينة :\nدقيق : 3 اكواب\nخميرة : 2 ملعقة صغيرة\nبيكنج بودر : ملعقة كبيرة\nماء الزهر : كوب\nالماء : كوبان ونصف\n- لتحضير القطر :\nسكر : 4 اكواب\nالماء : 2 كوب\nعصير الليمون : 2 ملعقة كبيرة\nماء الزهر : ربع كوب\n- جبن عكاوي : 500 غراما (منقوع ومقطع إلى مكعبات صغيرة)\n- الزيت : حسب الحاجة (للقلي)",
                        view: true,
                        Step: "لتحضير العجينة: أخلطي الخميرة في كوب من الماء واتركيه جانبا لبضع دقائق.\nضعي الدقيق والبايكنغ باودر ومزيج الخميرة وماء الزهر وما تبقى من كمية الماء في وعاء كبير ثمّ أخلطي بواسطة المضرب الكهربائي حتى تتجانس المكوّنات.\nأتركي عجينة القطايف جانبا لمدة ساعة على الأقل حتى ترتاح.\nإدهني مقلاة متوسطة الحجم بالقليل من الزيت وضعيها على نار متوسطة.\nأسكبي مقدار نصف كوب من العجينة في المقلاة واتركيها حتى يحمرّ قعرها ثمّ ضعيها في وعاء حتى تبرد.\nأعيدي الكرّة حتى ينتهي المزيج.\nأتركي قطع العجينة جانبا حتى تبرد.\nضعي حوالي ملعقة صغيرة من الجبن في كل قطعة عجينة ثمّ أغلقيها جيدا للحصول على شكل هلال.\nحمّي الزيت في مقلاة صغيرة على نار متوسطة وضعي قطع القطايف لمدة 5 دقائق تقريبا حتى تحمر من الجانبين.\nارفعي القدر عن النار وصفّي القطايف على ورقة مطبخ لإزالة كمية الزيت الزائدة.\n- لتحضير القطر: في قدر كبير\nسخني الماء مع السكر على نار متوسطة حتى الغليان ثمّ أضيفي عصير الليمون الحامض وماء الزهر مع التحريك بواسطة ملعقة خشبية حتى تتجانس المكوّنات ويثخن المزيج.\nارفعي القدر عن النار واتركي القطر جانبا ليبرد ثمّ أسكبيه في وعاء صغير.\nضعي قطع القطايف في طبق التقديم وقدّميها إلى جانب القطر",
                        time: "1 h",
                        video: "https://www.youtube.com/watch?v=RbPa88cB8uc"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/fccth.jpeg"),
                        name: "بقلاوة بالجوز",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "50",
                        components: "- عجينة الكلاج : عبوة\n- الجوز : كوب (مطحون)\n- سمن : نصف كوب (مذاب)\n- قطر : كوب",
                        view: true,
                        Step: "إفردي عجينة الكلاج الجاهزة على السطح المراد العمل عليه.\nإطوي طرف العجينة على عود خشبي\nحتى يُسهّل عليكِ عملية لّف العجينة.\nاحشي طرف العجينة بالجوز.\nلُفي العجينة على الحشوة\nثم اسحبي العود الخشبي من العجينة وضعيها جانبا.\nكرري الخطوة السابقة حتى نفاذ الكمية.\nادهني صينية الفرن بالسمن المذاب.\nضعي حبات الكلاج في الصينية.\nادهني وجه الكلاج بالسمن المذاب\nثم قطعيها.\nأدخلي الصينية إلى الفرن لمدة 10 دقائق.\nصُبي القطر بحسب الرغبة.",
                        time: "1 h",
                        video: "https://www.youtube.com/watch?v=AT63AheqIjg"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/009c0351d12fbec8a9d304db2a97ee47_w750_h500.jpg"),
                        name: "بلح الشام",
                        Elta7der: '5 min',
                        Eltahy: "25 min",
                        Elsouba: "30",
                        components: "- لتحضير العجينة :\nدقيق : كوب وثلثا الكوب\nالبيض : 5 حبات\nالماء : كوب وثلث\nالزيت النباتي : ثلث كوب\n- لتحضير القطر :\nالماء : كوب ونصف\nسكر : 3 اكواب\nعصير الليمون : 2 ملعقة صغيرة (حامض)\nماء الزهر : ملعقة كبيرة\n- الزيت النباتي : 4 اكواب (للقلي)",
                        view: true,
                        Step: "لتحضير القطر: ضعي الماء والسكر في قدر على النار واتركيهم حتى الغليان\nثمّ خففي النار\nأضيفي عصير الليمون الحامض وماء الزهر واتركيهم لدقيقتين إضافيتين\nثم ارفعي القطر عن النار ودعيه ليبرد.\nلتحضير العجينة: ضعي الماء في قدر مع الزيت النباتي واتركيهما حتى الغليان.\nأضيفي الدقيق واعجني المكونات بملعقة خشبية حتى تتماسك.\nارفعي القدر عن النار واتركي العجينة حتى تبرد.\nأضيفي البيض\nواحدة تلو الأخرى\nمع التقليب.\nسخّني الزيت في مقلاة عميقة.\nضعي العجينة في كيس حلويات ذي رأس عريض وشكّليها على هيئة أصابع طويلة\nوحمّريها في الزيت الساخن ثمّ ارفعيها عن النار.\nضعي بلح الشام في القطر البارد\nثمّ ارفعيه منه وقدّميه.",
                        time: "30 min",
                        video: "https://www.youtube.com/watch?v=wDuGXAZa4rM"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/cfbde0e735352d98aeed8f9209103ba9_w750_h500.jpg"),
                        name: "كريم كراميل",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "30",
                        components: "- البيض : 7 حبات\n- الخل الأبيض : ملعقة صغيرة\n- الفانيليا : 3 ملاعق صغيرة\n- حليب : كوبان ونصف (سائل)\n- سكر : كوب (أبيض)\n- الماء : 3 اكواب\n- سكر : نصف كوب (أبيض / لقعر الصينية)\n- أناناس : حسب الرغبة (معلب / للتزيين)",
                        view: true,
                        Step: "حمّي الفرن على حرارة 180 درجة مئوية.\nفي الخلاط الكهربائي\nاخفقي البيض البيضة تلو الأخرى إلى أن يصبح قوامها كالكريمة.\nأضيفي الفانيليا والخلّ الأبيض واخلطي.\nاسكبي الحليب تدريجيا ثمّ أضيفي السكر واخفقي جيدا\nواسكبي الماء وتابعي الخفق لحوالي دقيقة إلى أن تتجانس المكوّنات.\nصفّي المزيج في مصفاة كي لا يبقى فيه أيّ كتل.\nحمّي السكر المخصص لقعر الصينية في مقلاة على النار إلى أن يتخذّ لون الكراميل الذهبيّ.\nاسكبي الكراميل في قعر صينية فرن ووزّعيه من خلال تحريك الصينية يمينا ويسارا بيديك.\nانتظري حوالي 3 دقائق إلى أن يجفّ الكراميل ثمّ اسكبي المزيج في الصينية.\nغلّفي الصينية بإحكام بورق قصدير وضعيها على حمام مائي ثمّ أدخليها إلى الفرن لحوالي الساعة إلى أن تنضج.\nأخرجي الصينية من الفرن واتركيها لتبرد قليلا ثمّ ضعيها في الثلاجة من 3 إلى 4 ساعات.\nعند التقديم\nاقلبي الكريم كراميل في طبق وزيّني بقطع الأناناس.",
                        time: "1 h",
                        video: "https://www.youtube.com/watch?v=6QVmtVgYluU"
                    },
                    {
                        categortType: 4,
                        Image: require("../img/6ee204c5e7eb449d46886057bfd8fdaa_w750_h500.jpg"),
                        name: "كنافة بالمكسرات",
                        Elta7der: '10 min',
                        Eltahy: "30 min",
                        Elsouba: "50",
                        components: "- لتحضير الكنافة :\nعجينة كنافة : 500 غراما\nالزبدة : ربع كوب (أو سمن)\nسكر البودرة : ملعقة صغيرة\n- لتحضير الحشوة :\nمكسرات : حسب الرغبة (لوز\nبندق\nفول سوداني أو أي نوع من المكسرات)\nالقرفة : ملعقة صغيرة (مطحونة)\nسكر : ملعقة صغيرة\nجوز الهند : ملعقة كبيرة\nزبيب : حسب الرغبة\n- لتحضير الشيرة :\nسكر : كوبان ونصف\nالماء : 3 اكواب\nالزبدة : ملعقة صغيرة (أو سمن)\nالفانيليا : رشّة",
                        view: true,
                        Step: "لتحضير الكنافة: حمّي الفرن على حرارة 200 درجة مئوية.\nفي وعاء\nافركي الكنافة جيدا.\nأضيفي إليها الزبدة (أو السمن) المذوّبة والسكر ووزعيها جيدا.\nلتحضير الحشوة: في وعاء آخر\nاخلطي جميع المكسرات معا.\nأضيفي فوقها السكر والقرفة وجوز الهند والزبيب.\nادهني صينية بالزيت ثم ضعي فيها نصف كمية الكنافة.\nضعي فوق الكنافة مزيج المكسرات ثمّ طبقة من كمية الكنافة المتبقية.\nأدخلي الصينية إلى الفرن إلى أن يصبح وجه الكنافة ذهبيّ اللوّن.\nلتحضير الشيرة (القطر): في قدر\nضعي السكر والماء والزبدة (أو السمن) والفانيليا.\nاتركي المزيج على النار إلى أن يغلي.\nضعي الشيرة جانبا حتى تبرد.\nأخرجي صينية الكنافة فورا من الفرن وهي لا تزال ساخنة\nواسكبي عليها الشيرة وقدّميها.",
                        time: "40 min",
                        video: "https://www.youtube.com/watch?v=wpjyQyf-Mh8"
                    },
                    {
                        categortType: 5,
                        Image: require("../img/flkth.jpeg"),
                        name: "القطايف بالمكسرات",
                        Elta7der: '5 min',
                        Eltahy: "25 min",
                        Elsouba: "25",
                        components: "- للقطر :\nالماء : كوب\nسكر : 2 كوب\nعصير الليمون : ملعقة كبيرة\n- الجوز : نصف كيلو (مفروم)\n- زبيب : ربع كيلو\n- سكر : ملعقة كبيرة\n- القرفة : ملعقة صغيرة (مطحونة)\n- الزبدة : ملعقة كبيرة\n- القطايف : حسب الحاجة\n- الزيت : غزير (للقلي)",
                        view: true,
                        Step: "اخلطي الجوز مع الزبيب في طبق\nوأضيفي السكر\nوالقرفة المطحونة.\nأضيفي الزبدة\nوقلبي المكونات جيدا حتى تتجانس.\nاحشي القطايف بالحشوة.\nلتحضير القطر: في قدر صغيرة على النار صبي الماء\nثم أضيفي السكر\nواتركي المكونات لتغلي وعند الغليان أضيفي عصير الليمون.\nسخني زيت غزير في مقلاة على النار\nواقلي حبات القطايف حتى تتحمر\nوانقليها فورا للقطر البارد.\nقدمي القطايف ساخنا أو دافئا",
                        time: "30 min",
                        video: "https://www.youtube.com/watch?v=sEzUAeiuFZ0"
                    },
                    {
                        categortType: 5,
                        Image: require("../img/dd850b85666ae50c645ad350edae99b7_w750_h500.jpg"),
                        name: "قطايف بالفستق الحلبي",
                        Elta7der: '10 min',
                        Eltahy: "25 min",
                        Elsouba: "40",
                        components: "- القطايف : 500 غراما\n- فستق حلبي : نصف كوب (مفروم ناعم)\n- ماء الزهر : ملعقة كبيرة\n- سكر البودرة : ملعقة كبيرة\n- شيرة : 2 كوب\n- السمنة : 2 ملعقة كبيرة (مذابة)\n- مستكة : ربع ملعقة صغيرة (مطحونة)",
                        view: true,
                        Step: "اخلطي الفستق الحلبي مع المستكة والسكر البودرة وماء الزهر.\nاحشي حبات القطايف بكمية وافرة من المزيج.\nادهني صينية فرن بالقليل من السمن.\nادهني القطايف المحشية بالسمن المذاب بواسطة فرشاة.\nأدخلي الصينية للفرن على حرارة 180 درجة لمدة 25 دقيقة حتى تصبح القطايف ذهبية اللون ومقرمشة.\nضعي القطايف الساخنة في القطر البارد وقدميها ساخنة.",
                        time: "1 h",
                        video: "https://www.youtube.com/watch?v=1lu_tCNbzsw"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/70f1f36a0c9db5caa679addf430db51a_w750_h500.jpg"),
                        name: "سلطة فواكة بعصير البرتقال",
                        Elta7der: '5 min',
                        Eltahy: "25 min",
                        Elsouba: "25",
                        components: "- الفراولة : نصف كوب (مقطعة أنصاف)\n- التفاح : 1 حبة (كبير الحجم / مقشرة ومفرومة مكعبات)\n- الموز : 1 حبة (مقطع دوائر)\n- كيوي : 1 حبة (مفروم)\n- عصير البرتقال : ربع كوب\n- عصير الليمون : ملعقة كبيرة",
                        view: true,
                        Step: "اخلطي الفراولة والتفاح والموز والكيوي في طبق.\nوزعي عصير البرتقال وعصير الليمون فوق الفواكة واخلطي المزيج حتى يتجانس.\nاخفظيها في الثلاجة لمدة ساعة قبل التقديم وقدميها باردة.",
                        time: "30 min",
                        video: "https://www.youtube.com/watch?v=JRimI72VAek"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/kollaj.jpg"),
                        name: "الكلاج بالقشطة",
                        Elta7der: '5 min',
                        Eltahy: "25 min",
                        Elsouba: "25",
                        components: "- عجينة الكلاج : 12 حبة\n- القشطة : 1 كيلو (طازجة)\n- حليب : نصف لتر (طازج)\n- فستق حلبي : حسب الرغبة (للزينة)\n- سكر : كوبان (القطر)\n- الماء : كوب (القطر)\n- ماء الزهر : ملعقة (القطر)\n- ماء الورد : ملعقة (القطر)\n- عصير الليمون : ربع ملعقة (القطر)",
                        view: true,
                        Step: "1. تفرد عجينة الكلاج على طاولة التحضير وتضاف القشطه الطازجة  حوالي 80 غرام في وسط العجينة  وتغلق العجينة من اليمين واليسار وتلف بشكل مستطيل. وتلف باقي الكمية بنفس الطريقة.\n2. في وعاء يسكب الحليب الطازج ثم تغمس قطع الكلاج بالحليب لمدة نصف دقيقة وتقلى بزيت حامي حتى تحمر وتأخذ لونا ذهبيا. ترفع قطع الكلاج المقلية من النار وتضاف إلى القطر البارد وتترك لمدة عشر دقائق.\n3. تصفى قليلا من القطر وتزيين بالفستق وتقدم ساخنة.\n4. القطر: يوضع السكر والماء على النار ويترك ليغلي قليلا يضاف عصير الحامض وماء الزهر والورد ويترك على حده ليبرد.",
                        time: "30 min",
                        video: "https://www.youtube.com/watch?v=9WRZoRISal4"
                    },
                    {
                        categortType: 2,
                        Image: require("../img/dddfgghth.jpeg"),
                        name: "المهلبية بالمكسرات",
                        Elta7der: '10 min',
                        Eltahy: "50 min",
                        Elsouba: "25",
                        components: "- القشطة : 600 ملليلتر\n- حليب : كوب\n- الشوكولاتة البيضاء : 180 غم\n- السكر الناعم : ربع كوب\n- جيلاتين : 6 ورقات (أو 3 ملعقة صغيرة من الجيلاتين)\n- ماء الورد : ملعقة كبيرة (أو الورد)",
                        view: true,
                        Step: "1. ضعي الحليب والقشطة في قدر على النار وأضيفي الورد وحبات الهيل.\n2. ثم أضيفي السكر\nوحركي حتى الغليان.\n3. ثم أضيفي الشوكولاتة البيضاء والجيلاتين.\n4. صفي المزيج بالمصفاة.\n5. وصبي خليط المهلبية بأطباق التقديم.",
                        time: "1 h",
                        video: "https://www.youtube.com/watch?v=iMclG8Jt36E"
                    },
        
                    {
                        categortType: 1,
                        Image: require("../img/9efbabc53922b47f077743df46a16b30_w750_h500.jpg"),
                        name: "الغريبة",
                        Elta7der: '5 min',
                        Eltahy: "25 min",
                        Elsouba: "20",
                        components: "- الزبدة : كوبان\n- السكر الناعم : كوب\n- دقيق : 4 اكواب\n- فستق : كوب (مقطع أنصاف)\n- بياض البيض : 1 حبة\n- الفانيليا : ملعقة صغيرة\n- ملح : ربع ملعقة صغيرة",
                        view: true,
                        Step: "1. في وعاء\nضعي الزبدة وقلبيه جيدا ثم أضيفي السكّر\nمع الاستمرار في التقليب.\n2. أضيفي الدقيق بالتّدريج مع الاستمرار في التقليب\nليصبح لديك خليط كثيف.\n3. أضيفي زلال البيض\nويمكن خلط المُكوّنات بالعجانة الكهربائية لتضمني امتزاجها جيدا.\n4. ضعي الفستق المقطّع إلى أنصاف في صحن منفصل.\n5. شكّلي الخليط حسب رغبتك بالشكل الذي تحبين\nكشكل كرة صغيرة\nأو شكل حلزوني أو غيره من الأشكال بحسب الرغبة.\n6. ضعي حبّة من الفستق أو اللّوز في مُنتصف الخليط للزّينة\nوكرّري الخطوات على كامل عجينة الغريبة إلى حين الانتهاء من كامل العجينة.\n7. سخّني الفرن لدقائق على درجة 180 قبل وضع الصينيّة.\n8. ضعي الغريبة في صينية وضعيها في الفرن لمدّة 15 دقيقة\nواجعلي حرارته متوسّطة\nوحاولي ألّا يتغيّر لونها. ",
                        time: "30 min",
                        video: "https://www.youtube.com/watch?v=RYEQOoxJtCY"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/c7a0a60c91ebac9bd353c0ea4df20e58_w750_h500.jpg"),
                        name: "بان كيك بالشوكولاتة",
                        Elta7der: '5 min',
                        Eltahy: "30 min",
                        Elsouba: "20",
                        components: "- حليب : كوب\n- البيض : 1 حبة\n- الزبدة : 2 ملعقة كبيرة (مذوبة)\n- طحين : كوب\n- بودرة الكاكاو : نصف كوب\n- سكر : ربع كوب\n- بيكنج صودا : نصف ملعقة صغيرة\n- ملح : نصف ملعقة صغيرة\n- سكر البودرة : 3 ملاعق كبيرة",
                        view: true,
                        Step: "1. اخلطي الحليب والبيض والزبدة المذوبة في عاء حتى تمتزج المكونات جيدا.\n2. اخلطي الطحين والكاكاو البودرة والسكر والبيكنج صودا والملح في وعاء آخر.\n3. أضيفي خليط الحليب والبيض لخليط الطحين والكاكاو وحركي حتى تمتزج المكونات.\n4. سخني مقلاة على نار متوسطة.\n5. ضعي كمية من خليط البان كيك وحمريها لمدة دقيقتين على كل وجه.\n6. زيني البان كيك بالسكر البودرة أو الفواكة أو المربى حسب الرغبة.",
                        time: "35 min",
                        video: "https://www.youtube.com/watch?v=xOYp_CWgk7E"
                    },
                    {
                        categortType: 1,
                        Image: require("../img/kas.jpg"),
                        name: "كاسترد بالفراولة",
                        Elta7der: '5 min',
                        Eltahy: "30 min",
                        Elsouba: "30",
                        components: "- بودرة الكاسترد الجاهزة : 6 ملاعق كبيرة\n- حليب : 7 اكواب (سائل)\n- بسكويت الشاي السادة : عبوة (مكسّر)\n- الفراولة : كوب (حبات)\n- سكر : نصف كوب\n- جوز الهند : 3 ملاعق كبيرة",
                        view: true,
                        Step: "في قدر على النار\nذوّبي الكاسترد مع الحليب والسكر حتى يغلي ويثخن قوامه.\nأضيفي البسكويت على الكاسترد\nثم أضيفي الفراولة\nوجوز الهند.\nاسكبي الكاسترد في أكواب التقديم\nوزينيه بالفراولة بحسب الرغبة\nواتركيه حتى يبرد بالثلاجة\nوقدميه",
                        time: "35 min",
                        video: "https://www.youtube.com/watch?v=5P2pjh4a-9Y"
                    },
                    {
                        categortType: 2,
                        Image: require("../img/82b4a96f27f086db1d3ac4ee4d097872_w750_h500.jpg"),
                        name: "مهلبية بالكاسترد",
                        Elta7der: '5 min',
                        Eltahy: "50 min",
                        Elsouba: "35",
                        components: "- حليب : 4 اكواب\n- البيض : 6 حبات\n- صفار البيض : 2 حبة\n- سكر : نصف كوب\n- الفانيليا : نصف ملعقة صغيرة",
                        view: true,
                        Step: "1. قومي بتشغيل الفرن على درجة حرارة 200.\n2. سخني الحليب في وعاء على نار متوسطة الحرارة مدّة خمس دقائق دون أن يغلي.\n3. أبعدي الحليب عن النار\nثمّ اتركيه جانبا حتى يبرد.\n4. أضيفي الفانيلا  إلى الحليب وامزجيه جيدا.\n5. ضعي كلا من: البيض وصفار البيض في وعاء وامزجهما جيدا بواسطة الشوكة\nيجب عدم استخدام الخفاقة الكهربائية.\n6. أضيفي الحليب إلى خليط البيض تدريجيا مع استمرار الخفق بواسطة الشوكة.\n7. صفي خليط الكاسترد من خلال مصفاة\nواسكبيه في صينية فرن بعمق خمس سنتيمترات على الأقل.\n8. جهزي صينية فرن بحجم أكبر\nوضعي منشفة وسطها\nوثبتي صينية خليط الكاسترد فوق المنشفة\nثمّ اسكبي الماء الساخن في الصينية الكبيرة حتى يصل لمنتصفها.\n9. اخفضي درجة حرارة الفرن إلى 160 مئوية\nوضعي الصينية في الفرن مدة 40 - 45 دقيقة.\n10. أخرجي الصينية من الفرن واتركي الكاسترد حتى يبرد\nثمّ احفظيه في البراد مدّة أربع ساعات على الأقل قبل التقديم حتى يبرد تماما.",
                        time: "55 min",
                        video: "https://www.youtube.com/watch?v=zsBZs7SXNPE"
                    },

                    {
                        categortType: 3,
                        Image: require("../img/602bfa39ff9bc5bb11b5f4d0f41c5c54_w750_h500.jpg"),
                        name: "بسبوسة بالهيل",
                        Elta7der: '5 min',
                        Eltahy: "50 min",
                        Elsouba: "35",
                        components: "- سميد خشن : 2 كوب\n- طحين : كوب\n- لبن زبادي : 2 كوب\n- بيكنج بودر : 2 ملعقة صغيرة\n- الزيت النباتي : ربع كوب\n- ملح : ربع ملعقة صغيرة\n- هيل : ملعقة صغيرة (مطحون)\n- البيض : 1 حبة\n- سكر : نصف كوب\n- قطر : 2 كوب (شيرة)\n- الفانيليا : ملعقة صغيرة",
                        view: true,
                        Step: "اخلطي البيضة مع الفانيلا والسكر والزيت حتى يصبح المزيج ناعما ومتجانسا.\nأضيفي اللبن الزبادي.\nأضيفي الطحين والسميد والملح والبيكنج باودر والهيل المطحون وقلبي المزيج جيدا حتى تتجانس المكونات.\nادهني صينية الفرن بالقليل من الطحينة.\nصبي مزيج البسبوسة في الصينية وأدخليها الفرن على حرارة 170 درجة لمدة 20 دقيقة حتى تنضج وتتحمر.\nأخرجي الصينية من الفرن ووزعي القطر البارد عليها واتركيها لتبرد لمدة 10 – 15 دقيقة.\nقطعيها وقدميها دافئة أو باردة حسب الرغبة.",
                        time: "55 min",
                        video: "https://www.youtube.com/watch?v=NavbHtGCyaE"
                    },


                    {
                        categortType: 3,
                        Image: require("../img/download(5).jpg"),
                        name: "بسبوسه جوز الهند",
                        Elta7der: '5 min',
                        Eltahy: "30 min",
                        Elsouba: "20",
                        components: "كيس بسبوس\nهكاجو للزينه\nشربات كوب ونص سكر وك ماء وعصره ليمون وهيل وقرفه\nالكيس جاهز فيه بيكنيج بودره وفانيليا\nجوز هند حسب الكميه\nزيت لدهن الصينيه\nعلبه زبادي",
                        view: true,
                        Step: "كيس بسبوسه\nضيفت معلقتين دقيق وعلبه زبادي ومعلقتين سكر\nوقلبت الخليط جيدا ودهنت الصينيه زيت وضعت الخليط في الصينيه ودخلتها الفرن حوالي نص ساعه حسب فر نكجهزت الشربات كوب ونص سكر وكوب ماء وعصره ليمون وعود قرفه وهيل دى اختيارى\nبعد ما طلعتها من الفرن رشيت عليها الشربات",
                        time: "35 min",
                        video: "https://www.youtube.com/watch?v=LF7lxXhWlGk"
                    },
                    {
                        categortType: 3,
                        Image: require("../img/download(6).jpg"),
                        name: "بسبوسة بالكرميل",
                        Elta7der: '5 min',
                        Eltahy: "30 min",
                        Elsouba: "20",
                        components: "2 كوب و نص سميد بسبوس\nةم ك ممسوحه بيكنج بودر\nرشه ملح\nكوب لبن\nكوب الا وبع سمنه ع زبده\nكوب سكر\nشربات ساخن\nم ك طحينه\nمكسرات للتزين",
                        view: true,
                        Step: "ف الاول هانحط السكر لحد ما يدوب كلو وياخد لونو الدهبي و بعدها ننزل بالزبده ع السمنه السايحه و نقلبو كويس ننزل بكوبيه اللبن و نقلب ع نار هاديه لمده 7 دقايق يفك كلو مع بعضو و نطفي النار\nدهنت الصنيه طحينه\nف بوله هانحط السميد مع البيكنج بودر و رشه ملح بسيطه و ننزل بخليط الكرميل و نقلب لحد ما البسبوسه تتشرب كل الخليط السايل ندهن الصنيه بالطحينه و نبدا نرص البسوسبه انا هنا بعد ما خلصت بليت ايدي شويه لبن وًمسحت وش الصنيه عشان تتساوي و كمان اللبن بيخليها تاخد درجه لون حلوا اكتييير. حطيت المكسراات و قطعتها و دخلتها الفرن لحد ما استوت\nاول ما طلعتها سقيتها بالسيرب الساخن و غطيتها و خليتها لمده ساعتين و بعدها رفعت عنها الغطا و بالهنا و الشفا",
                        time: "35 min",
                        video: "https://www.youtube.com/watch?v=EAbiF2JRSL8"
                    },

                ],
                SearchKey: "",
                animation_display: false,

            }
        }
    }

    backAction = () => {

        BackHandler.exitApp()

        return true;
    };

    componentWillUnmount() {
        this.backHandler.remove();
    }


    componentDidMount() {
        this.backHandler = BackHandler.addEventListener(
            "hardwareBackPress",
            this.backAction
        );

    }


    search(text) {
        let list = this.state.All_meal
        let count = 0
        for (let i = 0; i < list.length; i++) {
            if (((list[i].name).toUpperCase()).includes(text.toUpperCase())) {
                list[i].view = true

            }
            else {
                list[i].view = false
                count++
            }
        }

        if (count == list.length) {
            this.state.animation_display = true
        }


        if (count != list.length) {
            this.state.animation_display = false

        }



        this.setState({ All_meal: list })
        count = 0
    }

    render() {
        return (
            <>
                <View style={{ flex: 1, backgroundColor: COLORS.pramary }}>

                </View>
                <View style={styles.headerbar}>
                    <Text style={styles.textheader}>
                        البحث
                    </Text>
                </View>

                {/* <Text>Search</Text> */}
                <View style={styles.main}>

                    <View style={styles.SearchView}>
                        <TextInput
                            underlineStyle={{ width: 0 }}
                            style={styles.searchInput}


                            placeholder={"البحث عن الاكلات بالمكونات...                                          "}
                            placeholderTextColor={COLORS.grayFont}
                            value={this.state.SearchKey}
                            onChangeText={(value) => {
                                this.search(value)
                                this.setState({
                                    SearchKey: value
                                })
                            }}


                        />
                        <Ionicons name='search' size={ICONSSIZE.lIcon} color={COLORS.pramary} />



                    </View>
                    <ScrollView showsVerticalScrollIndicator={false}>

                        {this.state.animation_display ? (
                            <>
                                <View style={{ alignItems: "center", justifyContent: "center", alignSelf: "center", width: width, height: height / 1.5 }}>
                                    <LottieView
                                        ref={this.ref}
                                        source={require("../lottie/search_empty.json")}
                                        loop={true}
                                        autoPlay={true}
                                        speed={1.5}
                                    // style={{ alignSelf: "center" }}
                                    />
                                </View>
                            </>
                        ) :
                            (
                                <>
                                    {this.state.All_meal.map((item, index) =>

                                        item.view ? (
                                            <TouchableOpacity style={styles.mealView}
                                                onPress={() => {
                                                    this.props.navigation.navigate("Photo_page", {
                                                        name: item
                                                    })
                                                }}>
                                                <Image source={item.Image}
                                                    style={styles.mealIMAGE}
                                                />
                                                <View>
                                                    <Text

                                                        numberOfLines={1}
                                                        style={[styles.mealNAME, { color: COLORS.white, }]}>
                                                        {item.name}
                                                    </Text>
                                                    <Text style={[styles.mealNAME, { fontSize: 15 }]}>
                                                        المكونات
                                                    </Text>

                                                    <Text
                                                        numberOfLines={1}
                                                        style={[styles.mealNAME, { fontSize: 15 }]}>
                                                        {item.components}
                                                    </Text>
                                                </View>

                                            </TouchableOpacity>
                                        )
                                            :
                                            null





                                    )}

                                </>



                            )
                        }

                        <View style={{ height: 100 }}></View>
                    </ScrollView>
                </View>
            </>
        );
    }
}

const styles = StyleSheet.create({
    main: {
        backgroundColor: COLORS.pramary,
        alignItems: "center",
        height: height,
    },
    headerbar: {
        backgroundColor: COLORS.pramary,
        height: height / 10,
        justifyContent: "center"
    },
    textheader: {
        fontSize: FONTS.h1,
        color: COLORS.ButtonWhite,
        alignSelf: "center",
        fontFamily: "Generator Black",
        // marginLeft: "50%",
    }
    ,
    SearchView: {
        width: width / 1.1,
        backgroundColor: COLORS.white,
        height: height / 15,
        margin: MARGIN.xxsMargin,
        borderRadius: RADIUS.xxsRadius,
        // borderWidth: 1,
        flexDirection: "row",
        alignItems: "center",
        justifyContent: "space-between",
        marginVertical: MARGIN.xsMargin,
        padding: PADDING.xsPadding

    }
    ,
    searchInput: {
        width: width / 1.3,
        height: height / 16,
        alignItems: "flex-end",
        justifyContent: "flex-start",
        fontFamily: "Generator Black",
        textAlign: "right",
        backgroundColor: COLORS.white,
        paddingHorizontal: PADDING.smPadding,
        fontSize: FONTS.h4,


    }
    ,
    searchIcon: {
        width: width * 0.05,
        height: height * 0.03,
        marginHorizontal: MARGIN.xsMargin
    }
    ,
    mealView: {
        width: width / 1.1,
        height: height / 8,
        backgroundColor: COLORS.pramary50,
        marginVertical: MARGIN.xsMargin,
        padding: PADDING.smPadding,
        borderRadius: RADIUS.xxsRadius,
        elevation: 5,
        flexDirection: "row-reverse",
        alignItems: "center",
        justifyContent: "space-between"
    },
    mealIMAGE: {
        width: width / 3.5,
        height: height / 10,
        borderRadius: RADIUS.xxsRadius,

    }
    ,
    mealNAME: {
        fontSize: FONTS.h2,
        color: COLORS.gray,
        fontFamily: "Generator Black",
        maxWidth: width / 2,
        textAlign: "left"
    }
});
